Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: E-book viewer: Fix navigation shortcuts not working in Read aloud mode
fr: Visionneuse de livres numériques : Correction des raccourcis de navigation ne fonctionnant pas en mode lecture à voix haute

source: 17 Apr, 2021
fr: 17 avril 2021
pt_br: 17 de Abril de 2021

source: CHM Input: Fix handling of some CHM files that use non-ASCII internal filenames and don't specify a character encoding in their metadata
fr: Format CHM en entrée : Correction de la gestion de certains fichiers CHM qui utilisent des noms de fichiers internes non-ASCII et qui ne spécifient pas de codage de caractères dans leurs métadonnées

source: Fix a regression in the previous release that prevented calibre from starting if there was a failure in a third party plugin
fr: Correction d'une régression dans la version précédente qui empêchait calibre de démarrer en cas de défaillance d'un plugin tiers
pt_br: Corrige um regressão na versão anterior que impedia o calibre de iniciar se houvesse uma falha em um plugin de terceiros

source: Content server viewer: Fix a regression in the previous that broke handling of URLs in stylesheets
fr: Visionneuse du Serveur de contenu : Correction d'une régression dans la version précédente qui interrompait la gestion des URL dans les feuilles de style
pt_br: Visualizador do Servidor de conteúdo: Corrige uma regressão na versão anterior que danificou a manipulação de URLs nas folhas de estilo

source: Fix a regression in the previous release that broke changing sections in the convert single book dialog after changing the input or output formats
fr: Correction d'une régression dans la version précédente qui empêchait de changer de section dans la boîte de dialogue de conversion de livre unique après avoir modifié les formats d'entrée ou de sortie
pt_br: Corrige uma regressão na versão anterior que danificou a alteração de seções no diálogo de conversão de único livro, após alterar os formatos de entrada ou saída

source: Fix using 'is set' rules not working for column rules with rating values
fr: Correction de l'utilisation des règles "is set" qui ne fonctionnent pas pour les règles de colonnes avec des valeurs de classement
pt_br: Corrige utilização de regras 'está definido' não funcionando para regras de colunas com valores de avaliação

source: E-book viewer: Fix a regression in 5.15 that causes the viewer to ignore page-break CSS properties (in 5.16.1)
fr: Visionneuse de livres numériques : Correction d'une régression dans 5.15 qui fait que la visionneuse ignore les propriétés CSS de rupture de page (dans 5.16.1)
pt_br: Visualizador de e-books: Corrige uma regressão na versão 5.15 que fazia com que o visualizador ignorasse a propriedade CSS page-break (na versão 5.16.1)

source: Fix a regression that broke using stored templates (in 5.16.1)
fr: Correction d'une régression qui empêchait l'utilisation de modèles stockés (dans 5.16.1)
pt_br: Corrige uma regressão que danificou o uso de modelos salvos (na versão 5.16.1)

source: Fix auto scroll books shortcut not working in standalone cover browser window (in 5.16.1)
fr: Correction du raccourci de défilement automatique des livres ne fonctionnant pas dans la fenêtre du navigateur de couverture autonome (dans 5.16.1)
pt_br: Corrige atalho de auto rolagem de livros não funcionando na janela independente do navegador de capas (na versão 5.16.1)

source: E-book viewer: Fix jumping to previous section sometimes not working in flow mode (in 5.16.1)
fr: Visionneuse de livres électroniques : Correction du saut à la section précédente qui ne fonctionne parfois pas en mode flux (dans 5.16.1)
pt_br: Visualizador de e-books: Corrige salto para seção anterior às vezes não funcionando no modo de fluxo (na versão 5.16.1)

source: E-book viewer: Fix a regression in 5.15 that broke changing keyboard shortcuts in the viewer preferences (in 5.16.1)
fr: Visionneuse de livres numériques : Correction d'une régression dans la version 5.15 qui empêchait la modification des raccourcis clavier dans les préférences de la visionneuse (dans la version 5.16.1)
pt_br: Visualizador de e-books: Corrige uma regressão na versão 5.15 que danificou a alteração de atalhos de teclado nas preferências do visualizador (na versão 5.16.1)

source: E-book viewer: Fix a regression in 5.15 that broke using the delete key to delete highlights (in 5.16.1)
fr: Visionneuse de livres numériques :Correction d'une régression dans la version 5.15 qui empêchait l'utilisation de la touche de suppression pour supprimer les mises en évidence (dans la version 5.16.1)
pt_br: Visualizador de e-books: Corrige uma regressão na versão 5.15 que danificou a utilização da tecla delete para apagar destaques (na versão 5.16.1)

source: 16 Apr, 2021
fr: 16 avril 2021
pt_br: 16 de Abril de 2021

source: Allow auto scrolling through the list of books by pressing the X key or right clicking on the cover browser
fr: Permettre le défilement automatique de la liste des livres en appuyant sur la touche X ou en cliquant avec le bouton droit de la souris sur le navigateur de couverture
pt_br: Permite auto rolagem da lista de livros ao pressionar a tecla X ou clicar com o botão direito na navegação de capas

source: Useful to have a "slideshow" of book covers. The speed of scrolling can be controlled in Preferences-&gt;Look &amp; feel-&gt;Cover browser
fr: Utile pour avoir un "diaporama" des couvertures de livres. La vitesse de défilement peut être contrôlée dans Préférences->Apparence & présentation->Navigateur de couvertures
pt_br: Útil para ter um "slideshow" de capas de livros. A velocidade da rolagem pode ser controlada em Preferências -&gt;Aparência-&gt;Navegador de capas

source: E-book viewer: Speed up first time open for EPUB files with lots of styling
fr: Visionneuse de livres numériques : Accélère la première ouverture des fichiers EPUB qui ont beaucoup de styles
pt_br: Visualizador de e-books: Acelera a primeira abertura de arquivos EPUB com muitos estilos

source: E-book viewer preferences: Allow searching for keyboard shortcuts
fr: Préférences de la visionneuse de livres numériques : Autoriser la recherche de raccourcis clavier
pt_br: Preferências do visualizador de e-books: Permite pesquisar atalhos de teclado

source: Edit book: Allow editing WEBP images
fr: Éditer le livre : Permettre de modifier les images WEBP
pt_br: Editar livro: Permite editar imagens WEBP

source: Various improvements to the template language, see <a href="%(h0)s">%(h0)s</a>
fr: Diverses améliorations au langage des modèles, voir <a href="%(h0)s">%(h0)s</a>
pt_br: Várias melhorias na linguagem de modelo, veja <a href="%(h0)s">%(h0)s</a>

source: E-book viewer: Show the current progress percentage in the bottom bar of the viewer controls. This can be customized in the viewer preferences under Headers and footers
fr: Visionneuse de livres numériques : Afficher le pourcentage de progression actuel dans la barre inférieure des contrôles de la visionneuse. Ceci peut être personnalisé dans les préférences de la visionneuse sous En-têtes et pieds de page.
pt_br: Visualizador de e-books: Mostra a porcentagem de progresso atual na barra inferior dos controles do visualizador. Isso pode ser personalizado nas preferências do visualizador, em Cabeçalhos e rodapés

source: E-book viewer: Add an option under Preferences-&gt;Miscellaneous to not restore open panels such as Search, Table of Contents etc on restart
fr: Visionneuse de livres numériques : Ajout d'une option sous Préférences->Divers pour ne pas restaurer les panneaux ouverts tels que Recherche, Table des Matières, etc. au redémarrage
pt_br: Visualizador de e-books: Adiciona uma opção em Preferências-&gt;Extras para não restaurar painéis abertos, como Buscar, Índice e etc, ao reiniciar

source: When exporting highlights as text or Markdown also output top level chapter titles
fr: Lors de l'exportation des mises en évidence au format texte ou Markdown, les titres des chapitres de premier niveau sont également affichés

source: Allow downloading metadata from amazon.se
fr: Permettre le téléchargement de métadonnées depuis amazon.se
pt_br: Permite baixar metadados da amazon.se

source: Preferences-&gt;Tweaks: Allow specifying that calibre should open the book details window when double clicking on a book
fr: Préférences->Ajustements : Permettre de spécifier que calibre doit ouvrir la fenêtre de détails du livre lorsqu'on double-clique sur un livre
pt_br: Preferências-&gt;Ajustes: Permite especificar que o calibre deve abrir a janela de detalhes do livro ao dar um duplo-clique em um livro

source: MOBI Output: Convert WebP images to PNG so they work with Amazon's software
fr: Format MOBI en sortie : Convertir les images WebP en PNG pour qu'elles fonctionnent avec le logiciel d'Amazon
pt_br: Saída MOBI: Converte imagens WebP para PNG, de tal forma que elas funcionem com o software da Amazon

source: DOCX Input: When converting embedded fonts, replace spaces in the filename with underscores to keep the execrable epubcheck happy
fr: Format DOCX en entrée : Lors de la conversion des polices incorporées, remplacer les espaces dans le nom du fichier par des tirets bas afin de satisfaire l'exécrable epubcheck
pt_br: Entrada DOCX: Ao converter fontes incorporadas, substitui espaços no nome do arquivo com underline para satisfazer o execrável epubcheck

source: E-book viewer: Selection bar: Add keyboard shortcuts for all buttons. Hover over a button in the bar to see the shortcut
fr: Visionneuse de livres numériques : Barre de sélection : Ajout de raccourcis clavier pour tous les boutons. Passez la souris sur un bouton de la barre pour voir le raccourci
pt_br: Visualizador de e-books: Barra de seleção: Adiciona atalhos de teclado para todos os botões. Passe o mouse sobre um botão na barra para ver o atalho

source: FB2 Output: Fix a regression in calibre 5 that caused paragraphs containing only non-breaking spaces to be removed
fr: Format FB2 en sortie : Correction d'une régression dans calibre 5 qui entraînait la suppression des paragraphes ne contenant que des espaces insécables
pt_br: Saída FB2: Corrige uma regressão no calibre 5 que fazia com que parágrafos contendo apenas espaços não-separáveis fossem removidos

source: Metadata comments editor: Fix setting block alignment destroying other block level properties
fr: Éditeur de commentaires de métadonnées : Correction du réglage de l'alignement des blocs détruisant d'autres propriétés au niveau des blocs
pt_br: Editor de comentários dos metadados: Corrige definição de alinhamento de bloco destruindo outras propriedades no nível de bloco

source: E-book viewer: Fix margins not being adjusted immediately when preferences are changed
fr: Visionneuse de livres numériques : Correction des marges qui ne sont pas ajustées immédiatement lorsque les préférences sont modifiées
pt_br: Visualizador de e-books: Corrige margens não sendo ajustadas imediatamente quando as preferências são alteradas

source: Edit book: Upgrade book internals: Fix skipping the NCX removal dialog not remembering the chosen option
fr: Éditer le livre : Mise à jour des internes du livre : Correction de l'omission de la boîte de dialogue de suppression du NCX qui ne se souvient pas de l'option choisie
pt_br: Editar livro: Upgrade do código interno do livro: Corrige diálogo para remover o NCX não se lembrando a opção escolhida

source: Conversion: When specifying a line-height do not apply it to the &lt;html&gt; tag, as it is pointless and causes the execrable epubcheck to complain
fr: Conversion : Lors de la définition d'une hauteur de ligne, ne pas l'appliquer à la balise <html>, car cela est inutile et provoque une plainte de l'exécrable epubcheck
pt_br: Conversão: Ao especificar uma altura de linha, não aplicá-la à tag &lt;html&gt;, uma vez que não faz sentido e faz com que o execrável epubcheck reclame

source: E-book viewer: Improve scrolling behavior when extending the selection using keyboard shortcuts
fr: Visionneuse de livres numériques : Amélioration du comportement de défilement lors de l'extension de la sélection à l'aide de raccourcis clavier
pt_br: Visualizador de e-books: Melhora o comportamento de rolagem ao extender a seleção usando atalhos de teclado

source: E-book viewer: Fix read percent for HTML files that are rendered in a single screen being 0% rather than 100%
fr: Visionneuse de livres numériques : Correction du pourcentage de lecture pour les fichiers HTML qui sont rendus dans un seul écran, qui est de 0% au lieu de 100%.
pt_br: Visualizador de e-books: Corrige percentual de leitura para arquivos HTML que são renderizados em uma única tela como sendo 0% em vez de 100%

source: E-book viewer: Highlights panel: Do not expand all sections when adding/deleting/modifying highlights
fr: Visionneuse de livres numériques : Panneau des mises en évidence : Ne pas développer toutes les sections lors de l'ajout/suppression/modification de mises en évidence
pt_br: Visualizador de e-books: Painel de destaques: Não expandir todas as seções ao adicionar/apagar/modificar destaques

source: CHM Input: Fix a regression in calibre 5.0 that broke opening of some files that don't specify a character encoding
fr: Format CHM en entrée : Correction d'une régression dans calibre 5.0 qui empêchait l'ouverture de certains fichiers qui ne spécifient pas de codage de caractères

source: EPUB2 metadata: Read ISBNs in identifier elements without schemes if they are valid ISBNs and no properly identified isbns are present
fr: Métadonnées EPUB2 : Lire les ISBN dans les éléments d'identification sans schéma si ce sont des ISBN valides et si aucun ISBN correctement identifié n'est présent
pt_br: Metadados EPUB2: Ler ISBNs em elementos de identificação sem esquemas, se eles forem ISBNs válidos e nenhum ISBN devidamente identificado estiver presente

source: Update Amazon metadata plugin for changes to amazon websites
fr: Mise à jour du plugin de métadonnées Amazon en raison des modifications apportées aux sites Web d'Amazon
pt_br: Atualiza o plugin de metadados da Amazon por conta de mudanças nos sites da amazon

source: Edit book: Fix detection of class names containing hyphens/underscores
fr: Éditer le livre : Correction de la détection des noms de classe contenant des traits d'union ou des tirets
pt_br: Editar livro: Corrige detecção de nomes de classes contendo hífens/underlines

source: 26 Mar, 2021
fr: 26 mars 2021
pt_br: 26 de Março de 2021

source: Edit book: When right clicking on a class in a HTML file, add an option to rename the class throughout the book
fr: Éditer le livre : Lors d'un clic droit sur une classe dans un fichier HTML, ajouter une option pour renommer la classe dans tout le livre
pt_br: Editar livro: Ao clicar com o botão direito em uma classe, em um arquivo HTML, adiciona uma opção para renomear a classe ao longo de todo o livro

source: Adding from ISBN: Add an option to check if there are existing books with the specified ISBNs already in the library
fr: Ajout à partir de l'ISBN : Ajout d'une option pour vérifier s'il existe déjà des livres avec les ISBN spécifiés dans la bibliothèque
pt_br: Adicionar de ISBN: Adiciona uma opção para verificar se existem livros com o ISBN especificado já na biblioteca

source: Template tester: Instead of next/last, the template tester now shows the template values for selected books
fr: Testeur de modèles : Au lieu de suivant/dernier, le testeur de modèles affiche désormais les valeurs des modèles pour les livres sélectionnés
pt_br: Testador de modelos: Em vez de próximo/último, o testador de modelos agora mostra os valores dos modelos para os livros selecionados

source: Content server: Allow swiping left and right to show next/previous book on the book details page
fr: Serveur de contenu : Autoriser le glissement vers la gauche et la droite pour afficher le livre suivant/précédent sur la page de détails du livre
pt_br: Servidor de conteúdo: Permite deslizar para a esquerda e direita para mostrar o próximo/anterior na página de detalhes do livro

source: E-book viewer: Make the commonly used Shift+Arrow key shortcuts for modifying selections using the keyboard work. Also add shortcuts for selecting by character, line and paragraph.
fr: Visionneuse de livres numériques : Faire fonctionner les raccourcis clavier Shift+Flèche couramment utilisés pour modifier les sélections à l'aide du clavier. Ajout également des raccourcis pour la sélection par caractère, ligne et paragraphe.
pt_br: Visualizador de e-books: Faz funcionar os atalhos comumente utilizados Shift+Seta para modificar seleções usando o teclado. Também adiciona atalhos para selecionar por caractere, linha e parágrafo.

source: MOBI Output: Fix latest Kindle firmware not displaying select publisher font option for calibre produced AZW3 files
fr: Format MOBI en sortie : Correction du dernier firmware Kindle qui n'affiche pas l'option de sélection de la police de l'éditeur pour les fichiers AZW3 produits par calibre
pt_br: Saída MOBI: Corrige último firmware Kindle não exibindo a opção de fonte da editora para arquivos AZW3 produzidos pelo calibre

source: E-book viewer: Fix errors when viewing books with mathematics that are split over multiple internal files
fr: Visionneuse de livres numériques : Correction d'erreurs lors de la visualisation de livres dont les mathématiques sont réparties sur plusieurs fichiers internes
pt_br: Visualizador de e-books: Corrige erros ao visualizar livros com fórmulas que são divididas entre múltiplos arquivos internos.

source: Content server viewer: Fix highlights not sorted correctly in the highlights panel
fr: Visionneuse de Serveur de contenu : Correction des mises en évidence non triées correctement dans le panneau des mises en évidence
pt_br: Visualizador do Servidor de conteúdo: Corrige destaques não classificados corretamente no painel de destaques

source: Get books: Fix Smashwords plugin not working because of website changes
fr: Obtenir des livres : Correction du plugin Smashwords qui ne fonctionnait pas en raison de modifications du site web
pt_br: Obter livros: Corrige plugin Smashwords não funcionando por conta de alterações no site

source: Improve the performance of QuickView especially when using composite columns
fr: Amélioration des performances de Affichage Rapide, notamment lors de l'utilisation de colonnes composites
pt_br: Melhora a performance da Visualização Rápida, especialmente quando utilizando colunas compostas

source: Improve performance of the virtual_libraries() template function
fr: Amélioration des performances de la fonction modèle virtual_libraries()
pt_br: Melhora a performance da função de modelo virtual_libraries()

source: Browser viewer: Fix Go to Location not working for positions
fr: Visionneuse du navigateur : Correction de la fonction Aller à l'emplacement qui ne fonctionne pas pour les positions
pt_br: Visualizador do navegador: Corrige Ir Para Local não funcionando para posições

source: E-book viewer: Fix searching in the Table of Contents not working
fr: Visionneuse de livres numériques : Correction de la recherche dans la Table des Matières qui ne fonctionnait pas
pt_br: Visualizador de e-books: Corrige pesquisa no Índice não funcionando

source: E-book viewer: In paged mode, fix scrolling not working correctly when margins are set to zero
fr: Visionneuse de livres numériques : En mode page, le défilement ne fonctionnait pas correctement lorsque les marges sont définies sur zéro
pt_br: Visualizador de e-books: No modo paginado, corrige rolagem não funcionando corretamente quando as margens estão definidas como zero

source: E-book viewer: Fix incorrect ToC navigation in books that link the entries to inline tags that wrap block tags that span multiple pages
fr: Visionneuse de livres numériques : Correction de la navigation incorrecte de la TdM dans les livres qui lient les entrées aux balises en ligne qui enveloppent les balises de bloc qui couvrent plusieurs pages
pt_br: Visualizador de e-books: Corrige navegação do Índice incorreta em livros que usam links para tags em linha que envolvem tags de bloco, e se espalham por múltiplas páginas.

source: Category editor: Searching in library shouldn't automatically open Quickview
fr: Éditeur de catégories : La recherche dans la bibliothèque ne devrait pas ouvrir automatiquement Affichage Rapide
pt_br: Editor de categorias: Buscar na biblioteca não deveria automaticamente abrir a Visualização Rápida

source: Conversion: Fix a hang caused by long sequences of non-word characters when heuristics are enabled, either explicitly or for some input formats such as TXT
fr: Conversion : Correction d'un blocage causé par de longues séquences de caractères non-mots lorsque l'heuristique est activée, soit explicitement, soit pour certains formats d'entrée comme le TXT
pt_br: Conversão: Corrige travamento causado por longas sequências de caracteres atípicos (não usados em palavras) quando a heurística está ativada, tanto explicitamente como para alguns formatos de entrada, como TXT

source: Fix a regression in calibre 5 that broke --explode-book and --implode-book actions for calibre-debug.exe
fr: Correction d'une régression dans calibre 5 qui interrompait les actions --explode-book et --implode-book pour calibre-debug.exe.
pt_br: Corrige uma regressão no calibre 5 que danificou as ações --explode-book e --implode-book para o calibre-debug.exe

source: Fix a regression in calibre 5 that broke setting metadata in RTF files
fr: Correction d'une régression dans calibre 5 qui empêchait la définition des métadonnées dans les fichiers RTF
pt_br: Corrige uma regressão no calibre 5 que danificou a definição de metadados em arquivos RTF

source: 10 Mar, 2021
fr: 10 mars 2021
pt_br: 10 de Março de 2021

source: E-book Viewer: Allow editing the current book by pressing Ctrl+D or adding a button for it to the viewer tool bar
fr: Visionneuse de livres numériques : Permet de modifier le livre en cours en appuyant sur Ctrl+D ou en ajoutant un bouton à la barre d'outils de la visionneuse
pt_br: Visualizador de e-books: Permite edição do livro atual ao pressionar Ctrl+D ou adicionar um botão para isso na barra de ferramentas do visualizador

source: Edit book: Add a command line flag to allow selecting the specified text when opening a book
fr: Éditer le livre : Ajout d'un indicateur de ligne de commande pour permettre de sélectionner le texte spécifié lors de l'ouverture d'un livre
pt_br: Editar livro: Adiciona um sinalizador de linha de comando para permitir a seleção do texto especificado ao abrir um livro

source: Edit metadata dialog: When trimming covers, show the size of the current trim region
fr: Dialogue d'édition des métadonnées : Lors du découpage des couvertures, affichage de la taille de la zone de découpage actuelle
pt_br: Diálogo de edição de metadados: Ao aparar capas, mostra o tamanho da região de corte atual

source: Fix a regression in the previous release that broke sending of emails with text longer than 900 characters
fr: Correction d'une régression dans la version précédente qui empêchait l'envoi d'e-mails dont le texte dépassait 900 caractères
pt_br: Corrige uma regressão na versão anterior que danificou o envio de emails com texto mais longo do que 900 caracteres

source: E-book viewer: Fix using keyboard to extend selection not turning pages
fr: Visionneuse de livres numériques : Correction de l'utilisation du clavier pour étendre la sélection sans tourner les pages
pt_br: Visualizador de e-books: Corrige uso do teclado para extender seleção não virando páginas

source: Fix searching for items from the Manage dialog not working correctly
fr: Correction de la recherche d'éléments à partir de la boîte de dialogue Gérer ne fonctionnant pas correctement
pt_br: Corrige busca de itens a partir do diálogo Gerenciar não funcionando corretamente
