Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Fix a regression preventing using a non-integer value for the tweak to change book details font size
fr: Correction d'une régression empêchant l'utilisation d'une valeur non entière pour le paramètre de modification de la taille de la police des détails du livre
pt_br: Corrige uma regressão impedindo a utilização de valores não-inteiros para o Ajuste de alteração do tamanho da fonte nos Detalhes do livro

source: Fix moving library not moving the full text search index
fr: Correction du déplacement de la bibliothèque qui ne déplace pas l'index de recherche en texte intégral
pt_br: Corrige movimentação da biblioteca não movendo o índice da pesquisa no texto completo

source: Fix some custom icons in the calibre config directory not overriding the theme/builtin icons
fr: Correction de certaines icônes personnalisées dans le répertoire de configuration de calibre qui ne remplacent pas les icônes du thème/intégrées
pt_br: Corrige alguns ícones personalizados no diretório de configuração do calibre não se sobrepondo ao ícones padrão ou de temas

source: Linux installer: Fix glibc version check also being done when installing older versions
fr: Installateur Linux : Correction de la vérification de la version de la glibc également effectuée lors de l'installation d'anciennes versions
pt_br: Instalador Linux: Corrige a verificação da versão da glibc também sendo feita ao instalar versões mais antigas

source: Windows installer: Refuse to install on Windows 8 as thanks to Qt 6 calibre 6 does not work on Windows 8
fr: Installateur Windows : Refuser d'installer sur Windows 8 car grâce à Qt 6 calibre 6 ne fonctionne pas sur Windows 8
pt_br: Instalador Windows: Recusa a instalação no Windows 8, uma vez que devido ao Qt 6 o calibre não funciona neste sistema

source: Update the BigBookSearch metadata plugin for website changes
fr: Mise à jour du plugin de métadonnées BigBookSearch en raison de changements sur le site web
pt_br: Atualiza o plugin de metadados BigBookSearch por conta de alterações no site

source: 11 Jul, 2022
fr: 11 juillet 2022
pt_br: 11 de Julho de 2022

source: For details on the major changes in calibre between 6.0 and 5.0, see <a href="%(h0)s">%(h0)s</a>
fr: Pour des détails sur les changements majeurs dans calibre entre la version 6.0 et la version 5.0 voir <a href="%(h0)s">%(h0)s</a>
pt_br: Para detalhes sobre as principais mudanças no calibre entre as versões 6.0 e 5.0, veja <a href="%(h0)s">%(h0)s</a>

source: Full text search: You can now search the entire text of all books in your calibre library
fr: Recherche de texte en intégral : Vous pouvez désormais rechercher le texte intégral de tous les livres de votre bibliothèque calibre
pt_br: Pesquisa no texto completo: Você agora pode pesquisar o texto completo de todos os livros na sua biblioteca do calibre

source: Support for new CPU architectures: Apple Silicon and ARM64 on Linux. Support for 32bit CPUs has been dropped because Qt 6 does not support them
fr: Prise en charge des nouvelles architectures de CPU : Apple Silicon et ARM64 sur Linux. Le support des CPUs 32bit a été abandonné car Qt 6 ne les supporte pas
pt_br: Suporte para novas arquiteturas de CPU: Apple Silicon e ARM64 no Linux. O suporte para CPUs 32bit foi removido, uma vez que o Qt 6 não os suporta

source: Dark mode in calibre is now controlled via a setting in Preferences-&gt;Look &amp; feel rather than an environment variable
fr: Le mode nuit dans calibre est maintenant contrôlé par un paramètre dans Préférences-&gt;Apparence &amp; présentation plutôt que par une variable d'environnement.
pt_br: O modo escuro no calibre agora é controlado via uma configuração em Preferências-&gt;Aparência, em vez de uma variável de ambiente

source: Allow choosing different icon themes for light and dark mode in Preferences-&gt;Look &amp; feel
fr: Possibilité de choisir des thèmes d'icônes différents pour les modes clair et sombre dans Préférences-&gt;Apparence &amp; présentation
pt_br: Permite escolher temas de ícones diferentes para o modo claro e escuro em Preferências-&gt;Aparência

source: Upgrade calibre to use Qt 6. This means that some no longer maintained third party plugins may not work, though most plugins have already been ported
fr: Mettre à jour calibre pour utiliser Qt 6. Cela signifie que certains plugins tiers qui ne sont plus maintenus peuvent ne pas fonctionner, bien que la plupart des plugins aient déjà été adaptés
pt_br: Atualiza o calibre para usar o Qt 6. Isto significa que alguns plugins de terceiros abandonados podem não funcionar, apesar de que a maioria dos plugins já tenha sido atualizada

source: 17 Jun, 2022
fr: 17 juin 2022
pt_br: 17 de Junho de 2022

source: Amazon metadata download: Add an option to prefer the Kindle edition when multiple book types are returned by the search (Preferences-&gt;Metadata download-&gt;Configure the Amazon plugin)
fr: Téléchargement des métadonnées Amazon : Ajout d'une option pour préférer l'édition Kindle lorsque plusieurs types de livres sont retournés par la recherche (Préférences-&gt;Téléchargement des métadonnées-&gt;Configurer le plugin Amazon)
pt_br: Download de metadados da Amazon: Adiciona uma opção para preferir a edição Kindle quando múltiplos tipos de livros são retornados pela pesquisa (Preferências-&gt;Download de metadados-&gt;Configurar o plugin da Amazon)

source: Kobo driver: Support for updated firmware
fr: Pilote Kobo : Prise en charge du firmware mis à jour
pt_br: Driver do Kobo: Suporte para o firmware atualizado

source: Allow customizing how yes/no columns are displayed (Preferences-&gt;Add your own columns)
fr: Permettre de personnaliser l'affichage des colonnes oui/non (Préférences-&gt;Ajouter vos propres colonnes)
pt_br: Permite personalizar como as colunas sim/não são exibidas (Preferências-&gt;Adicionar suas próprias colunas)

source: Manage tags dialog: If tags are present in the add tags input when OK is clicked, add them automatically, without needing to click the plus button first
fr: Boite de dialogue de gestion des étiquettes : Si des étiquettes sont présentes dans le champ d'ajout d'étiquettes lorsque l'on clique sur OK, elles sont ajoutées automatiquement, sans qu'il soit nécessaire de cliquer d'abord sur le bouton plus
pt_br: Diálogo Gerenciar etiquetas: Se etiquetas estiverem presentes no campo de adicionar etiquetas quando OK for pressionado, elas são adicionadas automaticamente, sem a necessidade de pressionar o botão de adicionar

source: Edit book: Live CSS: Fix @namespace rules causing jumping to rule definition to go to the wrong definition
fr: Éditer le livre : CSS en direct : Correction des règles @namespace entraînant un saut à la définition de la règle vers la mauvaise définition
pt_br: Editar livro: Live CSS: Corrige regras com @namespace fazendo com que o salto para a definição fosse para o lugar errado

source: Workaround for Apple bug in macOS 13 that prevents device detection
fr: Contournement d'un bogue d'Apple dans macOS 13 qui empêche la détection des appareils
pt_br: Solução alternativa para o um erro da Apple no macOS 13, que impedia a detecção de dispositivos

source: Don't use commas in filenames when sending to pbsync and kindle email addresses
fr: Pas de virgules utilisées dans les noms de fichiers lorsque vous les envoyez à des adresses électroniques pbsync et kindle
pt_br: Não usa vírgulas em nomes de arquivos ao enviar para endereços de e-mail pbsync e kindle

source: Edit book: When quitting while a save is in progress and the save completes while the confirmation popup is visible, don't abort the quit.
fr: Éditer le livre : Lorsque vous quittez l'application alors qu'une sauvegarde est en cours et que la sauvegarde se termine alors que la fenêtre de confirmation est visible, n'abandonne pas la sortie.
pt_br: Editar livro: Ao fechar enquanto um salvamento está em andamento, e este é completado antes que o popup de confirmação esteja visível, não aborta o fechamento.

source: 27 May, 2022
fr: 27 mai 2022
pt_br: 27 de Maio de 2022

source: Kobo driver: Allow using templates to generate collections
fr: Pilote Kobo : Permettre l'utilisation de modèles pour générer des collections
pt_br: Driver do Kobo: Permite usar modelos para gerar coleções

source: Book details popup: Double clicking on the cover now uses calibre's internal image viewer. Right click on the cover to open it with another program.
fr: Popup des détails du livre : Un double clic sur la couverture utilise désormais la visionneuse d'images interne de Calibre. Faites un clic droit sur la couverture pour l'ouvrir avec un autre programme.
pt_br: Janela de Detalhes do livro: Clique duplo na capa agora usa o visualizador de imagens interno do calibre. Clique com o botão direito na capa para abrir com outro programa.

source: Fix Book details blank when switching from device view to library view
fr: Correction du fait que détails du livre est vide lors du passage de l'affichage de l'appareil à l'affichage de la bibliothèque
pt_br: Corrige Detalhes do livro em branco ao mudar da visualização de dispositivo para a visualização da biblioteca

source: TXT Input: Fix a regression in 5.39 that caused the option to remove indents also removing blank lines
fr: Format TXT en entrée : Correction d'une régression dans la version 5.39 qui faisait que l'option de suppression des retraits supprimait également les lignes vides
pt_br: Entrada TXT: Corrige uma regressão na versão 5.39 que fez com que a opção de remover indentação também removesse linha em branco

source: E-book viewer: Fix incorrect sorting of highlights from the first internal file of a book
fr: Visionneuse de livres numériques : Correction du tri incorrect des mises en évidence du premier fichier interne d'un livre
pt_br: Visualizador de e-books: Corrige ordenação incorreta de destaques a partir do arquivo interno do livro

source: 03 May, 2022
fr: 03 mai 2022

source: E-book viewer: Ignore accents when doing a search
fr: Visionneuse de livres numériques : Ignorer les accents lors d'une recherche
pt_br: Visualizador de E-book: ignore acentos ao fazer uma pesquisa.

source: Book list searching: Ignore punctuation when searching. So that, for example, Gravitys will match Gravity's
fr: Recherche dans les listes de livres : ignorez la ponctuation lors de la recherche. Ainsi, par exemple, Gravitys correspondra à Gravity's.

source: Show the text used for marking books in the tooltip
fr: Afficher le texte utilisé pour le marquage des livres dans l'infobulle

source: Edit book: Reduce memory consumption by the checkpoint system when doing operations that involve parsing all book files
fr: Editer le livre : Réduire la consommation de mémoire par le système de points de contrôle lors d'opérations impliquant l'analyse de tous les fichiers du livre

source: Amazon metadata download: Fix titles starting with [ being ignored
fr: Téléchargement des métadonnées Amazon : Correction des titres commençant par [ qui sont ignorés

source: Edit metadata dialog: Undo not working correctly in identifiers field
fr: Dialogue d'édition de métadonnées : L'annulation ne fonctionne pas correctement dans le champ des identifiants

source: Fix viewing LRF files not working
fr: Correction de l'affichage des fichiers LRF qui ne fonctionnait pas

source: PDF Output: Fix an error on some invalid CSS in the input document
fr: Format PDF en sortie : Correction d'une erreur sur certains CSS invalides dans le document d'entrée

source: Linux binary: Workaround for Qt WebEngine not working on systems with glibc &gt; 2.33
fr: Binaire Linux : Solution de contournement pour Qt WebEngine ne fonctionnant pas sur les systèmes avec glibc &gt; 2.33

source: 22 Apr, 2022
fr: 22 avril 2022

source: Allow creating multiple types of temporary marks (pins) by right clicking the mark books button (which can be added to the calibre toolbar via Preferences-&gt;Toolbars &amp; menus)
fr: Permettre la création de plusieurs types de marques temporaires (épingles) par un clic droit sur le bouton marquer des livres (qui peut être ajouté à la barre d'outils de calibre via Préférences-&gt;Barres d'outils &amp; menus)

source: Show a popup message when a Kindle is connected mentioning the Amazon cover bug and how to workaround it
fr: Afficher un message contextuel lorsqu'une Kindle est connectée, mentionnant le bogue de couverture d'Amazon et la manière de le contourner

source: Edit book: Table of Contents tool: Allow using the title attribute on headings tags to get the text for table of contents entries
fr: Editer le livre : Outil de Table des Matières : Permettre l'utilisation de l'attribut title des balises d'en-tête pour obtenir le texte des entrées de la table des matières

source: When creating a custom column to display real (floating point) numbers allow specifying the number of decimal digits when editing values
fr: Lors de la création d'une colonne personnalisée pour afficher des nombres réels (à virgule flottante), il est possible de spécifier le nombre de chiffres décimaux lors de l'édition des valeurs.

source: Amazon metadata download: Add support for amazon.in country website
fr: Téléchargement de métadonnées Amazon : Ajout de la prise en charge du téléchargement depuis Amazon.in

source: Edit book: Fix AltGr+{ not working on some keyboard layouts
fr: Modifier le livre : Correction de AltGr+{ ne fonctionnant pas sur certaines dispositions de clavier

source: TXT Input: Fix rare failure to convert some large TXT files with non-ASCII text
fr: Format TXT en entrée : Correction de l'échec rare de la conversion de certains fichiers TXT volumineux contenant du texte non ASCII

source: Get books: Update English language Amazon plugins for website changes
fr: Obtenir des livres : Mise à jour des plugins Amazon en anglais en raison de modifications du site web

source: 01 Apr, 2022
fr: 01 avril 2022

source: Content server viewer: Allow editing bookmarks
fr: Visionneuse du serveur de contenu : Permettre l'édition des signets

source: Read covers from CBC comic files
fr: Lire les couvertures des fichiers bandes dessinées CBC

source: Allow filtering authors/tags when creating virtual library based on them
fr: Permettre de filtrer les auteurs/étiquettes lors de la création d'une bibliothèque virtuelle basée sur ceux-ci

source: Add a copy button to the image view popup
fr: Ajout d'un bouton de copie à la fenêtre popup de visualisation des images

source: Template language: Support for nested functions and a string concatenation operator
fr: Langage de modèle : Prise en charge des fonctions imbriquées et d'un opérateur de concaténation de chaînes de caractères

source: DOCX Output: Fix a comment immediately after a &lt;li&gt; tag breaking the conversion
fr: Format DOCX en sortie : Correction d'un commentaire immédiatement après une balise &lt;li&gt ; empêchant la conversion

source: Standalone ToC editor: Fix spurious error message if left open for more than two minutes
fr: Éditeur de TdM autonome : Correction d'un faux message d'erreur si la fenêtre reste ouverte pendant plus de deux minutes

source: Fix search-as-you-type triggers extra search after manual confirmation
fr: Correction de la recherche rapide qui déclenchait une recherche supplémentaire après confirmation manuelle

source: 18 Mar, 2022
fr: 18 mars 2022

source: E-book viewer: Allow scrolling of the ToC, highlights, bookmarks, etc. with touch gestures
fr: Visionneuse de livres numériques : Permettre le défilement de la table des matières, des mises en évidence, des signets, etc. avec des gestes tactiles

source: Edit metadata dialog: When using the change case operations if some text is selected, only operate on the selected text
fr: Dialogue d'édition des métadonnées : Lors de l'utilisation des opérations de changement de cas, si du texte est sélectionné, seules les opérations sur le texte sélectionné sont effectuées

source: Use atomic writes for the config files ensures no partial data is written in case of crash/powerloss
fr: L'utilisation d'écritures atomiques pour les fichiers de configuration garantit qu'aucune donnée partielle n'est écrite en cas de crash/perte de puissance.

source: 5.39.1 fixes a couple of regressions that broke case change in the Bulk metadata edit dialog and remembering column widths in the book list on some systems.
fr: La version 5.39.1 corrige quelques régressions qui empêchaient le changement de case dans la boîte de dialogue d'édition des métadonnées par lot et la mémorisation de la largeur des colonnes dans la liste des livres sur certains systèmes.

source: Content server: Fix reading of books with thousands of internal files not working in the Chrome browser
fr: Serveur de contenu : Correction du fait que la lecture de livres contenant des milliers de fichiers internes ne fonctionnait pas dans le navigateur Chrome

source: Catalog generation: Fix a rare crash when generating very large catalogs
fr: Génération de catalogues : Correction d'un crash rare lors de la génération de très gros catalogues

source: Edit/Polish book: Fix hardcoded Unicode ligatures not being preserved in AZW3 format books
fr: Éditer/Embellir le livre : Correction des ligatures Unicode codées en dur qui ne sont pas préservées dans les livres au format AZW3

source: Fix automatic searches causing search box to lose focus when search as you type is enabled in Preferences-&gt;Searching
fr: Correction des recherches automatiques qui font perdre le focus à la boîte de recherche lorsque la recherche en cours de saisie est activée dans Préférences-&gt;Recherche

source: Edit book: Check book: Auto fix package identifier being empty
fr: Editer le livre : Vérifier le livre : Correction automatique d'un identifiant de paquet vide

source: Amazon metadata download: Fix getting series info from amazon.jp
fr: Téléchargement des métadonnées Amazon : Correction de l'obtention d'informations sur les séries depuis amazon.jp

source: Edit book: Insert hyperlinks: When sorting anchors on elements without any text content, use the anchor itself
fr: Modifier le livre : Insérer des hyperliens : Lors du tri des ancres sur des éléments sans contenu textuel, utiliser l'ancre elle-même

source: Edit book: Make the saved search panel freely resizable
fr: Modifier le livre : Rendre le panneau de recherche sauvegardée librement redimensionnable

source: Edit book: When dragging to select a region or adjust the selection fix mouse moving outside the image causing the region to no longer be adjusted
fr: Modifier le livre : Lorsque l'on fait glisser pour sélectionner une région ou ajuster la sélection, la souris se déplace en dehors de l'image et la région n'est plus ajustée.

source: 04 Mar, 2022
fr: 04 mars 2022

source: E-book viewer: When displaying estimated time to completion for reading a book, remember the reading rate the next time the book is opened
fr: Visionneuse de livres numériques : Lors de l'affichage de la durée estimée de la lecture d'un livre, le taux de lecture est mémorisé lors de la prochaine ouverture du livre.

source: Dark theme: Highlight the current cell in the book list with a lighter background and different foreground to make it more obvious
fr: Thème sombre : mettez en évidence la cellule actuelle de la liste de livres avec un arrière-plan plus clair et un premier plan différent pour la rendre plus évidente

source: An option to disable editing composite columns in the main book list when Tabbing through them (Preferences-&gt;Look &amp; feel-&gt;Edit metadata)
fr: Une option pour désactiver l'édition des colonnes composites dans la liste principale des livres lorsque l'on passe d'une colonne à l'autre (Préférences-&gt;Apparence & présentation-&gt;Édition des métadonnées)

source: Tag editor: Fix regression in previous release that caused double clicking on tags to not work on non Linux platforms
fr: Éditeur de balises : Correction d'une régression dans la version précédente qui faisait que le double-clic sur les balises ne fonctionnait pas sur les plateformes autres que Linux

source: Copy to library: Fix annotations not being copied
fr: Copie vers une bibliothèque : Correction des annotations qui n'étaient pas copiées

source: Edit book: Spell check: Fix words after a comment not being checked
fr: Editer le livre : Vérification de l'orthographe : Correction du fait que des mots après un commentaire ne soient pas vérifiés

source: PDF Output: Fix conversion failing if there are ToC entries pointing to removed content
fr: Format PDF en sortie : Correction de l'échec de la conversion si des entrées de la TdM pointent vers du contenu supprimé

source: E-book viewer: Fix an error when opening books with MathML for the second time if the last read position was at a MathML element
fr: Visionneuse de livres numériques : Correction d'une erreur lors de l'ouverture de livres avec MathML pour la deuxième fois si la dernière position de lecture était un élément MathML

source: Edit book: Fix double clicking to select a word also selecting smart quotes surrounding the word
fr: Éditer le livre : Correction du double clic pour sélectionner un mot qui sélectionne également les guillemets intelligents entourant le mot

source: EPUB 3 metadata: Fix non-integer series index being sometimes represented using exponential notation
fr: Métadonnées EPUB 3 : Correction de l'indice des séries non entières étant parfois représenté en utilisant la notation exponentielle

source: 18 Feb, 2022
fr: 18 février 2022

source: Book details: Add actions to trim the cover to the right-click menu
fr: Détails du livre : Ajout d'actions au menu du clic droit pour recadrer la couverture

source: Allow removing multiple email addresses at once in Preferences-&gt;Sharing by email
fr: Permettre la suppression de plusieurs adresses e-mail à la fois dans Préférences-&gt;Partage par courriel

source: Book details: Use a better mono-spaced font on Windows by default
fr: Détails du livre : Utiliser une meilleure police à simple interligne sous Windows par défaut

source: Add a tweak in Preferences-&gt;Tweaks to change the behavior of the Tab key when completing entries
fr: Ajout d'un ajustement dans Préférences-&gt;Ajustements pour changer le comportement de la touche de tabulation lors de la complétion des entrées

source: Edit metadata: In "All in one" mode add an adjustable splitter between the cover and formats boxes
fr: Modifier les métadonnées : En mode "Tout en un", ajout d'un séparateur réglable entre les boîtes de dialogue de couverture et de formats.

source: Textile output: Don't fail if input document has invalid padding or margin specifications
fr: Format Textile en sortie : Pas d'échec si le document d'entrée a des spécifications de remplissage ou de marge non valides.

source: E-book viewer: Fix image display window not remembering its size and settings when run from within calibre
fr: Visionneuse de livres numériques : Correction de la fenêtre d'affichage des images qui ne se souvient pas de sa taille et de ses paramètres lorsqu'elle est exécutée à partir de calibre

source: E-book viewer: Fix setting to use roman numerals for series not being respected
fr: Visionneuse de livres numériques :Correction du paramètre d'utilisation des chiffres romains pour les séries qui n'est pas respecté

source: Edit book: When saving a copy do not fail if the original file has no write permissions
fr: Modifier le livre : Lors de l'enregistrement d'une copie, pas d'échec si le fichier original n'a pas de droits d'écriture

source: Embed fonts tool: Create &lt;head&gt; when missing
fr: Outil d'incorporation des polices : Créez &lt;une tête&lt; en cas d'absence de polices

source: Tag editor: Improve performance when very large number of tags present
fr: Éditeur d'étiquettes : amélioration des performances en cas de présence d'un très grand nombre d'étiquettes

source: 04 Feb, 2022
fr: 04 février 2022
