Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Get books: update various Polish e-book stores for website changes
fr: Obtenir des livres : mise à jour de diverses librairies en polonais pour tenir compte des modifications apportées au site web
pt_br: Obter livros: atualiza várias lojas Polonesas, por conta de mudanças no sites

source: E-book viewer: Fix CFI parsing of numbers with trailing zeros causing some bookmarks to not work
fr: Visionneuse de livres numérique : Correction de l'analyse par CFI des nombres avec des zéros de fin, ce qui fait que certains signets ne fonctionnent pas
pt_br: Visualizador de e-books: Corrige o processamento CFI de números com zeros à direita fazendo com que alguns marcadores não funcionassem

source: E-book viewer: Show an error when creating a bookmark if the bookmark position is not found
fr: Visionneuse de livres numérique : Afficher une erreur lors de la création d'un signet si la position du signet n'est pas trouvée
pt_br: Visualizador de e-books: Exibe um erro ao criar um marcador se a posição do marcador não for encontrada

source: CBR Input: Fix comics with extremely long internal filenames not working on Windows
fr: Entrée CBR : Correction des bandes dessinées dont les noms de fichiers internes sont extrêmement longs et qui ne fonctionnent pas sous Windows
pt_br: Entrada CDB: Corrige HQs com nomes de arquivos internos extremamente longos não funcionando no Windows

source: Edit book: Saved searches: Fix incorrect import in generated source code for some builtin functions
fr: Modifier le livre : Recherches sauvegardées : Correction d'une importation incorrecte dans le code source généré pour certaines fonctions intégrées
pt_br: Editar livros: Buscas salvas: Corrige importação incorreta em código fonte gerado para algumas funções internas

source: Data file manager: Fix errors on systems with larger font sizes
fr: Gestionnaire de fichiers de données : Correction des erreurs sur les systèmes avec des polices de grande taille
pt_br: Gerenciador de arquivos extras: Corrige erros em sistemas com tamanhos de fonte maiores

source: 04 Aug, 2023
fr: 04 août 2023
pt_br: 04 de Agosto de 2023

source: Easily manage the extra data files associated with a book by right clicking the edit metadata button and choose "Manage data files"
fr: Gérez facilement les fichiers de données supplémentaires associés à un livre en cliquant avec le bouton droit de la souris sur le bouton d'édition des métadonnées et en choisissant « Gérer les fichiers de données »
pt_br: Gerencia facilmente os arquivos extras associados com um livro ao clicar com o botão direito no botão Editar metadados e escolher "Gerenciar arquivos extras"

source: Content server: Full text search: Allow searching a restricted subset of books
fr: Serveur de contenu : Recherche en texte intégral : Permet d'effectuer des recherches dans un sous-ensemble restreint de livres
pt_br: Servidor de conteúdo: Pesquisa no texto completo: Permite pesquisar um subconjunto restrito de livros

source: E-book viewer: Allow clicking on calibre:// URLs
fr: Visionneuse de livres numérique : Permettre de cliquer sur les URL calibre://
pt_br: Visualizador de e-books: Permite clicar em URLs calibre://

source: Support fuzzier searching in the Tag browser find allowing unaccented characters to match accented ones
fr: Prise en charge d'une recherche plus vague dans l'explorateur de balises permettant aux caractères non accentués de correspondre aux caractères accentués
pt_br: Oferece melhor suporte a pesquisa aproximada no Navegador de etiquetas, permitindo ignorar acentos

source: DOCX conversion: Preserve underline style and color
fr: Conversion DOCX : Conserver le style et la couleur du soulignement
pt_br: Conversão DOCX: Preserva estilo e cor de sublinhado

source: Fix incorrect sorting of device view after some operations
fr: Correction d'un tri incorrect dans la vue du périphérique après certaines opérations
pt_br: Corrige ordenação incorreta da visualização de dispositivo após algumas operações

source: Fix visit content server in browser not working when the content server is configured to listen on an IPv6 interface
fr: Correction de la visite du serveur de contenu dans le navigateur qui ne fonctionne pas lorsque le serveur de contenu est configuré pour écouter sur une interface IPv6
pt_br: Corrige acesso ao servidor de conteúdo no navegador não funcionando quando o servidor de conteúdo está configurado para interface IPv6

source: Fix one hour offset in some timezones on Windows for dates before 1970
fr: Correction d'un décalage d'une heure dans certains fuseaux horaires sous Windows pour les dates antérieures à 1970
pt_br: Corrige um deslocamento de uma hora em alguns fusos horários no Windows para datas anteriores a 1970

source: Windows: HTML Input: Fix error when trying to add HTML files with links to other files that are invalid pathnames
fr: Windows : Entrée HTML : Correction d'une erreur lors de l'ajout de fichiers HTML contenant des liens vers d'autres fichiers dont les noms de chemin ne sont pas valides
pt_br: Windows: Entrada HTML: Corrige erro ao tentar adicionar arquivos HTML com links para outros arquivos que possuem caminhos inválidos

source: Get books: Update various Polish language book stores for website changes
fr: Obtenir des livres : Mise à jour de diverses librairies en langue polonaise pour tenir compte des modifications apportées au site web
pt_br: Obter livros: Atualiza várias lojas no idioma Polonês, por conta de mudanças nos sites

source: 14 Jul, 2023
fr: 14 juillet 2023
pt_br: 14 de Julho de 2023

source: PDF Output: Add an option to discard the book cover instead of inserting it as the first page of the PDF
fr: Sortie PDF : Ajout d'une option permettant d'ignorer la couverture du livre au lieu de l'insérer comme première page du PDF
pt_br: Saída PDF: Adiciona uma opção para descartar a capa do livro em vez de inseri-la como a primeira página do PDF

source: Content server: Allow opening the Book details page for a matched book from the Full text search results page
fr: Serveur de contenu : Autoriser l'ouverture de la page de détails d'un livre correspondant à partir de la page de résultats de la recherche en texte intégral
pt_br: Servidor de conteúdo: Permite abrir a página de Detalhes do livro para um livro correspondente a partir da página de resultados da Pesquisa no texto completo

source: Windows: Fix empty data folder getting created in the directory calibre is launched from when changing title/author for a book with an existing data folder
fr: Windows : Correction de la création d'un dossier de données vide dans le répertoire à partir duquel calibre est lancé lors du changement de titre/auteur d'un livre avec un dossier de données existant
pt_br: Windows: Corrige pasta de dados sendo criada no diretório de onde o calibre foi lançado, ao alterar o autor/título de um livro que já possui uma pasta de dados

source: LIT Output: Fix error converting anything to LIT on Windows
fr: Sortie LIT : Corriger l'erreur de conversion en LIT sous Windows
pt_br: Saída LIT: Corrige um erro ao converter qualquer formato para LIT no Windows

source: Ignore failures to expire old trash during startup
fr: Ignorer les échecs d'expiration de la corbeille au démarrage
pt_br: Ignora falhas ao expirar itens da lixeira durante a inicialização

source: Amazon metadata download: Fix retrieval of publisher information from amazon.fr
fr: Téléchargement des métadonnées Amazon : Correction de l'obtention d'informations sur les éditeur depuis amazon.fr
pt_br: Download de metadados da Amazon: Corrige a obtenção da informação da editora via amazon.fr

source: 30 Jun, 2023
fr: 30 juin 2023
pt_br: 30 de Junho de 2023

source: Kobo driver: Add support for newest firmware
fr: Pilote Kobo : Ajout de la prise en charge du nouveau firmware
pt_br: Driver do Kobo: Adiciona suporte para o mais novo firmware

source: Trash bin: Allow setting removed books to be permanently deleted on library close
fr: Corbeille : Autoriser la suppression définitive des livres supprimés lors de la fermeture de la bibliothèque
pt_br: Lixeira: Permite configurar os livros removidos para serem permanentemente apagados ao fechar a biblioteca

source: Windows: Nicer error message when file/folder is locked in another program
fr: Windows : Message d'erreur plus agréable lorsque le fichier/dossier est verrouillé dans un autre programme
pt_br: Windows: Mensagem de erro melhorada quando arquivos/pastas estão bloqueados por outro programa

source: PDF Output: Fix regression that caused large slowdowns when converting books with lots of internal HTML files to PDF
fr: Sortie PDF : Correction d'une régression qui provoquait d'importants ralentissements lors de la conversion en PDF de livres contenant de nombreux fichiers HTML internes
pt_br: Saída PDF: Corrige uma regressão que causava grande lentidão ao converter livros com muitos arquivos HTML internos para PDF

source: CHM Input: Fix ToC entries that use fragments not supported
fr: Entrée CHM : Correction des entrées ToC qui utilisent des fragments non supportés
pt_br: Entrada CHM: Corrige entradas do Índice que usam fragmentos não suportados

source: E-book viewer: Fix searching for text next to hidden text not scrolling to the match
fr: Visionneuse de livres numériques : Correction de la recherche de texte à côté d'un texte caché qui ne défile pas jusqu'à la correspondance
pt_br: Visualizador de e-books: Corrige busca por texto próximo a um texto oculto não rolando para a correspondência

source: E-book viewer: Fix selection popup not showing for some books on some platforms when the selection is in the top line
fr: Visionneuse de livres numériques : Correction du popup de sélection qui ne s'affiche pas pour certains livres sur certaines plateformes lorsque la sélection se trouve dans la ligne supérieure
pt_br: Visualizador de e-books: Corrige pop-up de seleção não aparecendo para alguns livros em alguns plataformas, quando a seleção está na linha superior

source: DOCX Output: Fix multiple SVG images in the input document causing all the SVG images in the output to be just one of the input images
fr: Sortie DOCX : Correction d'images SVG multiples dans le document d'entrée, ce qui fait que toutes les images SVG dans la sortie ne sont qu'une seule des images d'entrée
pt_br: Saída DOCX: Corrige múltiplas imagens SVG no documento de entrada fazendo com que todas as imagens SVG no arquivo de saída se tornasse apenas uma das imagens de entrada

source: MOBI Input: Ignore another form of corruption in trailing bytes
fr: Entrée MOBI : Ignorer une autre forme de corruption dans les octets de fin
pt_br: Entrada MOBI: Ignora outra forma de corrupção em bytes finais

source: 13 Jun, 2023
fr: 13 juin 2023
pt_br: 13 de Junho de 2023

source: DOCX Output: Add support for SVG images
fr: Sortie DOCX : Ajout de la prise en charge des images SVG
pt_br: Saída DOCX: Adiciona suporte para imagens SVG

source: Now the generated DOCX will contain both the rasterized version of the SVG image and the original SVG image as the preferred source, which is supported by modern versions of Word.
fr: Désormais, le document DOCX généré contiendra à la fois la version tramée de l'image SVG et l'image SVG originale en tant que source préférée, ce qui est pris en charge par les versions modernes de Word.
pt_br: Agora o DOCX gerado irá conter tanto a versão rasterizada da imagem SVG quanto a imagem SVG original como recurso preferido, o qual é suportado por versões modernas do Word.

source: E-book viewer: Allow configuring the actions triggered by touch gestures
fr: Visionneuse de livres numérique : Permettre de configurer les actions déclenchées par les gestes tactiles
pt_br: Visualizador de e-books: Permite configurar as ações disparadas por gestos de toque

source: DOCX Input: Add support for SVG images
fr: Entrée DOCX : Ajouter la prise en charge des images SVG
pt_br: Entrada DOCX: Adiciona suporte para imagens SVG

source: Windows: Fix a regression in the previous release that could cause files to be deleted if one of the files/folders was open in another program while changing title/author in calibre
fr: Windows : Correction d'une régression dans la version précédente qui pouvait entraîner la suppression de fichiers si l'un des fichiers/dossiers était ouvert dans un autre programme lors d'un changement de titre/auteur dans Calibre
pt_br: Windows: Corrige uma regressão na versão anterior que poderia fazer com que arquivos fossem apagados se um dos arquivos/pastas estivessem abertos em outros programas durante uma mudança de nome/autor no calibre

source: macOS: Fix extra dock icons visible when doing a job using Qt WebEngine such as converting to PDF or searching in Get books
fr: macOS : Correction d'icônes de dock supplémentaires visibles lors d'une tâche utilisant Qt WebEngine comme la conversion en PDF ou la recherche dans Obtenir des livres
pt_br: macOS: Corrige ícones extra visíveis no dock ao realizar uma tarefa usando o Qt WebEngine, como uma conversão para PDF ou pesquisando no Obter livros.

source: macOS and Linux: Fix an error when changing metadata or deleting books whose files are owned by another user
fr: macOS et Linux : Correction d'une erreur lors de la modification des métadonnées ou de la suppression de livres dont les fichiers appartiennent à un autre utilisateur
pt_br: macOS e Linux: Corrige um erro ao alterar metadados ou apagar livros cujos arquivos pertencem a outro usuário

source: CHM Input: Yet another regression opening CHM files with missing internal files on windows
fr: Entrée CHM : Encore une régression dans l'ouverture des fichiers CHM avec des fichiers internes manquants sous Windows
pt_br: Entrada CHM: Outra regressão ao abrir arquivos CHM com arquivos internos faltantes no Windows

source: CHM Input: Resolve absolute links to resource files from the root of the CHM file
fr: Entrée CHM : Résoudre les liens absolus vers les fichiers de ressources à partir de la racine du fichier CHM
pt_br: Entrada CHM: Resolve links absolutos para arquivos de recurso a partir da raiz do arquivo CHM

source: 09 Jun, 2023
fr: 09 juin 2023
pt_br: 09 de Junho de 2023

source: CHM Input: Fix a regression in the previous release that broke conversion of CHM files
fr: Entrée CHM : Correction d'une régression dans la version précédente qui interrompait la conversions des fichiers CHM
pt_br: Entrada CHM: Corrige uma regressão na versão anterior que danificou a conversão de arquivos CHM

source: Windows: Make moving files in the calibre library folder more robust, locking folders in addition to files, before the start of the move
fr: Windows : Rendre le déplacement de fichiers dans le dossier de la bibliothèque calibre plus robuste, en verrouillant les dossiers en plus des fichiers, avant le début du déplacement
pt_br: Windows: Torna a movimentação de arquivos na pasta da biblioteca do calibre mais robusta, bloqueando pastas além dos arquivos, antes de começar a movimentação

source: Get books: Update Barnes and Noble store plugin for website changes
fr: Obtenir des livres : Mise à jour de l'extension de la boutique Barnes and Noble suite à des changements sur le site web
pt_br: Obter livros: Atualiza o plugin da loja Barnes and Noble por contas de mudanças no site

source: Kindle output: Only re-encode JPEG images with EXIF metadata if the metadata contains actual transpose operations
fr: Sortie Kindle : Réencodez les images JPEG avec des métadonnées EXIF que si les métadonnées contiennent des opérations de transposition réelles
pt_br: Saída Kindle: Apenas recodifica imagens JPEG com metadados EXIF se os metadados contiverem operações de transposição reais

source: PDF Output: Fix error when input document contains multiple instances of a font some with vertical metrics and some without
fr: Sortie PDF : Correction d'une erreur lorsque le document d'entrée contient plusieurs instances d'une police, certaines avec des métriques verticales et d'autres sans
pt_br: Saída PDF: Corrige um erro quando documentos de entrada contêm múltiplas instâncias de uma fonte, alguns com métricas verticais e outras sem

source: PDF Output: Fix using CSS Multicolumns for body causing conversion to fail when header/footer is specified
fr: Sortie PDF : Correction de l'utilisation de CSS Multicolumns pour le corps du document qui entraîne l'échec de la conversion lorsque l'en-tête/pied de page est spécifié
pt_br: Saída PDF: Corrige o uso de Multicolumns no CSS para o elemento body fazendo com que a conversão falhe, quando cabeçalhos/rodapés são especificados

source: MOBI Input: Fix a crash when converting some corrupted palmdoc compressed MOBI files
fr: Entrée MOBI : Correction d'un crash lors de la conversion de certains fichiers MOBI compressés palmdoc corrompus
pt_br: Entrada MOBI: Corrige um falha ao converter alguns arquivos MOBI compactados palmdoc corrompidos

source: E-book viewer: Ensure CSS stylesheets are interpreted as UTF-8
fr: Visionneuse de livres numériques : S'assurer que les feuilles de style CSS sont interprétées en UTF-8
pt_br: Visualizador e e-books: Certifica-se de que folhas de estilo sejam interpretadas como UTF-8

source: 29 May, 2023
fr: 29 mai 2023
pt_br: 29 de Maio de 2023

source: HTML Input: Restrict adding of resources like images to only files within the folder hierarchy starting at the parent folder of the root HTML file Can be controlled by customizing the HTML to Zip plugin in Preferences-&gt;Plugins or the --allow-local-files-outside-root option to the ebook-convert command
fr: Entrée HTML : Restreint l'ajout de ressources telles que les images aux seuls fichiers situés dans la hiérarchie des dossiers à partir du dossier parent du fichier HTML racine Peut être contrôlé en personnalisant le plugin HTML to Zip dans Préférences-&gt;Plugins ou l'option --allow-local-files-outside-root de la commande ebook-convert
pt_br: Entrada HTML: Restring a adição de recursos como imagens apenas a arquivos dentro da hierarquia de pastas iniciando na pasta pai da raiz do arquivo HTML. Pode ser controlado pela personalização do plugin HTML to Zip em Preferências-&gt;Plugins ou com a opção --allow-local-files-outside-root no comando ebook-convert

source: PDF Output: Fix regression in previous release causing non-English entries to be incorrectly encoded into the PDF bookmarks
fr: Sortie PDF : Correction d'une régression dans la version précédente provoquant un encodage incorrect des entrées non anglaises dans les signets PDF
pt_br: Saída PDF: Corrige uma regressão na versão anterior que fazia com que entradas em idiomas diferentes do Inglês fossem incorretamente codificadas nos marcadores do PDF

source: PDF Output: Fix regression in previous release that caused blank pages when generating headers or footers
fr: Sortie PDF : Correction d'une régression dans la version précédente qui provoquait des pages blanches lors de la génération d'en-têtes ou de pieds de page
pt_br: Saída PDF: Corrige uma regressão na versão anterior que causava páginas brancas ao gerar cabeçalhos e rodapés

source: Book list: Fix editing-in-place not pre-selecting existing text for some column types
fr: Liste de livres : Correction de l'édition de champs dans l'interface principal qui ne présélectionne pas le texte existant pour certains types de colonnes
pt_br: Lista de livros: Corrige a edição no local não pré-selecionando o texto existente para alguns tipos de colunas

source: Amazon.de metadata download: Update for site changes
fr: Amazon.de metadata download : Mise à jour pour les modifications du site web
pt_br: Download de metadados da Amazon.de: Atualização por conta de mudanças no site

source: PDF Output: Set /Creator and /Producer in /Info
fr: Sortie PDF : Définir /Creator et /Producer dans /Info
pt_br: Saída PDF: Definir /Criador e /Produtor em /Informações

source: Fix row height incorrect in Manage category dialog when blank
fr: Correction de la hauteur de ligne incorrecte dans la boîte de dialogue « Gérer la catégorie » lorsqu'elle est vide
pt_br: Corrige altura de linha incorreta no diálogo Gerenciar categorias quando em branco

source: 6.19.1 fixes a bug in 6.19.0 that broke the edit metadata dialog
fr: 6.19.1 corrige un bogue de la version 6.19.0 qui interrompait la fenêtre de dialogue d'édition des métadonnées
pt_br: 6.19.1 corrige um bug na versão 6.19.0 que danificou o diálogo de edição de metadados

source: 26 May, 2023
fr: 26 mai 2023
pt_br: 26 de Maio de 2023

source: Cover download: Allowing saving alternate covers to disk or in the book's data folder by right clicking on the cover
fr: Téléchargement de couvertures : Permet d'enregistrer des couvertures alternatives sur le disque ou dans le dossier de données du livre en cliquant avec le bouton droit de la souris sur la couverture
pt_br: Download de capas: Permite salvar capas alternativas no disco ou na pasta de dados do livro, ao clicar com o botão direito sobre a capa

source: Content server: Allow disabling full text search via the web interface
fr: Serveur de contenu : Permettre la désactivation de la recherche de texte intégrale via l'interface web
pt_br: Servidor de conteúdo: Permite desabilitar a pesquisa no texto completo via interface web

source: When sending books to the device confirm the overwrite if the book already exists on the device
fr: Lors de l'envoi de livres vers le périphérique, confirmer l'écrasement si le livre existe déjà sur le périphérique
pt_br: Ao enviar livros para o dispositivo, confirma se deseja sobrescrever caso o livro já exista no dispositivo

source: E-book viewer: Handle horizontal wheel events as section jumps in paged mode
fr: Visionneuse de livres numériques : Gérer les événements de rotation de la mollette de la souris comme des sauts de section en mode paginé
pt_br: Visualizador de e-books: Lida com eventos da roda do mouse horizontal como saltos de seção no modo paginado

source: Comic Input: When grayscaling comic images use 16bit gray instead of 8bit for better fidelity
fr: Format bande dessinée : Lors de la conversion d'images de bandes dessinées en niveaux de gris, utilisez des niveaux de gris à 16 bits plutôt qu'à 8 bits pour une meilleure fidélité
pt_br: Entrada HQ: Ao transformar imagens em escala de cinza, usar cinza 16bit em vez de 8bit, para melhor fidelidade

source: When using the PNG format for images this results in larger files but with better grayscaling fidelity.
fr: L'utilisation du format PNG pour les images se traduit par des fichiers plus volumineux, mais avec une meilleure fidélité de l'échelle des gris.
pt_br: Ao usar o formato PNG para imagens, isso irá resultar em arquivos maiores, mas com melhor fidelidade na escala de cinza.

source: Add a new option in Preferences-&gt;Searching to disable keyboard searching in book list (i.e. you can turn off the behavior that pressing a key will jump to the first book whose title starts with that letter)
fr: Ajouter une nouvelle option dans Préférences-&gt;Rechercher pour désactiver la recherche au clavier dans la liste des livres (c'est-à-dire que vous pouvez désactiver le comportement qui consiste à appuyer sur une touche pour aller au premier livre dont le titre commence par cette lettre)
pt_br: Adiciona uma nova opção em Preferências-&gt;Buscar para desabilitar a busca via teclado na lista de livros (ou seja, você pode desativar o comportamento de que pressionar uma tecla irá saltar para o primeiro livro cujo título se inicia com aquela letra)

source: Manage categories dialog: Use alternating row colors and allow adjusting row height
fr: Dialogue de gestion des catégories : Utiliser des couleurs de rangées alternées et permettre d'ajuster la hauteur des rangées
pt_br: Diálogo Gerenciar categorias: Usa linhas com cores alternadas e permite ajuste da altura da linha
