Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: E-book viewer: Read aloud: Fix a regression in the previous release that caused the Read aloud controls to not reappear when Read aloud is canceled and restarted
fr: Visionneuse de livres numériques : Lecture à haute voix : Correction d'une régression dans la version précédente qui faisait que les contrôles de lecture à haute voix ne réapparaissaient pas lorsque la lecture à haute voix était annulée et redémarrée
pt_br: Visualizador de e-books: Ler em voz alta: Corrige uma regressão na versão anterior que fez com que os controles de Ler em voz alta não reaparecessem quando Ler em voz alta fosse cancelado e reiniciado

source: E-book viewer: Read aloud: Fix a regression in the previous release that caused an error when using Read aloud on a chapter with no text, such as the cover page
fr: Visionneuse de livres numériques : Lecture à haute voix : Correction d'une régression dans la version précédente qui provoquait une erreur lors de l'utilisation de la lecture à haute voix sur un chapitre sans texte, comme la page de couverture
pt_br: Visualizador de e-books: Ler em voz alta: Corrige uma regressão na versão anterior que causou um erro ao usar Ler em voz alta em um capítulo sem texto, como a página de capa

source: E-book viewer: Fix a regression that caused a spurious error on Windows when reading out selected text
fr: Visionneuse de livres numériques : Correction d'une régression qui provoquait une fausse erreur sous Windows lors de la lecture d'un texte sélectionné
pt_br: Visualizador de e-books: Corrige uma regressão que causou um erro espúrio no Windows ao ler o texto selecionado

source: Fix a regression in calibre 5.0 that broke sorting the device view by title if one of the books has an empty title
fr: Correction d'une régression dans calibre 5.0 qui ne permettait pas de trier la vue du périphérique par titre si l'un des livres avait un titre vide
pt_br: Corrige uma regressão no calibre 5.0 que danificou a ordenação da visualização de dispositivo por título, caso um dos livros tivesse um título vazio

source: Edit book: Spell Check dialog: Fix second word not getting selected when after first word is fixed
fr: Éditer le livre : Vérifier le livre : Correction du deuxième mot qui n'est pas sélectionné lorsque le premier mot est fixé
pt_br: Editar livro: Diálogo de Verificar ortografia: Corrige segunda palavra não sendo selecionada após a primeira ser corrigida

source: Improve hover highlight color in tree views
fr: Amélioration de la couleur au survol de mises en évidences dans les vues d'arbres
pt_br: Melhora as cores de destaque flutuantes

source: 03 Feb, 2023
fr: 03 février 2023
pt_br: 03 de Fevereiro de 2023

source: E-book viewer: Read aloud: On Windows switch to using the new Microsoft speech subsystem with access to more voices
fr: Visionneuse de livres numériques : Lecture à haute voix : Sur Windows, passez à l'utilisation du nouveau sous-système vocal de Microsoft, qui donne accès à davantage de voix
pt_br: Visualizador de e-books: Ler em voz alta: No Windows, troca para novo subsistema de fala da Microsoft com a acesso a mais vozes

source: Note that this means that old voice, speed and audio devices setting will not be used so a reconfiguration might be needed.
fr: Notez que cela signifie que les anciens paramètres de voix, de vitesse et de périphériques audio ne seront pas utilisés et qu'une reconfiguration pourrait s'avérer nécessaire.
pt_br: Note que isso significa que a configuração antiga de voz, velocidade e dispositivos de áudio não será utilizada, então uma reconfiguração pode ser necessária.

source: calibre:// URL scheme: allow specifying a Virtual library for show_book URLs
fr: calibre:// Schéma d'URL : permet de spécifier une bibliothèque virtuelle pour les URL show_book
pt_br: Esquema de URLs calibre://: Permite a especificação de uma Biblioteca virtual para URLs do tipo show_book

source: Add by ISBN: Allow adding using identifiers other than ISBN as well
fr: Ajouter par ISBN : Permettre l'ajout à l'aide d'identifiants autres que l'ISBN
pt_br: Adicionar por ISBN: Permite adicionar usando outros identificadores além do ISBN

source: Update bundled Qt to 6.4 this means calibre on macOS is now only supported on Big Sur and newer
fr: Mise à jour de Qt vers la version 6.4, ce qui signifie que calibre sur macOS n'est plus supporté que sur Big Sur et les versions plus récentes
pt_br: Atualiza a versão incorporada do Qt para 6.4. Isto significa que o calibre no macOS agora só é suportado a partir do Big Sur

source: Spell check dialog: Allow up and down arrow keys to work regardless of focus
fr: Dialogue de vérification orthographique : Permettre aux touches de déplacement vers le haut et vers le bas de fonctionner indépendamment du focus
pt_br: Diálogo Verificar ortografia: Permite que as teclas de seta para cima e para baixo funcionem independentemente do foco

source: Allow multiple Template tester dialogs
fr: Autoriser l'utilisation de plusieurs boîtes de dialogue pour les testeurs de modèles
pt_br: Permite múltiplos diálogos de Teste do modelo

source: Windows MTP device driver: Ignore failure to enumerate objects inside non-root folders
fr: Pilote de périphérique Windows MTP : Ignorer l'échec de l'énumération des objets dans les dossiers non racine
pt_br: Driver de dispositivo MTP do Windows: Ignora falhas ao enumerar objetos dentro de pastas não-raiz

source: There are apparently a lot of devices out there that fail in this way. So rather than aborting the scan simply ignore the folder.
fr: Il y a apparemment beaucoup de périphériques qui tombent en panne de cette manière. Ainsi, au lieu d'interrompre l'analyse, il suffit d'ignorer le dossier.
pt_br: Aparentemente existem muitos dispositivos por aí que falham desta maneira. Então, em vez de abortar a checagem, simplesmente ignora a pasta.

source: Book list: Fix a regression in the previous release that broke dragging to select multiple books
fr: Liste des livres : Correction d'une régression dans la version précédente qui empêchait de sélectionner plusieurs livres en les faisant glisser
pt_br: Lista de livros: Corrige uma regressão na versão anterior que danificou arrastar para selecionar múltiplos livros

source: Content server viewer: Fix reload book not actually reloading until the browser is also refreshed
fr: Visionneuse du serveur de contenu : Correction du livre de rechargement qui ne se recharge pas tant que le navigateur n'a pas été rafraîchi
pt_br: Visualizador do Servidor de conteúdo: Corrige atualização do livro não acontecendo realmente até que o navegador também seja recarregado

source: E-book viewer: Fix occasional false warning about highlight being overwritten
fr: Visionneuse de livres numériques : Correction d'un faux avertissement occasionnel concernant l'écrasement d'une mises en évidence
pt_br: Visualizador de e-books: Corrige falso alarme ocasional sobre destaques sendo sobrescritos

source: E-book viewer: Fix detection of selected highlights when all text is selected
fr: Visionneuse de livres numériques : Correction de la détection des mises en évidences sélectionnées lorsque tout le texte est sélectionné
pt_br: Visualizador de e-books: Corrige detecção de destaques selecionados quando todo o texto é selecionado

source: Fix an error when embedding metadata into a large number of books
fr: Correction d'une erreur lors de l'intégration de métadonnées dans un grand nombre de livres
pt_br: Corrige um erro ao incorporar metadados em um grande número de livros

source: When updating metadata in EPUB 2 files and no language is specified, do not remove the &lt;dc:language&gt; tag as this causes epubcheck to complain. Instead set the language to "und"
fr: Lors de la mise à jour des métadonnées dans les fichiers EPUB 2 et si aucune langue n'est spécifiée, ne pas supprimez la balise &lt;dc:language&gt ; car epubcheck s'en plaindrait. Au lieu de cela, définissez la langue à "und"
pt_br: Ao atualizar metadados em arquivos EPUB 2, e nenhuma linguagem é especificada, não remover a tag &lt;dc:language&gt;, uma vez que causará um erro no EPUBCheck. Em vez disso, defina a linguagem como "und"

source: Wireless device driver: Remove the timeout for initial connection
fr: Pilote de périphérique sans fil : Supprimer le délai d'attente pour la connexion initiale
pt_br: Driver de dispositivo sem fio: Remove o tempo limite para a conexão inicial

source: Use an icon rather than a color to report errors in fields and the search box
fr: Utiliser une icône plutôt qu'une couleur pour signaler les erreurs dans les champs et la boîte de recherche
pt_br: Usa um ícone em vez de uma cor para relatar erros em campos e na caixa de pesquisa

source: Conversion dialog: Regex builder: Workaround bug in Qt that prevented searching for non breaking spaces in the wizard used to test search expressions
fr: Dialogue de conversion : Constructeur de Regex : Contournement d'un bogue dans Qt qui empêchait la recherche d'espaces non sécants dans l'assistant utilisé pour tester les expressions de recherche
pt_br: Diálogo de conversão: Construtor Regex: Solução alternativa para evitar o bug do Qt que impede a busca por espaços sem quebra no assistente usado para tesar expressões de busca

source: Spell check dialog: move down after correcting word, not up
fr: Dialogue de vérification orthographique : déplacement vers le bas après la correction du mot, et non vers le haut
pt_br: Diálogo Verificar ortografia: desloca para baixo, após corrigir a palavra, e não para cima

source: Get books: Fix Mobileread store plugin not working
fr: Obtenir des livres : Corriger le dysfonctionnement du plugin de la boutique Mobileread
pt_br: Obter livros: Corrige o plugin da loja Mobileread não funcionando

source: 06 Jan, 2023
fr: 06 janvier 2023
pt_br: 06 de Janeiro de 2023

source: Edit book: Check book: Allow automatic fixing of various simple CSS errors
fr: Éditer le livre : Vérifier le livre : Permettre la correction automatique de diverses erreurs CSS simples
pt_br: Editar livro: Verificar livro: Permite correção automática de vários erros simples de CSS

source: E-book viewer: When Read aloud is speaking, make the control bar translucent so that words under the bar are visible
fr: Visionneuse de livres numériques : Lorsque la lecture à haute voix est en cours, la barre de contrôle doit être translucide pour que les mots situés sous la barre soient visibles
pt_br: Visualizador de e-books: Quando Ler em voz alta está ativo, torna a barra de controles translúcida, de maneira que as palavras abaixo dela estejam visíveis

source: Edit book: Switch to a new library (stylelint) for find problems in CSS as the old library was no longer maintained.
fr: Éditer le livre : Passage à une nouvelle bibliothèque (stylelint) pour trouver les problèmes dans les CSS, l'ancienne bibliothèque n'étant plus maintenue
pt_br: Editar livro: Muda para uma nova biblioteca (stylelint) para encontrar problemas no CSS, uma vez que a antiga biblioteca não estava mais sendo atualizada.

source: Edit book: File browser: Allow using keyboard shortcuts to re-order the spine
fr: Éditer le livre : Explorateur de fichiers : Permettre l'utilisation de raccourcis clavier pour réorganiser la colonne vertébrale
pt_br: Editar livro: Navegador de arquivos: Permite usar atalhos de teclado para reordenar a lombada

source: calibredb list: Allow specifying multiple fields for --sort-by
fr: calibredb list : Permettre de spécifier plusieurs champs pour --sort-by
pt_br: calibredb list: Permite especificar múltiplos campos para --sort-by

source: Check library: Allow opening the book folder easily
fr: Vérifier la bibliothèque : Permet d'ouvrir facilement le dossier des livres
pt_br: Verificar biblioteca: Permite abrir a pasta do livro facilmente

source: Fix windows not being moved onto the current monitor when they were previously visible on a removed monitor that was to the left of the current monitor
fr: Correction des fenêtres qui ne sont pas déplacées sur le moniteur actuel alors qu'elles étaient auparavant visibles sur un moniteur retiré qui se trouvait à gauche du moniteur actuel
pt_br: Corrige janelas não sendo movidas para o monitor atual quando elas estavam previamente visíveis em um monitor removido que estive à esquerda do monitor atual

source: Book list: Fix a regression in the previous release that broke drag and drop of multiple books
fr: Liste des livres : Correction d'une régression dans la version précédente qui empêchait le glisser-déposer de plusieurs livres
pt_br: Lista de livros: Corrige uma regressão na versão anterior que danificou arrastar e soltar múltiplos livros

source: Fix detection of Tolino Vision 6 on macOS/Linux
fr: Correction de la détection de Tolino Vision 6 sur macOS/Linux
pt_br: Corrige detecção do Tolino Vision 6 no macOS/Linux

source: Content server: Fix auto full screen not working when continuing to read books with user account enabled
fr: Serveur de contenu : Correction du dysfonctionnement du plein écran automatique lors de la poursuite de la lecture de livres avec un compte utilisateur activé
pt_br: Servidor de conteúdo: Corrige tela cheia automática não funcionando ao continuar lendo livros com uma conta de usuário habilitada

source: Edit book: Set semantics: Fix error when setting the "Notes" semantic
fr: Éditer le livre : Régler Sémantique : Correction d'une erreur lors de la définition de la sémantique "Notes"
pt_br: Editar livro: Definir semântica: Corrige erro ao definir a semântica de "Notas"

source: HTMLZ output: Fix images referred to in CSS stylesheets not being converted
fr: Sortie HTMLZ : Correction des images référencées dans les feuilles de style CSS qui ne sont pas converties
pt_br: Saída HTMLZ: Corrige imagens referenciadas nas folhas de estilo CSS não sendo convertidas

source: Book details panel: Fix HTML comment tags in the comments breaking display of book details
fr: Panneau des détails du livre : Correction des balises HTML dans les commentaires interrompant l'affichage des détails du livre
pt_br: Painel de Detalhes do livro: Corrige tags de comentário HTML nos comentários danificando a exibição dos detalhes do livro

source: Content server home page: When showing recently read books from across devices hide the entries for which loading the cover fails
fr: Page d'accueil du serveur de contenu : Lors de l'affichage des livres récemment lus sur plusieurs périphériques, masquer les entrées pour lesquelles le chargement de la couverture échoue
pt_br: Página inicial do Servidor de conteúdo: Ao mostrar livros lidos recentemente de vários dispositivos, esconde as entradas para as quais o carregamento da capa falhar

source: Windows Text-to-speech: Do not fail to configure if one of the voices has no defined language
fr: Synthèse vocale Windows : Ne pas omettre de configurer si l'une des voix n'a pas de langue définie
pt_br: Texto-para-fala do Windows: A configuração não falha se uma das vozes não tiver uma linguagem defnida

source: Fix a regression in calibre 5 that broke using a file for the --extra-css option of ebook-convert
fr: Correction d'une régression dans calibre 5 qui cassait l'utilisation d'un fichier pour l'option --extra-css de ebook-convert
pt_br: Corrige uma regressão no calibre 5 que danificou o uso de um arquivo para a opção --extra-css para ebook-convert

source: Content server FTS: Fix page header bar not visible
fr: Serveur de contenu FTS : Correction de la barre d'en-tête de page non visible
pt_br: Pesquisa no texto completo no Servidor de conteúdo: Corrige a barra de cabeçalho da página não visível

source: Content server: Fix identifiers from third party metadata download plugins not becoming clickable links on the book details page
fr: Serveur de contenu : Correction des identifiants provenant de plugins de téléchargement de métadonnées tiers qui ne deviennent pas des liens cliquables sur la page de détails du livre
pt_br: Servidor de conteúdo: Corrige identificadores de plugins de terceiros não se tornando clicáveis na página de detalhes do livro

source: Edit book: Warn when saving will overwrite a read-only file
fr: Éditer le livre : Avertir lorsque l'enregistrement écrase un fichier en lecture seule
pt_br: Editar livro: Alerta quando salvar irá sobrescrever um arquivo somente leitura

source: Fix restoring geometry of maximized/fullscreen dialogs forcing them visible
fr: Correction de la restauration de la géométrie des dialogues maximisés/plein écran pour les rendre visibles
pt_br: Corrige restauração de geometria de diálogos maximizados/tela cheia forçando os a se tornar visíveis

source: Fix a regression in the previous release that caused spurious error message when doing some out of band searches
fr: Correction d'une régression dans la version précédente qui provoquait des messages d'erreur intempestifs lors de certaines recherches hors bande
pt_br: Corrige uma regressão na versão anterior que causou uma mensagem de erro espúria ao fazer algumas pesquisas

source: Fix a regression in the previous release that broke choosing new programs for the Open with function
fr: Correction d'une régression dans la version précédente qui empêchait de choisir de nouveaux programmes pour la fonction "Ouvrir avec"
pt_br: Corrige uma regressão na versão anterior que danificou a escolha de novos programas para a função Abrir com

source: 16 Dec, 2022
fr: 16 décembre 2022
pt_br: 16 de Dezembro de 2022

source: Content server: Add support for searching the full text of books. Simply click the FTS link on the search page to start a full text search.
fr: Serveur de contenu : Ajout d'une fonction de recherche dans le texte intégral des livres. Il suffit de cliquer sur le lien FTS de la page de recherche pour lancer une recherche en texte intégral
pt_br: Servidor de conteúdo: Adiciona suporte para pesquisa no texto completo de livros. Simplesmente clique no link FT na página de busca para iniciar a busca.

source: Content server: When using user accounts, the homepage now shows recently read books from any device not just the current device
fr: Serveur de contenu : Lors de l'utilisation de comptes utilisateurs, la page d'accueil affiche désormais les livres récemment lus depuis n'importe quel périphérique et non plus seulement depuis le périphérique actuel.
pt_br: Servidor de conteúdo: Ao usar contas, a página inicia mostra os livros recentemente adicionados de qualquer dispositivo, não apenas do dispositivo atual

source: Kobo driver: Bump the max supported firmware version
fr: Pilote Kobo : Prise en charge de la nouvelle version du firmware
pt_br: Driver do Kobo: Aumenta o número da última versão de firmware suportada

source: Conversion: New Output profile for the Kindle Scribe
fr: Conversion : Nouveau profil de sortie pour Kindle Scribe
pt_br: Conversão: Novo perfil de saída para o Kindle Scribe

source: Check library: Allow ignoring folder names as well as files names
fr: Vérifier la bibliothèque : Permettre d'ignorer les noms de dossiers ainsi que les noms de fichiers
pt_br: Verificar biblioteca: Permite ignorar nomes de pastas assim como nomes de arquivos

source: Edit book: Fix various formatting operations not inserting the tags in the correct place in the presence of non-BMP characters
fr: Éditer le livre : Correction de diverses opérations de formatage n'insérant pas les balises au bon endroit en présence de caractères non-BMP
pt_br: Editar livro: Corrige várias operações de formatação não inserindo as tags na posição correta, na presença de caracteres não-BMP

source: Edit book: Use &lt;s&gt; instead of &lt;strike&gt; for strikethrough
fr: Éditer le livre : Utilisez &lt;s&gt ; au lieu de &lt;strike&gt ; pour le barré
pt_br: Editar livro: Usa &lt;s&gt; em vez de &lt;strike&gt; para o texto riscado

source: Edit book: Fix export saved search to search panel not preserving the wrap checkbox state
fr: Éditer le livre : Correction de l'exportation d'une recherche sauvegardée vers le panneau de recherche ne préservant pas l'état de la case à cocher Retour à la ligne
pt_br: Editar livro: Corrige exportação de pesquisa salva para o painel de pesquisa não preservando o estado da caixa de seleção de quebra automática

source: Content server: Redirect the index page to always have trailing slash when using URL prefixes
fr: Serveur de contenu : Redirection de la page d'index pour qu'elle contienne toujours le slash de fin lors de l'utilisation de préfixes d'URL
pt_br: Servidor de conteúdo: Redireciona a página de índice para sempre ter uma barra final ao usar prefixos de URL

source: Book list: Workaround for change in Qt 6 behavior where clicking on an already selected row does not deselect other rows
fr: Liste des livres : Contournement du changement de comportement de Qt 6 où le fait de cliquer sur une ligne déjà sélectionnée ne désélectionne pas les autres lignes
pt_br: Lista de livros: Solução alternativa para uma mudança no comportamento do Qt 6, que ao clicar em uma linha já selecionada não removia a seleção das outras linhas

source: Windows: Fix a regression in calibre 6 causing Open with to not extract icons from EXE files
fr: Windows : Correction d'une régression dans calibre 6 qui fait qu'Ouvrir avec n'extrait pas les icônes des fichiers EXE
pt_br: Windows: Corrige uma regressão no calibre 6 fazendo com que o Abrir com não conseguisse extrair ícones de arquivos EXE

source: 25 Nov, 2022
fr: 25 novembre 2022
pt_br: 25 de Novembro de 2022

source: E-book viewer: When exporting highlights as plain text include titles from chapters at all levels not just the first level
fr: Visionneuse de livres numériques : Lors de l'exportation des mises en évidences en texte brut, inclure les titres des chapitres de tous les niveaux et pas seulement du premier niveau
pt_br: Visualizador de e-books: Ao exportar destaques como texto simples, inclui títulos dos capítulos em todos os níveis, não apenas no primeiro

source: Edit book: Reports: Show the number of words per file in the Files section of the report
fr: Éditer le livre : Rapports : Afficher le nombre de mots par fichier dans la section Fichiers du rapport
pt_br: Editar livro: Relatórios: Mostra o número de palavras por arquivo na seção Arquivos do relatório

source: Windows builds: sign DLLs in addition to EXEs to make Microsoft's new "Smart App Control" tool happy
fr: Builds Windows ; signez les DLL en plus des EXE pour que le nouvel outil "Smart App Control" de Microsoft soit content
pt_br: Compilações do Windows: Assina as DLLs, além dos EXEs, para deixar feliz a nova ferramenta "Smart App Control" da Microsoft

source: Sending by email: When adding comments also add series
fr: Envoi par courrier électronique : Lorsque vous ajoutez des commentaires, ajoutez également des séries
pt_br: Enviar por e-mail: Ao adicionar comentários, também adiciona séries

source: Nook driver: Put files in NOOK/Books instead of NOOK/My Files on recent nook devices so they are all listed in one place in the NOOK UI
fr: Pilote Nook : Placez les fichiers dans NOOK/Livres au lieu de NOOK/Mes fichiers sur les périphériques Nook récents afin qu'ils soient tous listés au même endroit dans l'interface utilisateur NOOK
pt_br: Driver do Nook: Coloca os arquivos em NOOK/Books, em vez de NOOK/My Files, em dispositivos Nook recentes, de forma que eles são todos listados em um só lugar na interface

source: calibredb list: Allow using a template as one of the returned fields
fr: calibredb list : Autoriser l'utilisation d'un template comme l'un des champs retournés
pt_br: calibredb list: Permite usar um modelo como um dos campos retornados
