Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Tag browser: Add context menu action to turn on/off sub-categorization for a category
fr: Navigateur d'étiquettes : Ajout d'une action dans le menu contextuel pour activer/désactiver la sous-catégorisation d'une catégorie
pt_br: Navegador de etiquetas: Adiciona uma ação ao menu de contexto para ligar/desligar a subcategorização para uma categoria

source: Merging books: Fix title sort not being updated when the title is updated
fr: Fusion de livres : Correction du tri des titres qui n'est pas mis à jour lorsque le titre est mis à jour
pt_br: Mesclar livros: Corrige ordenação de título não sendo atualizada quando os títulos são atualizados

source: Content server viewer: Fix incorrect sorting of highlights in the same paragraph
fr: Visionneuse du serveur de contenu : Correction d'un tri incorrect des mises en évidences dans un même paragraphe
pt_br: Visualizador do Servidor de conteúdo: Corrige ordenação incorreta de destaques no mesmo parágrafo

source: Content server viewer: When exporting highlights as text include chapter titles
fr: Visionneuse du serveur de contenu : Lors de l'exportation des mises en évidences sous forme de texte, inclure les titres des chapitres
pt_br: Visualizador do Servidor de conteúdo: Ao exportar destaques como texto, incluir o títulos dos capítulos

source: Improve rendering of the separator handle dots introduced in the previous release
fr: Amélioration du rendu des points de la poignée du séparateur introduite dans la version précédente
pt_br: Melhorar a renderização dos pontos de alça do separador introduzidos na versão anterior

source: Edit book: Fix regression in previous release causing applying any container update marking all open image editors as modified
fr: Éditer le livre : Correction d'une régression dans la version précédente qui faisait que l'application d'une mise à jour de conteneur marquait tous les éditeurs d'images ouverts comme modifiés
pt_br: Editar livro: Corrige uma regressão na versão anterior que fazia com que a aplicação de qualquer atualização de contêiner, marcasse todos os editores de imagem abertos como modificados

source: Fix a regression in the previous release that caused copying book details to clipboard to use unix line endings on windows
fr: Correction d'une régression dans la version précédente qui faisait que la copie des détails d'un livre dans le presse-papiers utilisait des fins de ligne unix sous Windows
pt_br: Corrige uma regressão na versão anterior que fazia com que a cópia dos detalhes de livros para a área de transferência usasse quebras de linha Unix, no Windows

source: 04 Nov, 2022
fr: 04 novembre 2022
pt_br: 04 de Novembro de 2022

source: Allow customizing the buttons available to the right of the search bar in the main calibre window via Preferences-&gt;Toolbars &amp; menus-&gt;The buttons on the searchbar
fr: Permet de personnaliser les boutons disponibles à droite de la barre de recherche dans la fenêtre principale de calibre via Préférences-&gt;Barres d'outils &amp; menus-&gt;Les boutons de la barre de recherche
pt_br: Permite a personalização dos botões disponíveis à direita da barra de pesquisa na janela principal do calibre via Preferências-&gt;Barras de ferramentas &amp; menus-&gt;Os botões na barra de pesquisa

source: Book details panel: Allow adjusting the space used by the cover with a splitter
fr: Panneau de détails du livre : Permet d'ajuster l'espace utilisé par la couverture à l'aide d'un séparateur
pt_br: Painel de Detalhes do livro: Permite ajustar o espaço usado pela capa com um divisor

source: Make splitter handles more visible in the calibre UI style
fr: Rendre les poignées de séparation plus visibles dans le style de l'interface utilisateur de calibre
pt_br: Torna as alças de divisores mais visíveis no estilo do calibre

source: When sending by email to Kindle do not include the author in the filename as Amazon is currently reading the author from the file metadata but not the title
fr: Lors de l'envoi par courrier électronique à Kindle, ne pas inclure l'auteur dans le nom du fichier car Amazon lit actuellement l'auteur à partir des métadonnées du fichier, mais pas le titre
pt_br: Ao enviar e-mail para o Kindle, não incluir o autor no nome do arquivo, uma vez que a Amazon está atualmente lendo o nome do autor a partir dos metadados do arquivo, mas não o título

source: Book list: Fix incorrect rendering of yes/no icons when they are configured to have only two values
fr: Liste des livres : Correction du rendu incorrect des icônes oui/non lorsqu'elles sont configurées pour n'avoir que deux valeurs
pt_br: Lista de livros: Corrige renderização incorreta de ícones sim/não quando eles estão configurados para ter apenas dois valores

source: Nook driver: Send books to the NOOK folder for the 2021 Nook model as well
fr: Pilote Nook : envoyez également des livres dans le dossier NOOK pour le modèle Nook 2021
pt_br: Driver do Nook: Envia livros para a pasta NOOK para os modelos de 2021 também

source: Improve performance in very large libraries of various UI operations such as right clicking, marking books, etc.
fr: Amélioration des performances dans les très grandes bibliothèques de diverses opérations d'interface utilisateur telles que le clic droit, le marquage de livres, etc.
pt_br: Melhora a performance de várias operações da interface gráfica para bibliotecas muito grandes, como cliques com o botão direito, marcar livros, etc.

source: Fix edit metadata dialog not remembering its position and improve how calibre restores window position and size on multi-monitor systems
fr: Correction de la boîte de dialogue d'édition des métadonnée qui ne se souvient pas de sa position et amélioration de la façon dont calibre restaure la position et la taille de la fenêtre sur les systèmes multi-moniteurs
pt_br: Corrige diálogo de Editar metadados não lembrando sua posição e melhora como o calibre restaura a posição e tamanho de janelas em sistemas com múlplitos monitores

source: Conversion: Fix CSS styles applied to SVG elements being discarded
fr: Conversion : Correction des styles CSS appliqués aux éléments SVG qui ne sont pas pris en compte
pt_br: Conversão: Corrige estilos CSS aplicados a elementos SVG sendo descartados

source: EPUB Input: Fix empty Adobe page number template file causing conversion to fail
fr: Entrée EPUB : Correction d'un fichier de modèle de numéro de page Adobe vide entraînant l'échec de la conversion
pt_br: Entrada EPUB: Corrige arquivo de modelo de número de página da Adobe vazio fazendo a conversão falhar

source: E-book viewer: Fix rendering of comments in metadata display when using a dark color scheme
fr: Visionneuse de livres numériques : Correction du rendu des commentaires dans l'affichage des métadonnées lors de l'utilisation d'une palette de couleurs sombre
pt_br: Visualizador de e-books: Corrige renderização de comentários na exibição de metadados ao usar um esquema de cores escuro

source: AZW3 Input: Fix svg images that use a prefix for the SVG namespace not being recognized
fr: Entrée AZW3 : Correction des images svg qui utilisent un préfixe pour l'espace de noms SVG et qui ne sont pas reconnues
pt_br: Entrada AZW3: Corrige imagens SVG que usam um prefixo para namespace SVG não sendo reconhecidas

source: Edit book: Fix double clicking in the see what changed dialog not opening the file in the editor since calibre 6.0
fr: Éditer le livre : Correction du double clic dans la boîte de dialogue "voir ce qui a changé" qui n'ouvre pas le fichier dans l'éditeur depuis calibre 6.0
pt_br: Editar livros: Corrige clique duplo no diálogo Veja o que foi alterado não abrindo o arquivo no editor deste o calibre 6.0

source: Edit book: Fix modified indicator on images not working correctly when replacing the image
fr: Éditer le livre : Correction de l'indicateur de modification des images ne fonctionnant pas correctement lors du remplacement de l'image
pt_br: Editar livro: Corrige indicador de modificação em imagens não funcionando corretamente ao substituir a imagem

source: Amazon metadata download: Adapt the plugin for website changes
fr: Amazon metadata download : Adapter le plugin aux modifications du site web
pt_br: Download de metadados da Amazon: Adapta o plugin às mudanças no site

source: 14 Oct, 2022
fr: 14 octobre 2022
pt_br: 14 de Outubro de 2022

source: Template language: A new "Python template mode" which allows using arbitrary Python code in templates
fr: Modèle de langage: Un nouveau "Mode modèle Python" qui permet d'utiliser un code Python arbitraire dans les modèles.
pt_br: Linguagem de modelo: Um novo "Modo de modelo Python", o qual permite usar qualquer código Python nos modelos

source: Tag browser: Allow removing format from selected books by right clicking on the format in the Tag browser
fr: Navigateur d'étiquettes : Permet de supprimer le format des livres sélectionnés en faisant un clic droit sur le format dans le Navigateur d'étiquettes.
pt_br: Navegador de etiquetas: Permite remover formatos de livros selecionados ao clicar com o botão direito no formato, no Navegador de etiquetas

source: E-book viewer: Ask for confirmation when creating a highlight that will overwrite existing highlights
fr: Visionneuse de livres numériques : Demande de confirmation lors de la création d'une mise en évidence qui écrasera les mises en évidence existantes
pt_br: Visualizador de e-books: Pede confirmação ao criar um destaque que irá sobrescrever outro destaque existente

source: Book list: Allow changing column widths via a dedicated dialog by right clicking on column headers
fr: Liste des livres : Permet de modifier la largeur des colonnes via une boîte de dialogue dédiée en cliquant avec le bouton droit de la souris sur les en-têtes de colonnes
pt_br: Lista de livros: Permite alterar a largura da coluna via um diálogo dedicado, ao clicar com o botão direito no cabeçalho da coluna

source: E-book viewer: Fix a regression that broke adding of new lookup sources
fr: Visionneuse de livres numériques : Correction d'une régression qui interrompait l'ajout de nouvelles sources de recherche
pt_br: Visualizador de e-books: Corrige uma regressão que danificou a adição de novas fontes de pesquisa

source: E-book viewer: Fix copy to clipboard not ignoring text from elements that are marked as non user selectable
fr: Visionneuse de livres numériques : Correction de la copie dans le presse-papiers n'ignorant pas le texte des éléments marqués comme non sélectionnables par l'utilisateur
pt_br: Visualizador de e-books: Corrige "Copiar para a área de transferência" ignorando o texto de elementos que são marcados como não selecionáveis pelo usuário

source: Content server: When adding books, run all file type plugins before reading metadata
fr: Serveur de contenu : Lors de l'ajout de livres, exécuter tous les plugins de type de fichier avant de lire les métadonnées
pt_br: Servidor de conteúdo: Ao adicionar livros, executa todos os plugins de tipo de arquivos antes de ler os metadados

source: Edit book: Preview panel: In dark mode when all of the background/foreground/link colors are set to "No change" do not render the book using dark colors
fr: Éditer le livre : Panneau de prévisualisation : En mode sombre, lorsque toutes les couleurs d'arrière-plan, d'avant-plan et de lien sont réglées sur "Pas de changement", le livre n'est pas rendu avec des couleurs sombres
pt_br: Editar livro: Painel de Visualização: No modo escuro, quando todas as cores de fundo/primeiro plano/links estiverem definidas como "Nenhuma mudança", não renderiza o livro usando cores escuras

source: Version 6.7.1 fixes a regression in the previous release that broke the delete specific format from book function
fr: La version 6.7.1 corrige une régression dans la version précédente qui cassait la fonction de suppression d'un format spécifique d'un livre
pt_br: A versão 6.7.1 corrige uma regressão na versão anterior que danificou a função de apagar um formato específico do livro

source: 30 Sep, 2022
fr: 30 septembre 2022
pt_br: 30 de Setembro de 2022

source: Book details: allow displaying multi-valued categories such as tags on separate lines via Preferences-&gt;Look &amp; feel-&gt;Book details
fr: Détails du livre : permet d'afficher les catégories à valeurs multiples telles que les tags sur des lignes séparées via Préférences-&gt;Apparence et présentation-&gt;Détails du livre
pt_br: Detalhes do livro: Permite exibir categorias com múltiplos valores, como etiquetas, em linhas separadas via Preferências-&gt;Aparência-&gt;Detalhes do livro

source: Tag browser: When searching the Tag browser allow also filtering the book list to show only books that match one of the categories currently shown in the Tag browser.
fr: Navigateur d'étiquettes : Lors d'une recherche dans le Navigateur d'étiquettes, il est également possible de filtrer la liste des livres afin de n'afficher que les livres correspondant à l'une des catégories actuellement affichées dans le Navigateur d'étiquettes.
pt_br: Navegador de etiquetas: Ao pesquisar no Navegador de etiquetas, permite também filtrar a lista de livros para mostrar apenas livros que correspondem a uma das categorias atualmente exibidas no Navegador de etiquetas.

source: To use enable the two Preferences: "Preferences-&gt;Look &amp; feel-&gt;Tag browser-&gt;Hide empty categories" and "Find shows all items that match". Then, when searching the Tag browser, press Ctrl+Alt+Shift+F to restrict the displayed books.
fr: Pour l'utiliser, activez les deux préférences : "Préférences-&gt;Apparence et présentation-&gt;Navigateur d'étiquettes-&gt;Cacher les catégories vides" et "Rechercher affiche tous les éléments qui correspondent". Ensuite, lorsque vous effectuez une recherche dans l'Explorateur, appuyez sur Ctrl+Alt+Shift+F pour restreindre les livres affichés.
pt_br: Para usar, habilite duas configurações: "Preferências-&gt;Aparência-&gt;Navegador de Etiquetas-&gt;Esconder categorias vazias" e "Busca mostra todos os itens correspondentes". Então, ao pesquisar no Navegador de Etiquetas, pressione Ctrl+Alt+Shif+F para restringir os livros exibidos.

source: Edit book: When right clicking on HTML files in EPUB 3 books, allow marking them as the Table of Contents (NAV document)
fr: Éditer le livre : Lors d'un clic droit sur les fichiers HTML dans les livres EPUB 3, permettre de les marquer comme table des matières (document NAV)
pt_br: Editar livro: Ao clicar com o botão direito em arquivos HTML em livros EPUB 3, permite marcá-los como Índice (documento de navegação - NAV)

source: EPUB Output: Fix converting a document with obfuscated fonts to EPUB 3 not working
fr: Sortie EPUB : Correction de la conversion d'un document avec des polices obfusquées vers EPUB 3 ne fonctionnant pas
pt_br: Saída EPUB: Corrige conversão de documento com fontes ofuscadas para EPUB 3 não funcionando

source: Edit book: Fix an error when processing books that contain comments inside unknown CSS @ rules
fr: Éditer le livre : Correction d'une erreur lors du traitement de livres contenant des commentaires à l'intérieur de règles CSS @ inconnues
pt_br: Editar livro: Corrige um erro ao processar livros que contém comentários dentro de regras CSS @ desconhecidas

source: Content server: Fix jumping to locations such as bookmarks not working on iPhone/iPad running iOS &gt;= 15
fr: Serveur de contenu : Correction du saut vers des emplacements tels que les signets ne fonctionnant pas sur les iPhone/iPad fonctionnant sous iOS &gt;= 15
pt_br: Servidor de conteúdo: Corrige pular para locais como marcadores não funcionando em iPhone/iPad executando iOS &gt;= 15

source: Font subsetting: Fix :first-line and :first-letter pseudo classes not being handled correctly
fr: Sous-ensemble de polices : Correction des pseudo classes :first-line et :first-letter qui ne sont pas gérées correctement
pt_br: Subconjunto de fontes: Corrige pseudo classes :first-line e :first-letter não sendo tratadas corretamente

source: Workaround for Amazon's email delivery service not reading metadata from inside ebook files
fr: Solution de contournement pour le service d'envoi d'e-mails d'Amazon qui ne lit pas les métadonnées à l'intérieur des fichiers de livres électroniques
pt_br: Solução alternativa para o serviço de entrega de e-mails da Amazon não lendo os metadados direto do conteúdo dos arquivos

source: Edit book: File list: Fix pressing Tab key while renaming a file not starting the rename of the next file
fr: Éditer le livre : Correction où presser la touche Tab lors du renommage d'un fichier qui ne démarre pas le renommage du fichier suivant
pt_br: Editar livro: Navegador de arquivos: Corrige pressionar a tecla Tab enquanto renomeia um arquivo não continuando a renomear o próximo arquivo

source: Version 6.6.1 fixes a regression that caused the Edit metadata window to not remember its last used size. Note that you will have to resize it once after updating to 6.6.1, after which the size will be remembered.
fr: La version 6.6.1 corrige une régression qui faisait que la fenêtre Editer les métadonnées ne se souvenent pas de la dernière taille utilisée. Notez que vous devrez la redimensionner une fois après la mise à jour vers la version 6.6.1, après quoi la taille sera mémorisée.
pt_br: A versão 6.6.1 corrige uma regressão que fazia com que a janela Editar metadados não lembrasse seus último tamanho utilizado. Note que você terá que redimensioná-la uma vez após atualizar para a versão 6.6.1, após o que o tamanho será lembrado.

source: 16 Sep, 2022
fr: 16 septembre 2022
pt_br: 16 de Setembro de 2022

source: Kobo driver: support the new Kobo Clara 2e
fr: Pilote Kobo : Prise en charge du nouveau Kobo Clara 2e
pt_br: Driver do Kobo: Suporta o novo Kobo Clara 2e

source: When running calibre with the --with-library command line flag and calibre is already running, switch to the specified library in calibre
fr: Lorsque calibre est exécuté avec l'argument de ligne de commande --with-library et que calibre est déjà en cours d'exécution, il passe à la bibliothèque spécifiée dans calibre.
pt_br: Ao executar o calibre com a opção de linha de comando --with-library e o calibre já estiver rodando, alterna para a biblioteca especificada no calibre

source: E-book viewer: Ask for confirmation when deleting a custom highlight style
fr: Visionneuse de livres numériques : Demande de confirmation lors de la suppression d'un style de mises en évidence personnalisé
pt_br: Visualizador de e-books: Pede confirmação ao apagar um estilo de destaque personalizado

source: Do not show the virtual libraries tab bar when no virtual libraries are present
fr: Ne pas afficher la barre d'onglets des bibliothèques virtuelles lorsqu'aucune bibliothèque virtuelle n'est présente
pt_br: Não mostrar a barra de abas de bibliotecas virtuais quando nenhuma biblioteca virtual estiver presente

source: Tag mapper: When specifying the replacement tag allow completion from the tags in the currently open library
fr: Mappeur d'étiquettes : Lors de la spécification de la balise de remplacement, autoriser la complétion à partir des balises de la bibliothèque actuellement ouverte
pt_br: Mapeador de etiquetas: Ao especificar etiqueta de substituição, permite autocompletar a partir das etiquetas da biblioteca atualmente aberta

source: Template language: New functions strcasecmp() and to_hex()
fr: Langage de modèle : Nouvelles fonctions strcasecmp() et to_hex()
pt_br: Linguagem de modelo: Novas funções strcasecmp() e to_hex()

source: Comments editor: Workaround for Qt inserting invalid font-weight when converting a paragraph to a heading
fr: Éditeur de commentaires : Solution de contournement pour Qt qui insère un poids de police invalide lors de la conversion d'un paragraphe en titre
pt_br: Editor de comentários: Solução alternativa para o Qt inserindo espessuras de fonte inválidas ao converter um parágrafo em um título

source: E-book viewer: When displaying highlights do not group highlights from different chapters when the chapter titles are identical
fr: Visionneuse de livres numériques : Lors de l'affichage des mises en évidence, ne pas regrouper les mises en évidence de différents chapitres lorsque les titres des chapitres sont identiques
pt_br: Visualizador de e-books: Ao exibir destaques, não agrupar destaques de diferentes capítulos quando os títulos dos capítulos forem idênticos

source: Tag browser: Fix error if a User category contains a reference to a deleted custom column
fr: Navigateur d'étiquettes : Correction d'une erreur si une catégorie utilisateurs contient une référence à une colonne personnalisée supprimée
pt_br: Navegador de Etiquetas: Corrige o erro no caso de uma Categoria do usuário conter uma referência a uma coluna personalizada eliminada

source: When sending books by email to the Kindle and PocketBook email delivery services use random subject and filenames consisting of simple English letters to try to workaround various bugs in their email processing code
fr: Lors de l'envoi de livres par courrier électronique au Kindle et au PocketBook, les services de livraison par courrier électronique utilisent des noms d'objet et de fichier aléatoires composés de lettres anglaises simples pour essayer de contourner divers bugs dans leurs code de traitement des courriers électroniques
pt_br: Ao enviar livros por e-mail para o serviços de entrega do Kindle e PocketBook, usa assuntos aleatórios e nomes de arquivos consistindo de simples letras em inglês, para tentar evitar os vários erros no sistema de processamento de e-mails deles

source: 02 Sep, 2022
fr: 02 septembre 2022
pt_br: 02 de Setembro de 2022

source: Conversion pipeline: Add support for !important when flattening CSS rules
fr: Pipeline de conversion : Ajout de la prise en charge de !important lors de l'aplatissement des règles CSS
pt_br: Pipeline de conversão: adiciona suporte para !important ao nivelar regras CSS

source: Content server: Use the chapter title as the base bookmark name when creating new bookmarks
fr: Serveur de contenu : Utiliser le titre du chapitre comme nom de base du signet lors de la création de nouveaux signets
pt_br: Servidor de conteúdo: Usa o título do capítulo como o nome base do marcador ao criar novos marcadores

source: Allow changing the search order when clicking on items in the Tag browser (Preferences-&gt;Look &amp; feel-&gt;Tag browser-&gt;Hierarchy and searching)
fr: Permettre de changer l'ordre de recherche en cliquant sur les éléments dans le Navigateur d'étiquettes (Préférences-&gt;Apparence &amp; présentation-&gt;Navigateur d'étiquettes-&gt;Hiérarchie et recherche)
pt_br: Permite alterar a ordem de busca ao clicar em itens no Navegador de Etiquetas (Preferências-&gt;Aparência-&gt;Navegador de Etiquetas-&gt;Hierarquia e pesquisa

source: Check library: Make vacuuming the full text database optional as it is very slow and memory intensive
fr: Vérifier la bibliothèque : Rendre l'aspiration de la base de données de texte intégral facultative, car elle est très lente et consomme beaucoup de mémoire
pt_br: Verificar biblioteca: Torna a opção de limpar a base de dados da pesquisa no texto completo opcional, uma vez que é muito lenta e usa muita memória

source: Tag browser: Move the preferences for controlling the order and display of categories in the Tag browser from Preferences-&gt;Tweaks to Preferences-&gt;Look &amp; feel-&gt;Tag browser
fr: Navigateur d'étiquettes : Déplacer les préférences permettant de contrôler l'ordre et l'affichage des catégories dans le Navigateur d'étiquettes de Préférences-&gt;Ajustements à Préférences-&gt;Apparence &amp ; présentation-&gt;Navigateur d'étiquettes
pt_br: Navegador de Etiquetas: Move as preferências para controlar a ordem e exibição de categorias no Navegador de Etiquetas de Preferências-&gt;Ajustes para Preferências-&gt;Aparência-&gt;Navegador de etiquetas
