Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: 17 Nov, 2023
fr: 17 novembre 2023

source: Release
fr: Version
pt_br: Versão

source: New features
fr: Nouvelles fonctionnalités
pt_br: Novas funcionalidades

source: For details on the major changes in calibre between 7.0 and 6.0, see <a href="%(h0)s">%(h0)s</a>
fr: Pour des détails sur les changements majeurs dans calibre entre la version 7.0 et la version 6.0 voir <a href="%(h0)s">%(h0)s</a>

source: The ability to add notes to any author, tag, series, etc. in calibre with links and images
fr: La possibilité d'ajouter des notes à n'importe quel auteur, étiquette, série, etc. dans calibre avec des liens et des images

source: E-book viewer: Add support for HTML image maps
fr: Visionneuse de livre numérique : Ajout de la prise en charge des "image maps" HTML

source: Closes tickets
fr: Ferme le ticket
pt_br: Encerra o chamado

source: Content server home page: Show the three most recently added books in the default library
fr: Page d'accueil du serveur de contenu : Afficher les trois derniers livres ajoutés dans la bibliothèque par défaut

source: Content server: Add button to return to book details page at top level of controls
fr: Serveur de contenu : Ajout d'un bouton permettant de revenir à la page de détails du livre au niveau supérieur des contrôles

source: Content server: Book details: Open links in comments fields in the same window rather than a new window
fr: Serveur de contenu : Détails du livre : Ouvrir les liens dans les champs de commentaires dans la même fenêtre plutôt que dans une nouvelle fenêtre

source: Add a "Show items in selected books" choice to Manage tags and Manage authors
fr: Ajouter un choix « Afficher les éléments dans les livres sélectionnés » à Gérer les étiquettes et Gérer les auteurs

source: Show the previously used language, if any, second in the language selection drop down
fr: Afficher la langue précédemment utilisée, le cas échéant, en deuxième position dans le menu déroulant de sélection de la langue

source: Bug fixes
fr: Corrections de défauts
pt_br: Correção de bugs

source: Metadata download: Fix downloads from Google not working in Europe because of the GDPR
fr: Téléchargement de métadonnées : Corriger les téléchargements de Google qui ne fonctionnent pas en Europe à cause du RGPD

source: Fix editing dates with days sometimes off by one day
fr: Correction de l'édition des dates dont les jours sont parfois décalés d'un jour

source: Edit book: Fix highlighting for special characters not visible when the cursor is on the line with the special character
fr: Editer le livre : Correction de la mise en évidence des caractères spéciaux non visibles lorsque le curseur se trouve sur la ligne contenant le caractère spécial

source: Fix embedding metadata showing infinite error dialogs on windows if a file is locked by another program
fr: Correction de l'intégration de métadonnées affichant des boîtes de dialogue d'erreur infinies sous Windows si un fichier est verrouillé par un autre programme

source: PDF Output: Fix an error when trying to set header or footer with an input document that has invalid content after the main body
fr: Sortie PDF : Correction d'une erreur lors de la définition d'un en-tête ou d'un pied de page avec un document d'entrée dont le contenu est invalide après le corps principal

source: E-book viewer: Read aloud: Fix clicking on empty spaces causing read aloud to restart from beginning of chapter
fr: Visionneuse de livres numérique : Lecture à haute voix : Correction du clic sur les espaces vides provoquant le redémarrage de la lecture à haute voix au début du chapitre

source: Book details: Fix Manage authors via context menu not working
fr: Détails du livre : Correction de la gestion des auteurs via le menu contextuel ne fonctionnent pas

source: E-book viewer: Showing chrome should close an active footnote popup first and only show chrome if the user repeats the action
fr: Visionneuse de livres numérique : L'affichage de chrome doit d'abord fermer une fenêtre contextuelle de note de bas de page active et n'afficher chrome que si l'utilisateur répète l'action

source: Fix very slow metadata updates on some PDF files
fr: Correction des mises à jour très lentes des métadonnées sur certains fichiers PDF

source: Catalogs: Do not erase any tags the user adds to a catalog book entry when the catalog is re-generated
fr: Catalogues : Ne pas effacer les étiquettes ajoutées par l'utilisateur à une entrée du livre du catalogue lorsque le catalogue est généré à nouveau

source: Linux installer: Fix downloading of signatures for older versions
fr: Installateur Linux : Correction du téléchargement des signatures pour les anciennes versions

source: Fix editing non-active Virtual library changes sort of book list
fr: Correction de l'édition d'une bibliothèque virtuelle non active qui modifie le tri de la liste des livres

source: New news sources
fr: Nouvelles sources d'informations
pt_br: Novas fontes de notícias

source: {0} by {1}
fr: {0} par {1}
pt_br: {0} por {1}

source: Improved news sources
fr: Sources d'informations améliorées
pt_br: Fontes de notícias melhoradas

source: 20 Oct, 2023
fr: 20 octobre 2023

source: E-book viewer: Add a command line flag --new-instance to force the viewer to open a new window even if the option to always use a single viewer window is set
fr: Visionneuse de livres électroniques : Ajout d'un drapeau de ligne de commande --new-instance pour forcer la visionneuse à ouvrir une nouvelle fenêtre même si l'option de toujours utiliser une seule fenêtre de visualisation est activée

source: E-book viewer: Image popup: Add a checkbox to remember the last used zoom level
fr: Visionneuse de livres numériques : Fenêtre contextuelle d'image : Ajout d'une case à cocher pour mémoriser le dernier niveau de zoom utilisé

source: Annotations browser: Fix exporting highlights in markdown not including all chapter titles for books with only a single highlight per chapter or a multi level ToC
fr: Navigateur d'annotations : Correction de l'exportation des mise en évidence en Markdown n'incluant pas tous les titres de chapitres pour les livres avec un seul mise en évidence par chapitre ou une TdM à plusieurs niveaux

source: E-book viewer: Fix a regression that could cause the viewer to enter an infinite loop when displaying the result of a search that has only one match that is not found
fr: Visionneuse de livres numériques : Correction d'une régression pouvant entraîner une boucle infinie lors de l'affichage du résultat d'une recherche ne comportant qu'une seule correspondance non trouvée

source: E-book viewer: Fix the occasional search result being marked as not found even though it is found
fr: Visionneuse de livres numériques : Correction des résultats de recherche occasionnels marqués comme non trouvés alors qu'ils sont trouvés

source: TXTZ Output plugin: Only keep images if the text format is one that can reference images
fr: Plugin sortie TXTZ : Ne conserver les images que si le format de texte est un format qui peut faire référence à des images

source: TXTZ Output: Fix cover not being properly identified in the generated TXTZ metadata
fr: Sortie TXTZ : Correction de la couverture qui n'est pas correctement identifiée dans les métadonnées TXTZ générées

source: FB2 Input: Fix the "Annotations" section not showing up in the Table of Contents
fr: Entrée FB2 : Correction de la section « Annotations » qui n'apparaît pas dans la table des matières

source: Linux: Content server: Do not call listen on pre-activated sockets
fr: Linux : Serveur de contenu : Ne pas appeler listen sur des sockets pré-activées

source: Fix sort order of similarly-named hierarchical categories
fr: Fixer l'ordre de tri des catégories hiérarchiques portant le même nom

source: Fix a regression that broke reading of covers from HTMLZ and TXTZ files
fr: Correction d'une régression qui interrompait la lecture des couvertures des fichiers HTMLZ et TXTZ

source: 07 Oct, 2023
fr: 07 octobre 2023

source: Edit book: Show full path to book being edited in the status bar
fr: Éditer le livre : Afficher le chemin complet du livre en cours d'édition dans la barre d'état

source: Edit book: When adding dictionaries allow directly a LibreOffice adding the dictionary just by choosing the language
fr: Éditer le livre : Lors de l'ajout de dictionnaires, il est possible d'ajouter directement un dictionnaire LibreOffice en choisissant la langue

source: Edit book: When saving a copy add some convenience actions to edit the copy immediately either in the current editor window or a new window
fr: Éditer le livre : Lors de l'enregistrement d'une copie, ajoutez des actions pratiques pour éditer la copie immédiatement, soit dans la fenêtre courante de l'éditeur, soit dans une nouvelle fenêtre

source: E-book viewer: Highlights panel: Allow right clicking to export only selected highlights
fr: Visionneuse de livres numérique : Panneau des Mise en évidence : Possibilité de cliquer avec le bouton droit de la souris pour exporter uniquement les Mise en évidence sélectionnés

source: Edit book: Fix a regression in the previous release that caused Text search to sometimes not select matches correctly
fr: Éditer le livre : Correction d'une régression dans la version précédente qui faisait que la recherche de texte ne sélectionnait parfois pas correctement les correspondances

source: Edit book: When copying files do it in order so that the files are pasted in the same order when pasting into another editor instance
fr: Éditer le livre : Lorsque vous copiez des fichiers, le faire dans l'ordre afin que les fichiers soient collés dans le même ordre lorsqu'ils sont collés dans un autre éditeur

source: Edit book: Fix smart tag insert not working correctly if the selected text starts with the closing angle bracket of a tag
fr: Livre d'édition : Correction de l'insertion de balises intelligentes ne fonctionnant pas correctement si le texte sélectionné commence par l'angle de fermeture d'une balise

source: Save to disk: Do not limit the total path length to 240 characters on non-Windows platforms
fr: Enregistrer sur le disque : Ne pas limiter la longueur totale du chemin d'accès à 240 caractères sur les plates-formes non Windows

source: Fix incorrect cover for AZW3 version of calibre User Manual
fr: Correction d'une couverture incorrecte pour la version AZW3 du Manuel de l'Utilisateur calibre

source: Content server: Change formatting of book details to match new de-emphasized titles based formatting in the main calibre program
fr: Serveur de contenu : Modifier le formatage des détails des livres pour correspondre au nouveau formatage basé sur les titres sans emphase dans le programme principal de Calibre

source: PDF metadata: Fix a regression that broke updating metadata in PDF files without an /Info dictionary
fr: Métadonnées PDF : Correction d'une régression qui empêchait la mise à jour des métadonnées dans les fichiers PDF sans dictionnaire /Info

source: NOOK driver: For the Glowlight 2023 write the calibre metadata files into the NOOK sub-folder as the firmware does not allow writing files into the root folder
fr: Pilote NOOK : Pour le Glowlight 2023, écrire les fichiers de métadonnées calibre dans le sous-dossier NOOK car le firmware ne permet pas d'écrire des fichiers dans le dossier racine

source: NOOK driver: Fix Glowlight 2023 not being detected on Linux and macOS
fr: Pilote NOOK : Corriger la non-détection de la Glowlight 2023 sous Linux et macOS

source: E-book viewer: Make CFI calculation more robust especially on pages with very little content
fr: Visionneuse de livres numérique : Rendre le calcul de la FCI plus robuste, en particulier sur les pages à très faible contenu

source: E-book viewer: Workaround bug in Chromium where getBoundingClientRect() fails sometimes leading to incorrect calculation of anchor positions
fr: Visionneuse de livres numérique : Contournement d'un bogue dans Chromium où getBoundingClientRect() échoue parfois, entraînant un calcul incorrect de la position des ancres

source: Fix errors caused by .DS_Store files inserted into the .caltrash directory on macOS if the user happens to open .caltrash in Finder
fr: Correction des erreurs causées par les fichiers .DS_Store insérés dans le répertoire .caltrash sur macOS si l'utilisateur ouvre par hasard .caltrash dans le l'Explorateur

source: Version 6.28.1 fixes a regression in 6.28.0 that could cause errors when merging some book records in calibre
fr: La version 6.28.1 corrige une régression de la version 6.28.0 qui pouvait provoquer des erreurs lors de la fusion de certains livres dans Calibre

source: 22 Sep, 2023
fr: 22 septembre 2023

source: Kobo driver: Support updated firmware
fr: Pilote Kobo : Prise en charge du firmware mis à jour

source: Nook driver: Add support for Nook Glowlight Plus 2023
fr: Pilote Nook : Ajouter le support pour Nook Glowlight Plus 2023

source: Data files manager: Allow drag and drop of files onto the list of files to add new files
fr: Gestionnaire de fichiers de données : Permet de glisser-déposer des fichiers dans la liste des fichiers pour ajouter de nouveaux fichiers

source: Support 7z archives in addition to ZIP and RAR for automatic ebook extraction when adding to calibre
fr: Prise en charge des archives 7z en plus des archives ZIP et RAR pour l'extraction automatique des ebooks lors de l'ajout à calibre

source: Linux/macOS: Fix detection of the Kindle Scribe with MTP firmware
fr: Linux/macOS : Correction de la détection du Kindle Scribe avec le firmware MTP

source: E-book viewer: Allow clearing list of recently opened books from the open button's popup menu itself
fr: Visionneuse de livres numériques : Permettre d'effacer la liste des livres récemment ouverts à partir du menu contextuel du bouton d'ouverture lui-même

source: E-book viewer: Add a link to show the currently viewed book in the calibre library (Go to-&gt;Metadata in the viewer controls to access it)
fr: Visionneuse de livres numériques : Ajouter un lien pour afficher le livre actuellement consulté dans la bibliothèque calibre (Aller dans Métadonnées dans les contrôles de la visionneuse pour y accéder)

source: Book information dialog: Fix a regression that caused incorrect color for titles in dark mode
fr: Dialogue d'information sur les livres : Correction d'une régression qui provoquait une couleur incorrecte pour les titres en mode sombre

source: E-book viewer: Fix searching does not jump to first match if all matches are before current position in book
fr: Visionneuse de livres numériques : Correction de la recherche qui ne saute pas au premier résultat si tous les résultats sont antérieurs à la position actuelle dans le livre

source: EPUB Output: Fix duplicated title page entry in spine for books that define a title page that ends up getting split
fr: Sortie EPUB : Correction de la duplication de la page de titre dans le dos pour les livres qui définissent une page de titre qui finit par être divisée

source: Allow for-light/dark-theme icon overrides to work for plugin icons placed by the user in the override folder
fr: Permettre le remplacement des images des plugins placés dans le dossier "resources" la configuration utilisateur, de fonctionner avec les suffixe "for-light/for-dark-theme"

source: PDF Output: Fix background image + text not rendering correctly if the same background image is used with different text multiple times
fr: Sortie PDF : Correction de l'image d'arrière-plan + texte ne s'affichant pas correctement si la même image d'arrière-plan est utilisée avec un texte différent plusieurs fois

source: E-book viewer: Fix section titles in highlights panel being incorrectly expanded to full titles when the section has multiple highlights
fr: Visionneuse de livres numériques : Correction des titres de section dans le panneau des mise en évidences qui sont incorrectement développés en titres complets lorsque la section a plusieurs mise en évidences

source: Prevent Quickview window from opening in the background
fr: Empêcher l'ouverture de la fenêtre Affichage rapide en arrière-plan

source: Edit book: Fix a regression in the previous release that caused an error when doing text based searches
fr: Éditer le livre : Correction d'une régression dans la version précédente qui provoquait une erreur lors de recherches basées sur le texte

source: 08 Sep, 2023
fr: 08 septembre 2023

source: MTP driver: Support the new Kindle Scribe firmware that causes it to act as an MTP device instead of USB disk. Add "Documents" to the list of default folders to send books to
fr: Pilote MTP : Prise en charge du nouveau micrologiciel Kindle Scribe qui le fait agir comme un périphérique MTP au lieu d'un disque USB. Ajout de "Documents" à la liste des dossiers par défaut vers lesquels envoyer les livres

source: E-book viewer: Add a new option under scrolling behavior to control horizontal mouse wheel events jumping to next section
fr: Visionneuse de livres numérique : Ajout d'une nouvelle option sous le comportement de défilement pour contrôler les événements horizontaux de la roulette de la souris sautant à la section suivante

source: Allow full customization of Book details styling via Preferences-&gt;Look &amp; feel-&gt;Book details
fr: Permettre une personnalisation complète du style des détails du livre via Préférences-&gt;Apparence et présentation-&gt;Détails du livre

source: Get books: Update ebooks.com plugin for website changes
fr: Obtenir des livres : Mise à jour du plugin ebooks.com pour les modifications du site web

source: Edit book: Fix searching for non-BMP unicode characters highlighting only half the character
fr: Editer le livre : Correction de la recherche de caractères unicode non-BMP ne mettant en évidence que la moitié du caractère

source: E-book viewer: Fix displaying more than one page per screen causing page layout to be slightly wrong for some books
fr: Visionneuse de livres numérique : Correction de l'affichage de plus d'une page par écran, ce qui entraîne une légère erreur de mise en page pour certains livres

source: E-book viewer: Fix clicking on links with empty destinations hanging the viewer
fr: Visionneuse de livres numérique : Correction du clic sur des liens avec des destinations vides qui suspendent la visionneuse

source: E-book viewer: Fix modifying, then jumping to and then modifying the highlight again from the highlights panel causing the highlight to be deleted
fr: Visionneuse de livres numérique : Correction de la modification, puis du saut et de la modification de la mise en évidence à partir du panneau des mises en évidence, entraînant la suppression de la mise en évidence

source: E-book viewer: Fix indication of current section in Table of Contents sometimes wrong after changing font size
fr: Visionneuse de livres numérique : Correction de l'indication de la section courante dans la table des matières, parfois erronée après un changement de taille de police

source: E-book viewer/Content server: Disallow browser native context menu when right clicking in sandboxed iframes
fr: Visionneuse de livres numérique/Serveur de contenu : Désactiver le menu contextuel natif du navigateur lors d'un clic droit dans les iframes sandboxées

source: MTP driver: Ignore top level folders whose names start with a leading dot Also ignore AppleDouble files, top level system and fonts folders and sdr folders on Kindle devices
fr: Pilote MTP : Ignorer les dossiers de premier niveau dont le nom commence par un point. Ignorer également les fichiers AppleDouble, les dossiers système et polices de premier niveau et les dossiers sdr sur les appareils Kindle

source: FB2 Input: use the &lt;p&gt; tag for paragraphs that dont contain other block content
fr: FB2 Input : utiliser la balise &lt;p&gt ; pour les paragraphes qui ne contiennent pas d'autres blocs de contenu

source: E-book viewer: Fix clicking on the back/forward buttons not working in some situations
fr: Visionneuse de livres numérique : Correction du fait que cliquer sur les boutons de retour/avancer ne fonctionne pas dans certaines situations

source: E-book viewer: Fix scrolling to Table of Contents items that are within a single internal file not activating the back button
fr: Visionneuse de livres numérique : Correction du fait que le défilement vers des éléments de la table des matières qui se trouvent dans un seul fichier interne n'active pas le bouton retour

source: E-book viewer: Fix changing the sans-serif font without also changing the monospaced font not working
fr: Visionneuse de livres numérique : Fixer le changement de la police sans-serif sans changer également la police monospaced ne fonctionnent pas

source: 18 Aug, 2023
fr: 18 août 2023
pt_br: 18 de Agosto de 2023

source: Book details panel: De-emphasize titles making the actual data stand out more
fr: Panneau de détails du livre : Réduction de l'emphase sur les titres pour mieux faire ressortir les données réelles
pt_br: Painel de Detalhes do livro: Desenfatiza os títulos, tornando os dados reais se destacarem mais

source: Allow using the new manage data files dialog from within the edit metadata dialog
fr: Permettre l'utilisation de la nouvelle boîte de dialogue de gestion des fichiers de données à partir de la boîte de dialogue d'édition des métadonnées
pt_br: Permite usar o novo diálogo de gerenciamento de arquivos extras a partir do diálogo de edição de metadados

source: Trash dialog: Allow right clicking on an entry to save it to disk
fr: Boîte de dialogue de la corbeille : Permettre, en cliquant avec le bouton droit de la souris sur une entrée, d'enregistrer sur le disque
pt_br: Janela da Lixeira: Permite clicar com o botão direito em uma entrada e salvá-la no disco

source: When merging books by drag-and-drop add an option to use the dragged cover instead of the cover in the target book
fr: Lors de la fusion de livres par glisser-déposer, ajouter une option permettant d'utiliser la couverture glissée au lieu de la couverture du livre cible
pt_br: Ao mesclar livros com arrastar-e-soltar, adiciona uma opção para usar a capa do livro arrastado em vez da capa do livro alvo

source: Create catalog: Add buttons to easily select all/non/visible fields when creating CSV/XML catalogs
fr: Créer un catalogue : Ajout de boutons permettant de sélectionner facilement tous les champs/non visibles/visibles lors de la création de catalogues CSV/XML
pt_br: Criar catálogo: Adiciona botões para facilmente selecionar os campos todos/nenhum/visíveis, ao criar catálogos CSV/XML

source: Preferences-&gt;Add your own columns: Add buttons to show/hide all columns
fr: Préférences-&gt;Ajoutez vos propres colonnes : Ajouter des boutons pour afficher/masquer toutes les colonnes
pt_br: Preferências-&gt;Adicione suas próprias colunas: Adiciona botões para mostrar/ocultar todas as colunas

source: Fix a regression in the previous release that broke parsing of some ISO-8601 timestamps
fr: Correction d'une régression dans la version précédente qui cassait l'analyse de certains horodatages ISO-8601
pt_br: Corrige uma regressão na versão anterior que danificou o processamento de alguns carimbos de data ISO-8601

source: E-book viewer: Mouse wheel horizontal events should jump sections not internal file boundaries
fr: Visionneuse de livres numérique : Les événements horizontaux de la molette de la souris doivent sauter des sections et non les limites de fichiers internes
pt_br: Visualizador de e-books: Eventos da roda horizontal do mouse devem saltar seções, e não limites de arquivos internos

source: Fix Preferences-&gt;Add your own columns changing check state on moving columns
fr: Fixer Préférences-&gt;Ajouter vos propres colonnes, modifier l'état de vérification lors du déplacement des colonnes
pt_br: Corrige Preferências-&gt;Adicione suas próprias colunas alterando os itens marcados ao mover colunas
