Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Edit metadata dialog: Allow controlling which custom columns are present in this dialog via Preferences-&gt;Look &amp; feel-&gt;Edit metadata
fr: Dialogue d'édition des métadonnées : Permettre de contrôler quelles colonnes personnalisées sont présentes dans cette boîte de dialogue via Préférences-&gt;Apparence &amp ; présentation-&gt;Editer les métadonnées

source: Edit metadata dialog: Allow manually sizing the various sections of the dialog in "All on 1 tab" mode
fr: Boîte de dialogue d'édition des métadonnées : Permettre de dimensionner manuellement les différentes sections de la boîte de dialogue en mode "Tout sur 1 onglet".

source: Edit book: Spell checking: Update the bundled English and Spanish dictionaries
fr: Éditer le livre : Vérification de l'orthographe : Mise à jour des dictionnaires anglais et espagnol fournis avec le livre

source: BibTeX catalogs: Support tags like custom columns
fr: Catalogues BibTeX : Prise en charge des balises comme les colonnes personnalisées

source: Amazon metadata download: Fix paragraphs in the comments being merged
fr: Téléchargement des métadonnées Amazon : Correction des paragraphes dans les commentaires en cours de fusion

source: Amazon.de metadata download: Fix published date and series information not being fetched for some books
fr: Téléchargement des métadonnées Amazon.de : Correction de la date de publication et des informations sur la série qui ne sont pas récupérées pour certains livres

source: Email delivery: Fix sending email via Hotmail not working since this week because Microsoft changed the SMTP server name
fr: Envoi d'e-mails : Correction de l'envoi d'email via Hotmail ne fonctionne pas depuis cette semaine car Microsoft a changé le nom du serveur SMTP

source: Do not remove articles for titles in the Polish language
fr: Ne pas supprimer les articles pour les titres en langue polonaise

source: E-book viewer: When using Read aloud do not automatically lookup the highlighted word until read aloud is paused or stopped
fr: Visionneuse de livres numériques : Lors de l'utilisation de la lecture à voix haute, la recherche automatique du mot mis en évidence ne se fait pas tant que la lecture à voix haute n'est pas suspendue ou arrêtée

source: E-book viewer: Fix Ctrl+P shortcut for printing not working
fr: Visionneuse de livres numériques : Correction du raccourci Ctrl+P pour l'impression, qui ne fonctionnait pas

source: Show an error when viewing a specific format and the file is missing
fr: Afficher une erreur lors de l'affichage d'un format spécifique et que le fichier est manquant

source: Edit book: Fix renaming of classes that start/end with non word characters not working
fr: Éditer le livre : Correction du renommage des classes qui commencent/se terminent par des caractères non verbaux qui ne fonctionnait pas

source: Edit book: Preview panel: Fix hyphenation at end of line being rendered as boxes on macOS
fr: Éditer le livre : Panneau de prévisualisation : Correction des césures en fin de ligne qui sont rendues sous forme d'encadrés sur macOS

source: Fix incorrect selection size displayed in Trim image dialog when image is scaled down to fit
fr: Correction de la taille de sélection incorrecte affichée dans la boîte de dialogue Découper l'image lorsque l'image est réduite pour être adaptée

source: Edit book: Fix pasting files from another editor instance failing if a file with the same name already exists
fr: Éditer le livre : Correction du collage de fichiers à partir d'une autre instance de l'éditeur qui échoue si un fichier avec le même nom existe déjà

source: When reviewing metadata if the newly downloaded metadata has no language but there is an existing language, ensure it is preserved
fr: Lors de la révision des métadonnées, si les métadonnées nouvellement téléchargées n'ont pas de langue mais qu'il existe une langue existante, s'assurer qu'elle soit préservée

source: 21 Jan, 2022
fr: 21 janvier 2022

source: Coloring/icon rules: Allow creating a rule for date columns that matches *today*
fr: Règles de coloration/icônes : Permettre la création d'une règle pour les colonnes de date qui correspondent à *aujourd'hui*.

source: Content server: Show total number of results when searching for books
fr: Serveur de contenu : Afficher le nombre total de résultats lors de la recherche de livres

source: E-book viewer: Fix searching for text near the end of a chapter sometimes not working
fr: Visionneuse de livres numériques : Correction de la recherche de texte vers la fin d'un chapitre qui ne fonctionne pas toujours
pt_br: Visualizador de e-books: Corrige a pesquisa por texto perto do final dos capítulos às vezes não funcionando

source: E-book viewer: Fix auto hyphenation on macOS not rendering the hyphens correctly
fr: Visionneuse de livres numériques :Correction de la césure automatique sur macOS qui ne rend pas les traits d'union correctement

source: Edit book: Reports: Fix thumbnails of SVG images not rendered
fr: Editer le livre : Rapports : Correction des vignettes des images SVG qui n'étaient pas restituées

source: ODT metadata: Support reading tags from multiple &lt;keyword&gt; elements
fr: Métadonnées ODT : Prise en charge de la lecture des balises de plusieurs éléments de type &lt;mot-clé&gt;.

source: LRF Input: Fix a regression in calibre 5 that broke parsing of some LRF files
fr: Format LRF en entrée : Correction d'une régression dans calibre 5 qui empêchait l'analyse de certains fichiers LRF

source: MOBI output: Don't fail if input document contains invalid % based lengths
fr: Format MOBI en sortie : Pas d'échec si le document d'entrée contient des longueurs non valides basées sur des %

source: AZW3 Input: Handle AZW3 files with incorrect TAGX Offset INDX header fields
fr: Format AZW3 en entrée : Gérer les fichiers AZW3 avec des champs d'en-tête TAGX Offset INDX incorrects

source: Comic conversion: Fix conversion of comic images that are stored as grayscale images in JPEG format not working when converting to PDF with image processing turned off
fr: Conversion des bandes dessinées : Correction de la conversion des images de bandes dessinées qui sont stockées en tant qu'images en niveaux de gris au format JPEG et qui ne fonctionnent pas lors de la conversion en PDF lorsque le traitement des images est désactivé

source: calibredb catalog: Fix --ids and --search options not working for CSV/XML catalogs
fr: Catalogue calibredb : Correction des options --ids et --search qui ne fonctionnent pas pour les catalogues CSV/XML

source: Tag browser: Fix the find box not using all available width
fr: Explorateur d'étiquettes : Correction de la boîte de recherche qui n'utilise pas toute la largeur disponible

source: E-book viewer: Remove books that do not exist from the recently opened book list
fr: Visionneuse de livres numériques : Suppression des livres qui n'existent pas dans la liste des livres récemment ouverts
pt_br: Visualizador de e-books: Remove livros inexistentes da lista de livros abertos recentemente

source: Completion popups: Fix display of items containing line breaks
fr: Popups d'achèvement : Correction de l'affichage des éléments contenant des sauts de ligne

source: Fix line breaks in custom column descriptions not being rendered in their tooltips
fr: Correction des sauts de ligne dans les descriptions de colonnes personnalisées qui ne sont pas restituées dans leurs infobulles

source: Fix Preferences-&gt;Searching-&gt;Clear search histories not taking effect till a restart for some search boxes
fr: Correction de Préférences-&gt;Recherche-&gt;Effacement des historiques de recherche ne prend effet qu'après un redémarrage pour certaines boîtes de recherche

source: Hierarchical entries in user category may not merge correctly in tag browser
fr: Les entrées hiérarchiques dans la catégorie utilisateur peuvent ne pas fusionner correctement dans le navigateur de balises

source: 17 Dec, 2021
fr: 17 décembre 2021
pt_br: 17 de Dezembro de 2021

source: Happy holidays to everyone!
fr: Joyeuses Fêtes à tout le monde !
pt_br: Boas festas a todos!

source: Driver for the new Nook Glowlight 4
fr: Pilote pour le nouveau Nook Glowlight 4
pt_br: Driver para o novo Nook Glowlight 4

source: Edit book: Spell check tool: Add an exclude files button to exclude some files from being checked
fr: Éditer le livre : Outil de vérification orthographique : Ajout d'un bouton "exclure les fichiers" pour exclure certains fichiers de la vérification
pt_br: Editar livro: Ferramenta de verificação ortográfica: Adiciona um botão para excluir arquivos da verificação

source: EPUB/MOBI Catalogs: Increase the maximum thumbnail size to 3 inches from 2 inches
fr: Catalogues EPUB/MOBI : Augmentation de la taille maximale des vignettes de 2 à 3 pouces.
pt_br: Catálogos EPUB/MOBI: Aumenta o tamanho máximo de miniaturas de 2 para 3 polegadas

source: Allow creating a shortcut in Preferences-&gt;Shortcuts-&gt;Edit metadata to paste metadata ignoring the value of the exclude_fields tweak
fr: Permettre la création d'un raccourci dans Préférences-&gt;Raccourcis-&gt;Modifier les métadonnées pour coller les métadonnées en ignorant la valeur de l'ajustement exclude_fields
pt_br: Permite a criação de um atalho em Preferências-&gt;Atalhos-&gt;Editar metadados para colar metadados ignorando o valor do ajuste exclude_fields

source: E-book viewer: Displays links marked up as glossary and bibliography links as popups
fr: Visionneuse de livres numériques : Afficher les liens marqués comme glossaire et bibliographie sous forme de fenêtres contextuelles
pt_br: Visualizador de e-books: Exibe como popups links marcados como entradas de glossário e bibliografia.

source: Add a tweak in Preferences-&gt;Tweaks to provide the sort value for undefined numbers
fr: Ajout d'un ajustement dans Préférences-&gt;Ajustements pour fournir la valeur de tri pour les nombres non définis
pt_br: Adiciona um ajuste em Preferências-&gt;Ajustes para fornecer um valor para a ordenação de números indefinidos

source: Edit book: Fix pressing F8 to jump to next misspelled word not working after last word in current file
fr: Éditer le livre : Correction de l'appui sur F8 pour passer au mot mal orthographié suivant ne fonctionnant pas après le dernier mot du fichier actuel
pt_br: Editar livro: Corrige o uso de F8 para saltar para a próxima palavra incorreta não funcionando após a última palavra do arquivo atual

source: Fix PDB E-reader output broken in calibre 5
fr: Correction du format PDB E-reader en sortie endommagé dans calibre 5
pt_br: Corrige saída PDB E-reader danificada no calibre 5

source: Edit book: Reports: Include descendant selectors that use classes when counting class usage
fr: Editer le livre : Rapports : Inclure les sélecteurs descendants qui utilisent des classes lors du comptage de l'utilisation des classes
pt_br: Editar livro: Relatórios: Inclui seletores descendentes que usam classes ao contar o uso de classes

source: E-book viewer: Fix an error when opening some books with highlights that span in-line text formatting
fr: Visionneuse de livres numériques : Correction d'une erreur lors de l'ouverture de certains livres avec des mises en évidence qui couvrent le formatage du texte en ligne
pt_br: Visualizador de e-books: Corrige um error ao abrir alguns livros com destaques que possuem formatação de texto na própria linha

source: MTP driver: Do not send the calibre device db files to the root folder on the Supernote A5 x as it fails
fr: Pilote MTP : Ne pas envoyer les fichiers db du périphérique calibre vers le dossier racine sur le Supernote A5 x car il échoue

source: ToC Editor: Workaround an occasional error when closing on Windows if the file being edited is in a DropBox/antivirus prone folder
fr: Éditeur de TdM : Résolution d'une erreur occasionnelle lors de la fermeture sous Windows si le fichier en cours d'édition se trouve dans un dossier DropBox/antivirus

source: Fix a regression in the previous release that broke creating new keyboard shortcuts
fr: Correction d'une régression dans la version précédente qui empêchait la création de nouveaux raccourcis clavier

source: Comments editor: When flowing the tool bar onto multiple lines do not split up groups of buttons
fr: Éditeur de commentaires : Lorsque la barre d'outils est répartie sur plusieurs lignes, les groupes de boutons ne sont pas divisés

source: Various compatibility fixes for Python 3.10 used by some Linux distributions
fr: Diverses corrections de compatibilité pour Python 3.10 utilisé par certaines distributions Linux

source: 03 Dec, 2021
fr: 03 décembre 2021

source: Allow changing the icon used for calibre libraries. Right click the library icon in calibre and choose "Change the icon for this library"
fr: Permettre de changer l'icône utilisée pour les bibliothèques de calibre. Faites un clic droit sur l'icône de la bibliothèque dans calibre et choisir "Changer l'icône de cette bibliothèque".
pt_br: Permitir alteração de ícone usado para bibliotecas calibre. No calibre, clique com o botão direito no ícone da biblioteca e escolha "Alterar o ícone desta biblioteca"

source: Comments editor: Use a single line for all three toolbars if they fit
fr: Éditeur de commentaires : Utilisation d'une seule ligne pour les trois barres d'outils, si elles sont adaptées.

source: Edit book: Allow merging HTML files by drag and drop of the files onto another HTML file
fr: Editer le livre : Permettre de fusionner des fichiers HTML par glisser-déposer des fichiers sur un autre fichier HTML

source: Kobo driver: Add support for listing purchased audiobooks
fr: Pilote Kobo : Ajout de la prise en charge de la liste des livres audio achetés

source: Edit metadata all-in-one mode: The cover and formats column now gives as much vertical space as possible to the cover image
fr: Mode d'édition des métadonnées tout-en-un : La colonne des couvertures et des formats donne désormais autant d'espace vertical que possible à l'image de couverture

source: Add books dialog: When a non-book file type is added the next time the dialog is used, preselect the "All files" filter
fr: Boîte de dialogue Ajouter des livres : Lorsqu'un type de fichier autre qu'un livre est ajouté lors de la prochaine utilisation de la boîte de dialogue, présélectionner le filtre "Tous les fichiers".

source: calibre-server --manage-users: Allow managing users while the server is running and also add actions to automate changing user account restrictions
fr: calibre-server --manage-users : Permettre de gérer les utilisateurs pendant que le serveur est en cours d'exécution et ajoute également des actions pour automatiser la modification des restrictions des comptes utilisateurs

source: EPUB 3 metadata: If the book contains a "subtitle" append it to the main title when reading metadata
fr: Métadonnées EPUB 3 : Si le livre contient un "sous-titre", il est ajouté au titre principal lors de la lecture des métadonnées.

source: E-book viewer: Fix an occasional hang on startup at "Loading section"
fr: Visionneuse de livres numériques : Correction d'un blocage occasionnel au démarrage à "Chargement de la section".

source: Get books: Update the Kobo plugin for website changes
fr: Obtenir des livres : Mise à jour de l'extension Kobo en raison de changements sur le site web

source: Bulk edit metadata dialog: Fix changing the search mode resetting other fields
fr: Boîte de dialogue d'édition en masse des métadonnées : Correction du changement du mode de recherche réinitialisant les autres champs

source: E-book viewer: Fix sorting of highlights incorrect in books that use HTML ids with a hyphen in them
fr: Visionneuse de livres numériques : Correction du tri incorrect des mises en évidence dans les livres qui utilisent des identifiants HTML contenant un trait d'union

source: PDF Output: Fix the option to break long words at the ends of lines causing boxes to be rendered at the end of the line on macOS with some fonts
fr: Format PDF en sortie : Correction de l'option permettant d'interrompre les mots longs en fin de ligne, ce qui entraîne l'affichage de cases en fin de ligne sous macOS avec certaines polices

source: Google metadata plugin: When searching by ISBN if no results are found retry using an alternate query syntax
fr: Plugin de métadonnées Google : Lors d'une recherche par ISBN, si aucun résultat n'est trouvé, réessaye en utilisant une autre syntaxe de requête

source: 5.33.2 fixes a couple of regressions that broke the toolbar in the popup comments editor dialog and rendering of the download metadata button in the edit metadata dialog on Windows, as well as reading files from MTP devices on Windows
fr: La version 5.33.2 corrige deux régressions qui entraînaient la défaillance de la barre d'outils dans la boîte de dialogue contextuelle de l'éditeur de commentaires et du rendu du bouton de téléchargement des métadonnées dans la boîte de dialogue d'édition des métadonnées sous Windows, ainsi que de la lecture des fichiers à partir de périphériques MTP sous Windows.

source: 12 Nov, 2021
fr: 12 novembre 2021
pt_br: 12 de Novembro de 2021

source: Edit book: Add a tool to transform HTML tags based on rules (Tools-&gt;Transform HTML)
fr: Éditer le livre : Ajout d'un outil pour transformer les balises HTML en fonction de règles (Outils-&gt;Transformer le HTML)

source: Allows for making transformations such as changing one html tag to another, deleting tags, wrapping them in another tag, etc. Also available during conversions via the Look &amp; feel-&gt;Transform HTML section of the conversion dialog.
fr: Permettre d'effectuer des transformations telles que le remplacement d'une balise html par une autre, la suppression de balises, leur insertion dans une autre balise, etc. Également disponible pendant les conversions via la section Apparence&amp ; visualisation-&gt;Transformer le HTML de la boîte de dialogue de conversion.

source: Driver for the new Tolino Vision 6
fr: Pilote pour la nouvelle Tolino Vision 6
pt_br: Driver para o novo Tolino Vision 6

source: Kobo driver: Add support for the latest firmware released last week
fr: Pilote Kobo : Ajout de la prise en charge de la nouvelle version du firmware sorti la semaine passée
pt_br: Driver do Kobo: Adiciona suporte para o último firmware lançado na última semana

source: When picking a random book ensure recently chosen books are not re-selected
fr: Lors du choix d'un livre au hasard, s'assure que les livres récemment choisis ne sont pas re-sélectionnés
pt_br: Ao escolher um livro aleatório, garantir que livros recentemente escolhidos não sejam selecionados novamente

source: Icon theme chooser dialog: Allow right clicking on a theme to visit its homepage
fr: Boîte de dialogue de sélection des thèmes par icônes : Permettre un clic droit sur un thème pour visiter sa page d'accueil
pt_br: Diálogo de escolha de temas: Permite clicar com o botão direito em um tema para visitar sua página inicial

source: Amazon metadata download: Add support for more markup variations in amazon's sites that could prevent the fetching of ratings, comments and series metadata for some books
fr: Téléchargement des métadonnées Amazon : Ajout de la prise en charge d'un plus grand nombre de variations de balisage sur les sites d'Amazon qui pourraient empêcher la récupération des évaluations, des commentaires et des métadonnées de série pour certains livres
pt_br: Download de metadados da Amazon: Adiciona suporte para mais variações de marcação nos sites da Amazon que poderia impedir a obtenção de avaliações, comentários e série para alguns livros

source: Google search: Add support for new beta search results page markup that was preventing using cached Google pages to search for Amazon metadata
fr: Recherche Google : Ajout de la prise en charge du nouveau balisage de la page de résultats de recherche bêta qui empêchait l'utilisation des pages Google en cache pour la recherche de métadonnées Amazon
pt_br: Pesquisa do Google: Adiciona suporte para a nova marcação da página de resultados beta, que estava impedindo a utilização de páginas do cache do Google para pesquisar metadados da Amazon

source: PDF Output: Fix the option to preserve cover aspect ratio being ignored when converting comics
fr: Format PDF en sortie : Correction de l'option de préservation du rapport d'aspect de la couverture qui est ignorée lors de la conversion des bandes dessinées
pt_br: Saída PDF: Corrige a opção de preservar a taxa de aspecto da capa sendo ignorada ao converter quadrinhos

source: DOCX Input: Sanitize image filenames more strictly to workaround broken EPUB software
fr: Format DOCX en entrée : Nettoyage plus strict des noms de fichiers d'image afin de contourner les logiciels EPUB défectueux
pt_br: Entrada DOCX: Limpa nomes de imagens de maneira mais restritiva para contornar problemas com leitores de EPUB danificados

source: Linux binary: Fix file dialogs not working on Fedora 35 under KDE
fr: Linux binary : Correction des boîtes de dialogue de fichiers ne fonctionnant pas sur Fedora 35 sous KDE
pt_br: Binários do Linux: Corrige diálogos de arquivos não funcionando no Fedora 35 sob o KDE

source: When sending email to the Kindle and PocketBook sync services use ASCII filenames as there have been some reports of issues with non-ASCII filenames with these services.
fr: Lors de l'envoi des courriels aux services de synchronisation Kindle et PocketBook, utilisation des noms de fichiers ASCII, car certains rapports font état de problèmes avec des noms de fichiers non ASCII avec ces services.
pt_br: Ao enviar e-mails para os serviços de sincronização do Kindle e PocketBook, utiliza nomes de arquivos ASCII, uma vez que houveram alguns relatos de problemas com nomes de arquivos não ASCII com estes serviços.

source: Book Details: Fix missing copy options on composite columns
fr: Détails du livre : Correction des options de copie manquantes sur les colonnes composées
pt_br: Detalhes do livro: Corrige ausência de opções de cópia em colunas compostas

source: Ask for confirmation when deleting covers from books
fr: Demander une confirmation lors de la suppression de couvertures de livres
pt_br: Solicita confirmação ao apagar capas de livros

source: 29 Oct, 2021
fr: 29 octobre 2021
pt_br: 29 de Outubro de 2021

source: Kindle driver: Support the new Kindle PaperWhite 2021
fr: Pilote Kindle : Prise en charge de la nouvelle Kindle Paperwhite 2021
pt_br: Driver do Kindle: Suporte para o novo Kindle PaperWhite 2021

source: Add an option under Preferences-&gt;Behavior to have calibre recognize numbers when sorting (this was previously under Preferences-&gt;Tweaks)
fr: Ajout d'une option sous Préférences-&gt;Comportement pour que calibre reconnaisse les nombres lors du tri (ceci était précédemment sous Préférences-&gt;Ajustements)
pt_br: Adiciona uma opção sob Preferências-&gt;Comportamento para que o calibre reconheça números ao ordenar (isto estava previamente sob Preferências-&gt;Ajustes)

source: E-book viewer: Add a button to directly open the viewer help section in the calibre user manual to the viewer controls
fr: Visionneuse de livres numériques : Ajout d'un bouton, permettant d'ouvrir directement la section d'aide de la visionneuse dans le manuel d'utilisation de Calibre, aux contrôles de la visionneuse.
pt_br: Visualizador de e-books: Adiciona um botão nos controles do visualizador para abrir diretamente a seção de ajuda no manual do usuário do calibre
