Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: E-book viewer: Prevent the display from sleeping when using auto-scroll or read aloud modes (Implemented only on Windows and macOS)
fr: Visionneuse de livres numériques : Empêcher l'affichage de se mettre en veille lors de l'utilisation des modes de défilement automatique ou de lecture à voix haute (mis en œuvre uniquement sur Windows et macOS)
pt_br: Visualizador de e-books: Impede que o monitor entre em suspensão ao usar os modos de auto rolagem ou leitura em voz alta (implementado apenas no Window e macOS)

source: Edit book: Set semantics tool: Add support for EPUB 3 landmarks
fr: Editer le livre : Définir l'outil sémantique : Ajouter la prise en charge des points de repère EPUB 3
pt_br: Editar livros: Ferramenta Definir Semântica: Adiciona suporte para Landmarks do EPUB 3

source: Add an entry to the Connect/share menu to open the content server in a local browser when it is running
fr: Ajout d'une entrée au menu Connecter/partager pour ouvrir le serveur de contenu dans un navigateur local lorsqu'il est en cours d'exécution
pt_br: Adiciona uma entrada ao menu Conectar/compartilhar para abrir o servidor de conteúdo em um navegador local quando estiver sendo executado

source: Content server: Fix some OPDS feeds failing with non-ASCII content
fr: Serveur de contenu : Correction de certains flux OPDS échouant avec du contenu non-ASCII
pt_br: Servidor de conteúdo: Corrige alguns fedds OPDS falhando com conteúdo não ASCII

source: Tag browser: Fix incorrect first letter partitioning when enabling numeric collation of items that start with a number
fr: Navigateur d'étiquettes : Correction d'une partition incorrecte de la première lettre lors de l'activation de la collation numérique des éléments commençant par un chiffre
pt_br: Navegador de etiquetas: Corrige o particionamento incorreto da primeira letra ao ativar o agrupamento numérico de itens que começam com um número

source: 5.31.1 fixes a bug in an HTML serialization library calibre uses that broke a few things, such as the comments editor tool in the metadata dialog
fr: La version 5.31.1 corrige un bogue dans une bibliothèque de sérialisation HTML utilisée par calibre, qui provoquait la rupture de certains éléments, comme l'outil d'édition des commentaires dans la boîte de dialogue des métadonnées
pt_br: 5.31.1 corrige um erro na biblioteca de serialização HTML que o calibre utiliza, que danificou algumas coisas, como a ferramenta editor de comentários no diálogo de metadados

source: 22 Oct, 2021
fr: 22 octobre 2021
pt_br: 22 de Outubro de 2021

source: Add support for the new Kobo Sage and Libra 2 e-book reader devices
fr: Ajout de la prise en charge des nouveaux lecteurs de livres numériques Kobo Sage et Libra 2.
pt_br: Adiciona suporte para os novos dispositivos de leitura de e-books Kobo Sage e Libra 2

source: E-book viewer: Read aloud: Allow right clicking to play/pause reading
fr: Visionneuse de livres numériques : Lecture à voix haute : Possibilité de cliquer avec le bouton droit de la souris pour lire ou interrompre la lecture
pt_br: Visualizador de e-books: Leitura em voz alta: Permite clicar com o botão direito para iniciar/pausar a leitura

source: Sending books by e-mail: Preserve non-English characters in attached filenames
fr: Envoi de livres numériques par courrier électronique : Préserver les caractères non anglais dans les noms de fichiers attachés
pt_br: Envio de livros por e-mail: Preserva caracteres não Ingleses em nomes de arquivos anexados

source: Tag browser: Allow searching for sub-categories by right clicking on them
fr: Explorateur d'étiquettes : Permettre la recherche de sous-catégories par un clic droit sur celles-ci
pt_br: Navegador de etiquetas: Permite buscar subcategorias ao clicá-las com o botão direito

source: E-book viewer: Fix cover and full screen images not centered in paged mode when more than one page is displayed per screen
fr: Visionneuse de livres numériques : Correction des images de couverture et de plein écran qui ne sont pas centrées en mode page lorsque plus d'une page est affichée par écran
pt_br: Visualizador d e-books: Corrige imagens de capa e de tela inteira não centralizadas no modo paginado quando mais de uma página é exibida por tela

source: ToC Editor: Ignore in succession clicks on the OK and Cancel buttons to avoid accidentally closing the window when finishing creating a new entry
fr: Éditeur de TdM : Ignorer les clics successifs sur les boutons OK et Annuler pour éviter de fermer accidentellement la fenêtre à la fin de la création d'une nouvelle entrée
pt_br: Editor de Índice: Ignora cliques em sucessão nos botões OK e Cancelar, para evitar o fechamento acidental da janela ao finalizar a criação de uma nova entrada

source: Comments editor: Fix the formatting buttons not showing the current state correctly and fix some keyboard shortcuts not working when more than one comments editor is present in a single window
fr: Éditeur de commentaires : Correction des boutons de formatage qui n'affichent pas correctement l'état actuel et correction de certains raccourcis clavier qui ne fonctionnent pas lorsque plus d'un éditeur de commentaires est présent dans une seule fenêtre
pt_br: Editor de comentários: Corrige os botões de formatação não exibindo o estado atual corretamente e corrige alguns atalhos de teclado não funcionando quando mais de um editor de comentários está presente em uma mesma janela

source: Tag browser: Fix renaming of User categories in Virtual libraries
fr: Explorateur d'étiquettes : Correction du renommage des Catégories utilisateurs dans les Bibliothèques virtuelles
pt_br: Navegador de etiquetas: Corrige renomeação de Categorias do usuário em Bibliotecas virtuais

source: Make removing large numbers of custom column icons easier
fr: Faciliter la suppression d'un grand nombre d'icônes de colonnes personnalisées
pt_br: Torna a remoção de um grande número de ícones de colunas personalizadas mais fácil

source: 08 Oct, 2021
fr: 08 octobre 2021
pt_br: 08 de Outubro de 2021

source: Allow drag and drop of books onto formats in the Tag browser to convert them to that format
fr: Permettre le glisser-déposer de livres sur des formats dans l'Explorateur d'étiquettes pour les convertir dans ce format
pt_br: Permite arrastar e soltar livros em formatos no Navegador de etiquetas para convertê-los para aquele formato

source: Allow creating sorts based on multiple columns (Add the Sort action to the toolbar via Preferences-&gt;Toolbars &amp; menus)
fr: Permettre de créer des tris basés sur plusieurs colonnes (ajout de l'action Trier à la barre d'outils via Préférences-&gt;Barres d'outils &amp; menus)
pt_br: Permite a criação de ordenações baseadas em múltiplas colunas (Adiciona a ação de Ordenar à barra de ferramentas via Preferências-&gt;Barra de ferramentas &amp; menus)

source: Edit book: When changing a paragraph to a heading if the cursor is adjacent to a paragraph tag but not inside any tags other than body, use the adjacent tag
fr: Éditer le livre : Lors de la transformation d'un paragraphe en titre, si le curseur est adjacent à une balise de paragraphe mais pas à l'intérieur d'une balise autre que body, utiliser la balise adjacente
pt_br: Editar livro: Ao alterar um parágrafo para um título, se o cursor estiver numa posição adjacente a uma tag de parágrafo mas não estiver dentro de nenhuma tag além de body, usa a tag adjacente

source: Auto adding: Run relevant plugins before reading metadata from the book. Matches behavior of manual adding
fr: Ajout automatique : Exécute les plugins pertinents avant de lire les métadonnées du livre. Correspond au comportement de l'ajout manuel
pt_br: Auto adição: Executa os plugins relevantes antes de ler os metadados do livro. Corresponde ao comportamento da adição manual

source: Content server: Fix category collapse by partition not working
fr: Serveur de contenu : Correction de la réduction des catégories par partition qui ne fonctionne pas
pt_br: Servidor de conteúdo: Corrige colapso de categoria por particionamento não funcionando

source: Prevent Tab from causing focus to leave the Tag browser
fr: Empêcher qu'une tabulation ne fasse quitter l'Explorateur d'étiquettes
pt_br: Impede que a tecla Tab faça com que o foco saia do Navegador de etiquetas

source: Edit book: See what changed: Fix non-BMP unicode characters causing highlighting of changed words to be slightly misplaced
fr: Éditer le livre : Voir ce qui a changé : Correction des caractères unicode non-BMP qui font que la mise en évidence des mots modifiés est légèrement déplacée
pt_br: Editar livro: Veja o que foi alterado: Corrige caracteres não BMP unicode fazendo com que o destaque de palavras alteradas estivesse ligeiramente deslocado

source: PDF Output: Fix a regression that broke conversion of comics that contain 1-bit images
fr: Format PDF en sortie : Correction d'une régression qui empêchait la conversion des bandes dessinées contenant des images à 1 bit
pt_br: Saída PDF: Corrige uma regressão que danificou a conversão de quadrinhos que contém imagens de 1-bit

source: Edit book: Fix pressing Ctrl+Tab inserting a tab at the start of a line instead of switching tabs
fr: Editer le livre : Correction de la pression de Ctrl+Tab insérant une tabulation au début d'une ligne au lieu de changer de tabulation
pt_br: Editar livro: Corrige o pressionamento de Ctrl+Tab inserindo um espaço (tab) no início da linha em vez de trocar de abas

source: Fix a regression in the previous release that caused identifiers set by some plugins to not be saved in the database
fr: Correction d'une régression dans la version précédente qui faisait que les identifiants définis par certains plugins n'étaient pas enregistrés dans la base de données
pt_br: Corrige uma regressão na versão anterior que fazia com que os identificadores definidos por alguns plugins não fossem salvos na base de dados

source: Template language: Fix nesting composite columns sometimes failing
fr: Modèle de langage : Correction de l'imbrication des colonnes composées qui échoue parfois
pt_br: Linguagem de modelo: Corrige aninhamento de colunas composta às vezes falhando

source: 24 Sep, 2021
fr: 24 septembre 2021
pt_br: 24 de Setembro de 2021

source: Edit metadata dialog: Customize cover generation: Allow saving and loading cover generation settings as "themes"
fr: Boîte de dialogue d'édition des métadonnées : Personnalisation de la génération des couvertures : Permettre l'enregistrement et le chargement des paramètres de génération de couverture en tant que "thèmes".
pt_br: Diálogo de edição de metadados: Personalizar geração de capa: Permite salvar e carregar configurações de geração de capa como "temas"

source: E-book viewer: Allow pressing the 0-9 keys to apply a quick highlight style
fr: Visionneuse de livres numériques : Permettre d'appuyer sur les touches 0-9 pour appliquer un style de surbrillance rapide.
pt_br: Visualizador de e-books: Permite pressionar as teclas 0-9 para aplicar um estilo de destaque rápido

source: Book details panel: While clicking tags/authors/etc. holding down the Ctrl+Shift modifier keys now add the tag to the current search with "AND" instead of "OR" when using only Ctrl
fr: Panneau des détails du livre : Lorsque vous cliquez sur des étiquettes/auteurs/etc. en maintenant les touches de modification Ctrl+Shift enfoncées, l'étiquette est ajoutée à la recherche en cours avec "AND" au lieu de "OR" lorsque vous utilisez uniquement Ctrl.
pt_br: Painel de detalhes do livro: Ao clicar em etiquetas/autores/etc., segurar as teclas de modificação Ctrl+Shift agora adiciona a etiqueta para pesquisa atual com "E" em vez de "OU" ao usar apenas Ctrl

source: Add an option to the preferences drop down menu to restart calibre without third party plugins
fr: Ajout d'une option au menu déroulant des préférences pour redémarrer calibre sans plugins tiers
pt_br: Adiciona uma opção para o menu drop down do botão Preferências para reiniciar o calibre sem os plugins de terceiros

source: Edit book: When renaming classes in style sheets only recognize class names preceded by a period
fr: Modifier le livre : Lors du renommage des classes dans les feuilles de style, les noms de classe précédés d'un point ne sont reconnus qu'à l'identique.
pt_br: Editar livro: Ao renomear classes na folha de estilos apenas reconhece nomes de classes precedidos de um ponto

source: E-book viewer: Fix lookup in Google partially hidden due to change in Google results page markup
fr: Visionneuse de livres numériques : Correction de la recherche dans Google partiellement cachée en raison d'une modification du balisage de la page de résultats de Google
pt_br: Visualizador de e-books: Corrige pesquisa no Google parcialmente oculta devido a alterações no código da página de resultados do Google

source: Conversion dialog: Search replace expression builder: Fix incorrect search result highlighting when non-BMP unicode characters are present in the text
fr: Boite de dialogue de conversion : Constructeur d'expressions de recherche et de remplacement : Correction de la mise en évidence incorrecte des résultats de recherche lorsque des caractères unicodes non-BMP sont présents dans le texte.
pt_br: Diálogo de conversão: Construtor de expressão Pesquisar e Substituir: Corrige destaque de resultado de busca incorreto quando caracteres unicode não-BMP estão presentes no texto

source: E-book viewer: Fix popup footnote blank when the footnote link points to a &lt;body&gt; tag
fr: Visionneuse de livres numériques : Correction d'un popup de note de bas de page vide lorsque le lien de la note de bas de page pointe vers une balise &lt;body&gt;
pt_br: Visualizador de e-books: Corrige popup de nota de rodapé em branco quando o link da nota aponta para uma tag &lt;body&gt; tag

source: E-book viewer: Fix jumping to highlights in text that occurs after a line break and newline character not working in paged mode
fr: Visionneuse de livres numériques : Correction du saut vers les mises en évidence du texte qui se produit après un saut de ligne et du caractère de nouvelle ligne qui ne fonctionne pas en mode pagination
pt_br: Visualizador de e-books: Corrige salto para destaques no texto que ocorrem após caracteres de quebra de linha e nova linha não funcionando no modo paginado

source: Kindle Output: Strip EXIF metadata from JPEG images as the Kindle renderer has issues with it
fr: Format Kindle en sortie : Supprimez les métadonnées EXIF des images JPEG, car le moteur de rendu Kindle a des problèmes avec celles-ci.
pt_br: Saída Kindle: Remove metadados EXIF de imagens JPEG, uma vez que o renderizador do Kindle tem problemas com eles

source: 10 Sep, 2021
fr: 10 septembre 2021
pt_br: 10 de Setembro de 2021

source: When adding Markdown (.md) or Textile (.textile) files that contain references to images, automatically add them as TXTZ with the images
fr: Lorsque vous ajoutez des fichiers Markdown (.md) ou Textile (.textile) contenant des références à des images, ils sont ajoutés automatiquement en tant que TXTZ avec les images

source: DOCX Output: Correctly convert soft hyphens in the input document to DOCX soft hyphens
fr: Format DOCX en sortie : Conversion correcte des traits d'union du document d'entrée en traits d'union DOCX
pt_br: Saída DOCX: Corretamente converte hífens condicionais no arquivo de entrada para hífens condicionais do DOCX

source: DOCX Input: Fix a bookmark at the end of a paragraph causing the bookmark at the start of the paragraph to be skipped
fr: Format DOCX en entrée : Correction d'un signet à la fin d'un paragraphe entraînant le saut du signet au début du paragraphe
pt_br: Entrada DOCX: Corrige um marcador ao final do parágrafo fazendo com que o marcador do início do parágrafo seja pulado

source: Edit book: Spell check: Fix EPUB 3 nav document not being spell checked when not in the spine
fr: Éditer le livre : Vérification de l'orthographe : Correction du fait que le document EPUB 3 nav n'est pas vérifié orthographiquement lorsqu'il n'est pas dans la structure du livre
pt_br: Editar livro: Verificar ortografia: Corrige documento de navegação do EPUB 3 não sendo verificado quando não está na lombada

source: PDF Output: Fix a rare failure when the input document has a ToC item pointing to the last page
fr: Format PDF en sortie : Correction d'une défaillance rare lorsque le document d'entrée a un élément ToC pointant sur la dernière page
pt_br: Saída PDF: Corrige uma falha rara quando o documento de entrada tem um item do Índice apontando para a última página

source: Windows: Fix a regression in calibre 5 that caused drag and drop from WinZip to not work
fr: Windows : Correction d'une régression dans calibre 5 qui entraînait le non-fonctionnement du glisser-déposer depuis WinZip
pt_br: Windows: Corrige uma regressão no calibre 5 que fazia com que com que arrastar e soltar do WinZip não funcionasse

source: TXT Output: Fix a regression in calibre 5 that caused the max line length option to not work
fr: Format TXT en sortie : Correction d'une régression dans calibre 5 qui faisait que l'option de longueur de ligne maximale ne fonctionnait pas
pt_br: Saída TXT: Corrige uma regressão no calibre 5 que fazia com que a opção de tamanho máximo de linha não funcionasse

source: When auto converting added TXT files with image references to TXTZ use a full Markdown parser to detect Markdown images
fr: Lors de la conversion automatique de fichiers TXT ajoutés avec des références d'images en TXTZ, un analyseur de Markdown complet est utilisé pour détecter les images Markdown

source: 27 Aug, 2021
fr: 27 août 2021
pt_br: 27 de Agosto de 2021

source: Dark color scheme: Use a darker blue for highlighted items
fr: Schéma de couleurs sombres : Utilisation d'un bleu plus foncé pour les éléments mis en évidence
pt_br: Esquema de cor escuro: Usa um azul mais escuro para itens destacados

source: Content server book viewer: Show a message when a search finds no matches
fr: Visionneuse de livres du serveur de contenu : Afficher un message lorsqu'une recherche ne trouve aucune correspondance
pt_br: Visualizador de livros do Servidor de conteúdo: Mostra uma mensagem quando uma busca não encontra correspondências

source: MOBI Output: Fix JPEG images without any JFIF metadata not being rendered on the Kindle
fr: Format MOBI en sortie : Correction des images JPEG sans métadonnées JFIF qui ne sont pas restituées sur la Kindle
pt_br: Saída MOBI: Corrige imagens JPEG sem nenhum metadado JFIF não sendo renderizadas no Kindle

source: Comic input: Fix single color images having their colors changed by normalization
fr: Format bande dessinée en entrée : Correction des images monochromes dont les couleurs sont modifiées par la normalisation
pt_br: Entrada HQ: Corrige imagens de cor única tendo suas cores alteradas pela normalização

source: E-book viewer: Fix creating multiple highlights in a single paragraph that also contains some extra text formatting at the start causing the second and subsequent highlights to malfunction
fr: Visionneuse de livres numériques : Correction de la création de plusieurs mises en évidence dans un seul paragraphe qui contient également un formatage de texte supplémentaire au début, ce qui entraîne un mauvais fonctionnement de la deuxième mise en évidence et des suivantes.
pt_br: Visualizador de e-books: Corrige criação de múltiplos destaques em um único parágrafo que também contem alguma formatação de texto extra no início causando erros no segundo e subsequentes destaques

source: Edit book: Fix a regression in the previous release that broke the options in the Remove unused CSS dialog
fr: Modifier le livre : Correction d'une régression dans la version précédente qui interrompait les options de la boîte de dialogue "Supprimer les CSS inutilisés".
pt_br: Editar livro: Corrige uma regressão na versão anterior que danificou as opções no diálogo Remover regras CSS não usadas

source: 13 Aug, 2021
fr: 13 août 2021

source: Edit/Polish book: Remove unused CSS now also removes unreferenced stylesheets
fr: Modifier/Embellir le livre : Supprimer les CSS inutilisés supprime maintenant aussi les feuilles de style non référencées

source: E-book viewer: Add some CSS variables and classes that allow writing calibre specific CSS in ebooks. See <a href="%(h0)s">%(h0)s</a>
fr: Visionneuse de livres numériques : Ajout de quelques variables et classes CSS permettant d'écrire des CSS spécifiques à calibre dans les livres numériques. Voir <a href="%(h0)s">%(h0)s</a>

source: A new framework plugins can use to be notified about changes to calibre libraries
fr: Une nouvelle structure que les plugins peuvent utiliser pour être informés des changements apportés aux bibliothèques calibre

source: Edit metadata dialog: When pasting into the identifiers field if the clipboard contains a URL paste it directly as a URL identifier
fr: Boîte de dialogue Modifier les métadonnées : Lors du collage dans le champ des identifiants, si le presse-papiers contient une URL, il est possible de la coller directement comme identifiant d'URL

source: E-book viewer: When displaying popup footnotes use the same writing direction as the main text for the footnote popups size and header
fr: Visionneuse de livres numériques : Lorsque vous affichez des notes de bas de page contextuelles, utilisez le même sens d'écriture que le texte principal pour la taille et l'en-tête des notes de bas de page contextuelles.

source: E-book viewer: Improve the text layout when looking up words in Google
fr: Visionneuse de livres numériques : Améliorer la présentation du texte lors de la recherche de mots dans Google

source: Content server viewer: Fix read aloud not working on mobile browsers
fr: Visionneuse du serveur de contenu : Correction de la lecture à voix haute ne fonctionnant pas sur les navigateurs mobiles

source: 30 Jul, 2021
fr: 30 juillet 2021
pt_br: 30 de Julho de 2021

source: Conversion: Insert metadata as jacket: Allow adding timestamp and publisher fields. Also allow controlling the formatting of date/time fields
fr: Conversion : Insérer les métadonnées comme jaquette : Permet d'ajouter des champs d'horodatage et d'éditeur. Permet également de contrôler le formatage des champs date/heure.
pt_br: Conversão: Inserir metadados como sobrecapa: Permite adicionar os campos de data e editora. Também permite controlar a formatação de campos de data/hora

source: Cover browser: Add an option to view the central book by double clicking instead of single clicking (Preferences-&gt;Look &amp; feel-&gt;Cover browser)
fr: Navigateur de couverture : Ajout d'une option permettant d'afficher le livre principal en double-cliquant au lieu de cliquer une seule fois (Préférences-&gt;Apparence &amp ; visualisation-&gt;Navigateur de couverture)
pt_br: Navegador de capas: Adiciona uma opção para ver o livro central com um clique duplo, em vez de um único clique (Preferências-&gt;Aparência-&gt;Navegador de capas)

source: Tag browser: Add actions to the configure menu to toggle the display of counts and average rating
fr: Navigateur d'étiquettes : Ajout d'actions au menu de configuration pour basculer entre l'affichage du nombre de points et celui de l'évaluation moyenne.
pt_br: Navegador de etiquetas: Adiciona ações ao menu de configuração para ativar a exibição de contagens e avaliações médias

source: Tag browser: Allow plugins to add entries to the context menu
fr: Navigateur d'étiquettes : Autoriser les plugins à ajouter des entrées au menu contextuel
pt_br: Navegador de etiquetas: Permite que plugins adicionem entradas ao menu de contexto
