Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: fetch-ebook-metadata: Fix an error when using the --cover option and no cover is found
fr: fetch-ebook-metadata : Correction d'une erreur lors de l'utilisation de l'option --cover et qu'aucune couverture n'est trouvée
pt_br: fetch-ebook-metadata: Corrige um erro ao utilizar a opção --cover e nenhuma capa for encontrada

source: HTML Input: Fix the presence of BookDesigner markup causing conversion to fail
fr: Format HTML en entrée : Correction de la présence de balises BookDesigner provoquant l'échec de la conversion
pt_br: Entrada HTML: Corrige a presença da marcação de BookDesigner fazendo com que a conversão falhe

source: TXT Input: Do not fail if the txt file references a directory as a resource
fr: Format TXT en entrée : Pas d'échec si le fichier txt fait référence à un répertoire en tant que ressource.

source: 09 Jul, 2021
fr: 09 juillet 2021
pt_br: 09 de Julho de 2021

source: Annotations browser: Show highlight color in the preview panel
fr: Navigateur d'annotations : Afficher la couleur de la mise en évidence dans le panneau de prévisualisation
pt_br: Navegador de anotações: Mostrar cor de destaque no painel de pré-visualização

source: TXTZ format: Store type of text formatting in the metadata and use it automatically when converting from TXTZ
fr: Format TXTZ : Enregistre le type de formatage du texte dans les métadonnées et l'utilise automatiquement lors de la conversion du format TXTZ.
pt_br: Formato TXTZ: Armazena o tipo de formatação de texto nos metadados e usa-o automaticamente ao converter a partir do formato TXTZ

source: Edit metadata dialog: Allow holding Ctrl and clicking the item editor buttons to instead open the manage dialog
fr: Boîte de dialogue d'édition des métadonnées : Permettre de maintenir la touche Ctrl enfoncée et de cliquer sur les boutons de l'éditeur d'éléments pour ouvrir la boîte de dialogue de gestion.
pt_br: Diálogo de Edição de metadados: Permite segurar Ctrl e clicar nos botões do editor de itens para, em vez disso, abrir o diálogo de gerenciamento

source: Annotations browser: Fix searching for words in languages such as Chinese that do not have word delimiters not working
fr: Navigateur d'annotations : Correction de la recherche de mots qui ne fonctionnait pas dans des langues telles que le chinois qui n'ont pas de délimiteurs de mots
pt_br: Navegador de anotações: Corrige busca por palavras em idiomas como Chinês, que não possui delimitadores de palavras, não funcionando

source: News download: Fix URLs with spaces in them not being downloaded since calibre 5.0
fr: Téléchargement d'actualités : Correction des URLs contenant des espaces qui ne sont pas téléchargées depuis calibre 5.0
pt_br: Download de notícias: Corrige URLs com espaços não sendo baixadas a partir do calibre 5.0

source: When searching for books by an author from the Manage authors dialog, use exact matches
fr: Lorsque vous recherchez des livres d'un auteur à partir de la boîte de dialogue Gérer les auteurs, utilise des correspondances exactes.

source: MOBI Output: Fix invalid color specification as plain numbers causing conversion to fail
fr: Format MOBI en sortie : Correction d'une spécification de couleur invalide sous forme de nombres simples entraînant l'échec de la conversion.
pt_br: Saída MOBI: Corrige especificação de cor inválida fazendo a conversão falhar

source: MOBI Output: Fix invalid text indent specification causing conversion to fail
fr: Format MOBI en sortie : Correction d'une spécification d'indentation de texte invalide entraînant l'échec de la conversion
pt_br: Saída MOBI: Corrige especificação de indentação de texto inválida fazendo a conversão falhar

source: Linux: Drop the unmaintained dbus-python in favor of jeepney for DBUS
fr: Linux : Abandon de dbus-python (non-maintenu) en faveur de jeepney pour DBUS
pt_br: Linux: Abandona o desatualizado dbus-python em favor do jeepney para DBUS

source: Edit book: Workaround for Qt bug that caused the panel sizes in the editor to not be remembered across sessions
fr: Éditer le livre : Contournement d'un bogue Qt qui empêchait la mémorisation de la taille des panneaux dans l'éditeur d'une session à l'autre.
pt_br: Editar livro: Solução alternativa para o bug do Qt que fazia com que os tamanhos dos painéis do editor não fossem lembrados entre as sessões

source: 25 Jun, 2021
fr: 25 juin 2021
pt_br: 25 de Junho de 2021

source: E-book viewer: Allow clicking links in popup footnotes
fr: Visionneuse de livres numériques : Permettre de cliquer sur les liens dans les notes de bas de page contextuelles
pt_br: Visualizador de e-books: Permite clicar em links no popup de notas de rodapé

source: Main book list: Scroll per pixel rather than per item by default. Can be returned to previous behavior via Preferences-&gt;Tweaks-&gt;Control behavior of book list
fr: Liste principale des livres : Par défaut, défilement par pixel plutôt que par élément. Il est possible de revenir au comportement précédent via Préférences-&gt;Ajustements-&gt;Contrôler le comportement de la liste de livres.
pt_br: Lista principal de livros: Rola por pixel por padrão, em vez de por item. Pode ser configurado para o comportamento anterior via Preferências-&gt;Ajustes-&gt;Controla o comportamento da lista de livros

source: Linux: Drop support for the global menu bar
fr: Linux : Suppression de la prise en charge de la barre de menu globale
pt_br: Linux: Encerra o suporte para a barra de menu global

source: E-book viewer: Fix font sizes specified in absolute units not being honored in locales where the decimal separator is not the period
fr: Visionneuse de livres numériques : Correction des tailles de police spécifiées en unités absolues qui ne sont pas respectées dans les régions où le séparateur décimal n'est pas le point.
pt_br: Visualizador de e-books: Corrige o tamanho de fontes especificado em unidades absolutas não sendo honradas em regiões em que separador decimal não é um ponto

source: E-book viewer: Fix searching for short strings in text with lots of similar entries displaying incorrect matches
fr: Visionneuse de livres numériques : Correction de la recherche de chaînes courtes dans le texte avec beaucoup d'entrées similaires affichant des correspondances incorrectes

source: MOBI Output: Fix using percentage units for margins resulting in too large margins when using the tablet output profile
fr: Format MOBI en sortie : Correction de l'utilisation d'unités de pourcentage pour les marges, ce qui entraîne des marges trop importantes lors de l'utilisation du profil de sortie pour tablette.

source: E-book viewer: Fix back button not working after jumping to a bookmark
fr: Visionneuse de livres numériques : Correction du bouton retour qui ne fonctionne pas après avoir sauté à un signet

source: Content server: OPDS feed: Fix incorrect up URL in category group feeds
fr: Serveur de contenu : Flux OPDS : Correction de l'URL ascendante incorrecte dans les flux de groupes de catégories

source: Content server: Fix a regression in the previous release that broke editing of series metadata
fr: Serveur de contenu : Correction d'une régression dans la version précédente qui interrompait l'édition des métadonnées de série

source: E-book viewer: Fix scrolling backwards by screen-fulls not working with very large page margins.
fr: Visionneuse de livres numériques : Correction du défilement vers l'arrière par pleins écrans ne fonctionnant pas avec de très grandes marges de page.

source: MOBI Input: Fix a regression in calibre 5 that broke processing of Haodoo format files
fr: Format MOBI en entrée : Correction d'une régression dans Calibre 5 qui empêchait le traitement des fichiers au format Haodoo

source: Conversion: Fix the smarten punctuation option not applying to inserted jacket page
fr: Conversion : Correction de l'option d'optimisation de la ponctuation qui ne s'applique pas à la page de couverture insérée

source: 5.22.1 fixes a typo in the previous release that broke device detection on Linux
fr: La version 5.22.1 corrige une erreur de frappe dans la version précédente qui interrompait la détection des périphériques sous Linux

source: 11 Jun, 2021
fr: 11 juin 2021

source: Driver for the new Kobo Ellipsa
fr: Pilote pour la nouvelle Kobo Ellipsa

source: Content server: When editing metadata for fields that take multiple values, make it easier to remove individual values by simply tapping a button
fr: Serveur de contenu : Lors de la modification des métadonnées pour les champs qui prennent plusieurs valeurs, il est plus facile de supprimer des valeurs individuelles en appuyant simplement sur un bouton.

source: Browser viewer: Make current color scheme setting propagate to all devices automatically when using user accounts
fr: Visionneuse du navigateur : Faire en sorte que le schéma de couleurs actuel se propage automatiquement à tous les appareils lors de l'utilisation de comptes d'utilisateurs.

source: E-book viewer: Image popup: Show the image resolution in the popup window's titlebar
fr: Visionneuse de livres numériques : Popup d'image : Afficher la résolution de l'image dans la barre de titre de la fenêtre popup.

source: HTML Input: Fix handling of @import rules in stylesheets nested more than one level deep
fr: Entrée HTML : Correction de la gestion des règles @import dans les feuilles de style imbriquées à plus d'un niveau de profondeur.

source: Fix viewer search context menu to clear searches not clearing search settings
fr: Correction du menu contextuel de la recherche de la visionneuse pour effacer les recherches n'effaçant pas les paramètres de recherche

source: E-book viewer image popup: Fix full screen button in incorrect state when starting in full screen
fr: Popup de l'image de la visionneuse de livres numériques : Correction du bouton plein écran dans un état incorrect lors du démarrage en plein écran

source: 04 Jun, 2021
fr: 04 juin 2021

source: E-book viewer: Highlights: Make URLs in the notes for highlights clickable
fr: Visionneuse de livres numériques : Mises en évidence : Rendre cliquable les URL dans les notes des mises en évidence.

source: Book details: Ctrl-clicking on tags now adds them to the existing search instead of replacing it
fr: Détails du livre : Ctrl-cliquer sur les balises les ajoute désormais à la recherche existante au lieu de la remplacer

source: E-book viewer: Allow using the back button to return from jumping to a search result
fr: Visionneuse de livres numériques : Permettre l'utilisation du bouton retour pour revenir au résultat d'une recherche

source: Get books: Fix the Kobo store plugin for changes to the website
fr: Obtenir des livres : Correction du plugin de la boutique Kobo en fonction des modifications apportées au site Web

source: Edit book: Fix non breaking spaces in snippets being converted to normal spaces
fr: Éditer le livre : Correction des espaces insécables dans les fragments qui sont convertis en espaces normaux

source: ToC Editor: Fix a regression that caused changes to not be saved on machines where running a worker process takes more than ten seconds
fr: Éditeur de la TdM : Correction d'une régression à cause de laquelle les modifications n'étaient pas enregistrées sur les machines où l'exécution d'un processus de travail prend plus de dix secondes

source: Fix error when changing the "Search the net" URLs for the Content server
fr: Correction d'une erreur lors de la modification des URLs " Rechercher sur le net " pour le Serveur de contenu

source: 28 May, 2021
fr: 28 mai 2021

source: E-book viewer: Add a preference under Scrolling behavior to reverse the tap zones used to turn pages. So tapping on the left goes forward and the right backward
fr: Visionneuse de livres numériques : Ajoutez une préférence sous Comportement de défilement pour inverser les zones d'appui utilisées pour tourner les pages. Ainsi, en tapant sur la gauche, on avance et sur la droite, on recule.

source: E-book viewer: Fix regression in 5.15 that caused incorrect display of font sizes that contain a period and use absolute units
fr: Visionneuse de livres numériques : Correction d'une régression dans la version 5.15 qui entraînait un affichage incorrect des tailles de police contenant un point et utilisant des unités absolues.

source: PDF Output: Fix font kerning issues with some TrueType fonts
fr: Format PDF en sortie : Correction des problèmes de crénage des polices avec certaines polices TrueType

source: Edit book: Fix a regression in 5.18 that broke editing/creating saved searches
fr: Éditer le livre : Correction d'une régression dans la version 5.18 qui empêchait l'édition/création de recherches enregistrées.

source: Windows: Fix for standalone ToC Editor not working on systems where Qt WebEngine causes a crash at exit
fr: Windows : Correction de l'éditeur de TdM autonome qui ne fonctionne pas sur les systèmes où Qt WebEngine provoque un crash à la sortie

source: Windows MTP driver: When scanning an MTP device such as an Android phone ignore folders that Windows fails to enumerate instead of failing with an error
fr: Pilote MTP de Windows : Lors de l'analyse d'un périphérique MTP tel qu'un téléphone Android, ignore les dossiers que Windows ne parvient pas à énumérer au lieu d'échouer avec une erreur

source: ToC Editor: Fix a regression that broke choosing split points in some XHTML files
fr: Éditeur de la TdM : Correction d'une régression qui empêchait le choix des points de séparation dans certains fichiers XHTML

source: PDB Input: Fix a regression in calibre 5 that broke processing some plucker format PDB files
fr: Format PDB en entrée : Correction d'une régression dans calibre 5 qui empêchait le traitement de certains fichiers PDB au format plucker.

source: Edit book: Fix sorting in spell check dialog on language broken for books that have unknown languages
fr: Éditer le livre : Correction du tri dans le dialogue de vérification orthographique sur la langue défectueux pour les livres dont la langue est inconnue

source: Annotations browser: Fix a typo that broke sorting for highlights
fr: Navigateur d'annotations : Correction d'une faute de frappe qui interrompait le tri des mises en évidence

source: Annotations browser: When showing a highlight preserve paragraph boundaries for multi-paragraph highlights
fr: Navigateur d'annotations : Lors de l'affichage d'un surlignage, les limites des paragraphes sont préservées pour les surlignages de plusieurs paragraphes

source: Viewer highlights panel: Fix the "Edit notes" link not saving the changes
fr: Panneau des mises en évidence de la visionneuse : Correction du lien " Éditer les notes " qui n'enregistre pas les changements

source: E-book viewer: When using a right click/shift-click to adjust the selection, move the section boundary that is closer to the click point
fr: Visionneuse de livres numériques : Lorsque vous utilisez un clic droit/shift-clic pour ajuster la sélection, déplacez la limite de la section qui est plus proche du point de clic

source: 21 May, 2021
fr: 21 mai 2021

source: Content server viewer: Improved search functionality
fr: Visionneuse du Serveur de contenu : Amélioration de la fonctionnalité de recherche

source: Searching can now be done for whole words and regular expressions. And all search results are listed at once with some context for easy navigation.
fr: Il est désormais possible d'effectuer des recherches sur des mots entiers et des expressions régulières. Et tous les résultats de la recherche sont affichés en une seule fois avec un certain contexte pour faciliter la navigation.

source: E-book viewer: Allow making the image popup full screen
fr: Visionneuse de livres numériques : Permettre de faire apparaître l'image en plein écran

source: E-book viewer: Allow expanding/collapsing all items in the Table of Contents at a particular level by right clicking on one item of that level and choosing the option to expand/collapse
fr: Visionneuse de livres numériques : Permettre de développer/réduire tous les éléments de la Table des Matières à un niveau particulier en faisant un clic droit sur un élément de ce niveau et en choisissant l'option de développer/réduire.

source: E-book viewer: Add shortcuts shift+home and shift+end to extend current selection to start/end of line
fr: Visionneuse de livres numériques : Ajout des raccourcis shift+home et shift+end pour étendre la sélection actuelle au début/fin de la ligne

source: Book details: When creating rules to convert identifiers to URLs allow using {id_unquoted} to avoid quoting the identifier value
fr: Détails du livre : Lors de la création de règles pour convertir des identifiants en URLs, il est possible d'utiliser {id_unquoted} pour éviter de citer la valeur de l'identifiant.

source: Review downloaded metadata: Allow double clicking on a cover to see it at a larger size
fr: Examiner les métadonnées téléchargées : Permettre de double-cliquer sur une couverture pour la voir en plus grand format

source: Annotations browser: Add a Refresh button
fr: Navigateur d'annotations : Ajout d'un bouton de rafraîchissement

source: Edit book: Fix ctrl-clicking on a class name jumping to the wrong CSS rule if the stylesheet contains top level comments
fr: Éditer le livre : Correction d'un ctrl-clic sur un nom de classe qui renvoie à la mauvaise règle CSS si la feuille de style contient des commentaires de haut niveau

source: Fix search and replace on identifiers not working if the replaced value has colons
fr: Correction de la recherche et du remplacement d'identifiants ne fonctionnant pas si la valeur remplacée contient des deux-points

source: Annotations browser: Sort the entries in order of position in book
fr: Navigateur d'annotations : Trier les entrées dans l'ordre de leur position dans le livre

source: ToC editor: Dark mode: Fix colors in location selection panel not dark
fr: Éditeur de la TdM : Mode nuit : Correction des couleurs du panneau de sélection des emplacements qui ne sont pas sombres

source: E-book viewer: Fix right or shift-clicking to extend selection not shrinking selection when the click is inside the selection
fr: Visionneuse de livres numériques : Correction du fait que le clic droit ou shift-clic pour étendre la sélection ne réduit pas la sélection lorsque le clic est à l'intérieur de la sélection

source: Avoid spurious errors on multiple simultaneous calibre launches
fr: Éviter les erreurs intempestives lors de lancements multiples et simultanés de calibre

source: E-book viewer: Ignore mouse scroll events that would turn pages when editing notes
fr: Visionneuse de livres numériques : Ignorer les événements de défilement de la souris qui feraient tourner les pages lors de l'édition de notes

source: E-book viewer: Fix sorting bookmarks by title not working
fr: Visionneuse de livres numériques : Correction du tri des signets par titre qui ne fonctionne pas

source: Windows WPD driver: Fix an error reading the filesystem on some MTP based devices
fr: Pilote WPD pour Windows : Correction d'une erreur de lecture du système de fichiers sur certains périphériques basés sur MTP

source: 30 Apr, 2021
fr: 30 avril 2021
pt_br: 30 de Abril de 2021

source: E-book viewer: Image popup: Allow dragging with the mouse to pan the image
fr: Visionneuse de livres numériques : Popup d'image : Possibilité de faire glisser la souris pour obtenir une vue panoramique de l'image
pt_br: Visualizador de e-books: Pop-up de imagem: Permite arrastar com o mouse para deslocar a imagem

source: Sort button: Allow selecting which columns are in the popup sort menu
fr: Bouton de tri : Permet de sélectionner les colonnes qui figurent dans le menu déroulant de tri

source: E-book viewer: When suggesting a default bookmark title, use the name of the current chapter
fr: Visionneuse de livres numériques : Lors de la suggestion d'un titre de signet par défaut, utiliser le nom du chapitre en cours.

source: E-book viewer: When searching the Table of Contents allow holding the Shift key to search backwards
fr: Visionneuse de livres numériques : Lors d'une recherche dans la Table des Matières, il est possible de maintenir la touche Shift enfoncée pour effectuer une recherche en arrière.

source: E-book viewer: Add a shortcut Ctrl+0 to restore default font size
fr: Visionneuse de livres numériques : Ajout d'un raccourci Ctrl+0 pour restaurer la taille de police par défaut

source: Windows MTP driver: Rewrite parts of the driver in the hope of fixing some rare and hard to reproduce crashes
fr: Pilote MTP de Windows : Réécriture de certaines parties du pilote dans l'espoir de résoudre certains problèmes rares et difficiles à reproduire

source: Windows MTP driver: Set modified and created times when putting files/folders on device. Also read modified time correctly.
fr: Pilote MTP de Windows : Définir les heures de modification et de création lors de la mise en place de fichiers/dossiers sur le périphérique. Lire aussi correctement l'heure de modification.

source: Windows: E-book viewer: Fix switching away from viewer while in full screen and switching back causing some corruption until the page is scrolled
fr: Windows : Visionneuse de livres numériques : Correction du fait que quitter la visionneuse en plein écran et de revenir en arrière provoque une certaine corruption jusqu'à ce que la page défile

source: Fix a regression in the previous release that caused errors when editing empty date values
fr: Correction d'une régression dans la version précédente qui provoquait des erreurs lors de l'édition de valeurs de dates vides

source: Get books: Update Gutenberg plugin for website changes
fr: Obtenir des livres : Mise à jour du plugin Gutenberg en raison des modifications apportées au site web

source: E-book viewer: The quick highlight button should replace the style of an existing highlight, when one is selected
fr: Visionneuse de livres numériques : Le bouton de mise en évidence rapide devrait remplacer le style d'une mise en évidence existante, lorsqu'elle est sélectionnée

source: Elide long items in the middle when showing the completion popup for tags, to make it easier to use with hierarchical tags
fr: Élision des éléments longs au milieu lors de l'affichage de la fenêtre popup de complétion des balises, pour faciliter l'utilisation des balises hiérarchiques

source: E-book viewer: Read aloud: Fix soft hyphens causing read aloud words to be broken up
fr: Visionneuse de livres numériques : Lecture à voix haute : Correction des traits d'union conditionnels provoquant la rupture des mots lus à haute voix.

source: E-book viewer: Right clicking when text is selected should extend the selection instead of doing nothing
fr: Visionneuse de livres numériques :Un clic droit lorsque du texte est sélectionné devrait étendre la sélection au lieu de ne rien faire

source: Fix settings in the ToC Editor tool being forgotten when calibre is closed
fr: Correction des paramètres de l'outil Edition de la TdM qui sont oubliés lorsque calibre est fermé

source: DOCX Output: Fix conversion failing if the input document has missing images
fr: Format DOCX en sortie : Correction de l'échec de la conversion si le document d'entrée comporte des images manquantes

source: Content server viewer: Fix mouse wheel scrolling not working on the box used to edit notes for highlights
fr: Visionneuse du Serveur de contenu : Correction du défilement de la molette de la souris ne fonctionnant pas sur la boîte utilisée pour éditer les notes des mises en évidence

source: E-book viewer: Fix read aloud word tracking in flow mode not very reliable
fr: Visionneuse de livres numériques : Correction du suivi des mots lus à voix haute en mode flux qui n'était pas très fiable
