Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: User category editor: Hide items not visible in the Tag browser
fr: Éditeur de catégories d'utilisateurs : masquer les éléments non visibles dans le Navigateur d'étiquettes
pt_br: Editor de categorias do usuário: Oculta itens não visíveis no Navegador de Etiquetas

source: Allow adding a button to show the Manage categories window to the toolbars via Preferences-&gt;Toolbars &amp; menus
fr: Permettre l'ajout d'un bouton pour afficher la fenêtre Gérer les catégories aux barres d'outils via Préférences-&gt;Barres d'outils &amp; menus
pt_br: Permite adicionar um botão para mostrar a janela Gerenciar categorias nas barras de ferramentas via Preferências-&gt;Barras de ferramentas e &amp; menus

source: Google metadata download: When excluding results from a web search because they don't match the specified title/author ignore diacritics, accents, etc.
fr: Téléchargement des métadonnées de Google : Lors de l'exclusion de résultats d'une recherche web parce qu'ils ne correspondent pas au titre/auteur spécifié, ignorez les caractères diacritiques, les accents, etc.
pt_br: Download de metadados do Google: Ao excluir resultados de uma pesquisa na web porque elas não correspondem ao autor/título, ignora diacríticos, acentos, etc.

source: E-book viewer: Lookup: Google dictionary: Add some padding at the left and right margins
fr: Visionneuse de livres numériques : Recherche : Dictionnaire Google : Ajout d'un peu de remplissage aux marges gauche et droite
pt_br: Visualizador de e-books: Pesquisar: Dicionário Google: Adiciona mais espaçamento às margens esquerda e direita

source: E-book viewer: Lookup word in Google dictionary: Fix meanings of some words not being shown in the user's preferred language
fr: Visionneuse de livres numériques : Recherche d'un mot dans le dictionnaire Google : Correction de la signification de certains mots qui ne sont pas affichés dans la langue préférée de l'utilisateur
pt_br: Visualizador de e-books: Pesquisar palavra no dicionário do Google: Corrige o significado de algumas palavras não sendo exibidos no idioma preferido do usuário

source: Fix calibredb backup_metadata --all operating only on dirty books not all books
fr: Correction de calibredb backup_metadata --all fonctionnant seulement sur les livres endommagés et non sur tous les livres
pt_br: Corrige calibredb backup_metadata --all operando apenas em livros alterados, e não em todos os livros

source: Do not VACUUM FTS db when exporting library as it can be very slow
fr: Ne pas VIDER la base de données RTI lors de l'exportation de la bibliothèque car cela peut être très lent
pt_br: Não limpa a base de dados da pesquisa no texto completo ao exportar a biblioteca, uma vez que pode ser muito lento

source: Windows: Nicer error message when attempting to run viewer/editor on machine without MediaPack installed
fr: Windows : Message d'erreur plus élégant lors de la tentative d'exécuter la visionneuse/l'éditeur sur une machine sans MediaPack installé
pt_br: Windows: Melhora a mensagem de erro ao tentar executar o visualizador/editor em máquinas sem o MediaPack instalado

source: Edit book: Reports: Fix rendering of images in the images report table
fr: Editer le livre : Rapports : Correction du rendu des images dans le tableau du rapport sur les images
pt_br: Editar livro: Relatórios: Corrige renderização de imagens na tabela de relatório de imagens

source: Content server: Fix formatting of dates for custom columns using ISO format
fr: Serveur de contenu : Correction du formatage des dates pour les colonnes personnalisées utilisant le format ISO
pt_br: Servidor de conteúdo: Corrige formatação de datas para colunas personalizadas usando formato ISO

source: 12 Aug, 2022
fr: 12 août 2022
pt_br: 12 de Agosto de 2022

source: E-book viewer: Allow searching for nearby words using a new "Nearby words" search mode
fr: Visionneuse de livres numériques : Possibilité de rechercher des mots proches à l'aide d'un nouveau mode de recherche "Mots proches".
pt_br: Visualizador de e-books: Permite pesquisar por palavras próximas usando o novo modo "Palavras próximas"

source: calibredb: New fts_search and fts_index commands to perform full text searching from the command line
fr: calibredb : Nouvelles commandes fts_search et fts_index pour effectuer des recherches en texte intégral depuis la ligne de commande
pt_br: calibredb: Novos comandos fts_search e fts_index para executar pesquisas no texto completo a partir da linha de comando

source: Image viewing popup: Allow zooming using the standard shortcuts of Ctrl+plus/minus
fr: Popup de visualisation des images : Permet de zoomer en utilisant les raccourcis standard de Ctrl+plus/moins.
pt_br: Pop-up de visualização de imagem: Permite dar zoom usando os atalhos padrão Ctrl+mais/menos

source: Fix a regression in calibre 6.0 that broke remembering the previous sort order for a column
fr: Correction d'une régression dans calibre 6.0 qui empêchait la mémorisation de l'ordre de tri précédent pour une colonne
pt_br: Corrige uma regressão no calibre 6.0 que danificou a lembrança da ordem de classificação anterior para uma coluna

source: Fix a regression in calibre 6.0 that broke processing of very high resolution images
fr: Correction d'une régression dans calibre 6.0 qui interrompait le traitement des images à très haute résolution
pt_br: Corrige uma regressão no calibre 6.0 que danificou o processamento de imagens de altíssima resolução

source: Full text search: Fix error when using restrict searched books and more than 900 books are present in the searched list
fr: Recherche intégrale de texte Correction d'une erreur lors de l'utilisation de la restriction des livres recherchés et lorsque plus de 900 livres sont présents dans la liste recherchée
pt_br: Pesquisa no texto completo: Corrige um erro ao usar a pesquisa restrita e mais de 900 livros estiverem presentes na lista pesquisada

source: E-book viewer: Fix parsing of CSS styles with @supports rules not working
fr: Visionneuse de livres numériques : Correction de l'analyse des styles CSS avec les règles @supports qui ne fonctionnaient pas
pt_br: Visualizador de e-books: Corrige o processamento de estilos CSS com regras @supports não funcionando

source: E-book viewer: Speed up initial render of books with lots of CSS in &lt;style&gt; tags by not prettying the CSS
fr: Visionneuse de livres numériques : Accélère le rendu initial des livres contenant beaucoup de CSS dans les balises &lt;style&gt ; en ne rendant pas le CSS esthétique
pt_br: Visualizador de e-books: Acelera a renderização inicial de livros com muitas regras CSS em tags &lt;style&gt;, ao não embelezar o CSS

source: Google books metadata download: Fix paragraphs not being recognized
fr: Téléchargement des métadonnées des livres Google : Correction des paragraphes non reconnus
pt_br: Download de metadados do Google books: Corrige parágrafos não sendo reconhecidos

source: Content server: Fix light background for comments editor in dark mode
fr: Serveur de contenu : Correction du fond clair de l'éditeur de commentaires en mode sombre
pt_br: Servidor de conteúdo: Corrige o plano de fundo claro para o editor de comentários no modo escuro

source: Content server: Fix margin and body background color mismatch when reading books with a non-white/black color scheme
fr: Serveur de contenu : Correction du décalage de la couleur de fond de la marge et du corps lors de la lecture de livres dont le schéma de couleurs n'est pas blanc/noir
pt_br: Servidor de conteúdo: Corrige discrepância entre o plano de fundo do corpo do texto e margem ao ler livros com um esquema de cores não-branco/preto

source: Content server: Fix long tapping in the notes edit area incorrectly changing the highlight extent
fr: Serveur de contenu : Correction d'un tapotement prolongé dans la zone d'édition des notes qui modifie incorrectement l'étendue de la surbrillance
pt_br: Servidor de conteúdo: Corrige toque longo na área de edição de notas incorretamente alterando a extensão do destaque

source: Check library: Fix vacuum not running on FTS db
fr: Vérifier la bibliothèque : Corriger le vide qui ne fonctionne pas sur FTS db
pt_br: Verificar biblioteca: Corrige limpeza não sendo executada na base de dados da pesquisa no texto completo

source: 29 Jul, 2022
fr: 29 juillet 2022
pt_br: 29 de Julho de 2022

source: Full text search: Ignore soft hyphens when extracting searchable text from books. Note that you will have to re-index your library to take advantage of this.
fr: Recherche en texte intégral : Ignorer les traits d'union conditionnels lors de l'extraction du texte consultable des livres. Notez que vous devrez réindexer votre bibliothèque pour bénéficier de cette fonctionnalité
pt_br: Pesquisa no texto completo: Ignora hifens opcionais ao extrair texto pesquisável de livros. Note que você terá que reindexar sua biblioteca para tirar vantagem disso.

source: Content server: Have the Read button open PDF files in the browsers builtin PDF viewer rather than the calibre viewer since the calibre viewer is not well suited to PDF
fr: Serveur de contenu : Faire en sorte que le bouton Lire ouvre les fichiers PDF dans la visionneuse PDF intégrée du navigateur plutôt que dans la visionneuse Calibre, cette dernière n'étant pas adaptée aux fichiers PDF
pt_br: Servidor de conteúdo: Faz com que o botão Ler abra arquivos PDF no visualizador interno do navegador, em vez de usar o visualizador do calibre, uma vez que ele não é muito adequado para PDFs

source: Kobo driver: Add support for new firmware
fr: Pilote Kobo : Ajout de la prise en charge d'un nouveau firmware
pt_br: Driver do Kobo: Adiciona suporte para o novo firmware

source: Create icon theme dialog: Add a checkbox to install the newly created theme into calibre
fr: Boîte de dialogue de création d'un thème d'icône : Ajout d'une case à cocher pour installer le thème nouvellement créé dans calibre
pt_br: Diálogo de criação de tema de ícones: Adiciona um caixa de seleção para instalar o novo tema criado no calibre

source: Allow re-indexing a book for FTS by right clicking the Book details panel
fr: Permettre de réindexer un livre pour la RTI en faisant un clic droit sur le panneau de Détails du livre
pt_br: Permite reindexar um livro para pesquisa no texto completo ao clicar com o botão direito no painel de Detalhes do livro

source: Content server: Workaround for Chrome bug causing multiple sign in prompts when connecting to the server after restarting Chrome
fr: Serveur de contenu : Contournement d'un bogue de Chrome provoquant de multiples invites de connexion lors de la connexion au serveur après le redémarrage de Chrome
pt_br: Servidor de conteúdo: Solução alternativa para um bug no Chrome causando múltiplos prompts de login ao conectar ao servidor após reiniciar o Chrome

source: Fix a regression in 6.0 that broke rendering of first page of EPUB as cover when the EPUB has no actual cover
fr: Correction d'une régression dans la version 6.0 qui empêchait le rendu de la première page d'un EPUB comme couverture lorsque l'EPUB n'a pas de couverture réelle
pt_br: Corrige uma regressão na versão 6.0 que danificou a renderização da primeira página do EPUB como a capa, quando o EPUB não tem uma capa real

source: Content server: Fix a regression in 6.0 that caused incorrect rendering of comments metadata in the book details panel in dark mode
fr: Serveur de contenu : Correction d'une régression dans la version 6.0 qui entraînait un rendu incorrect des métadonnées des commentaires dans le panneau de détails du livre en mode nuit
pt_br: Servidor de conteúdo: Corrige uma regressão na versão 6.0 que causava renderização incorreta de metadados de comentários no painel de detalhes do livro no modo escuro

source: FB2 Input: Fix a regression in 6.0 that broke conversion of FB2 on macOS
fr: Format FB2 en entrée : Correction d'une régression dans la version 6.0 qui empêchait la conversion de FB2 sous macOS
pt_br: Entrada FB2: Corrige uma regressão na versão 6.0 que danificou a conversão de FB2 no macOS

source: Metadata download from Google: Switch to making the queries via a Google web search as this finds some books that searching via the API does not
fr: Téléchargement des métadonnées à partir de Google : Effectuer les requêtes par le biais d'une recherche sur Google, car cela permet de trouver certains livres que la recherche via l'API ne permet pas
pt_br: Download de metadados do Google: Muda para fazer as consultas via busca web no Google, uma vez que assim encontra alguns livros que buscando pela API não eram encontrados

source: Book details panel: Fix clicking on items from an enumerated column containing ampersands not searching correctly
fr: Panneau de détails du livre : Correction du fait que cliquer sur des éléments d'une colonne énumérée contenant des esperluettes n'entraîne pas une recherche correcte
pt_br: Painel de Detalhes do livro: Corrige o clique em itens de uma coluna enumerada contendo 'e comercial' não pesquisando corretamente

source: Image editor: Do not allow initial mouse drag to create selection rect outside the image bounds
fr: Éditeur d'images : Ne pas autoriser le déplacement initial de la souris pour créer un rectangle de sélection en dehors des limites de l'image
pt_br: Editor de imagens: Não permite o arrasto inicial do mouse criar retângulos de seleção fora dos limites da imagem

source: E-book viewer: Fix clicking on ToC entries moving keyboard focus to the ToC search box when the ToC window is floating
fr: Visionneuse de livres numériques : Correction d'un clic sur les entrées de la TdM qui déplace le focus du clavier vers la boîte de recherche de la TdM lorsque la fenêtre de la TdM est flottante
pt_br: Visualizador de e-books: Corrige o clique nas entradas do Índice movendo o foco do teclado para caixa de pesquisa do Índice quando a janela do Índice estivesse flutuando

source: Fix a regression in 6.0 that caused the default cover to be rendered small in some contexts
fr: Correction d'une régression dans la version 6.0 qui faisait que la couverture par défaut était restituée en petit dans certains contextes
pt_br: Corrige uma regressão na versão 6.0 que fazia com que a capa padrão fosse renderizada pequena em alguns contextos

source: Various bug fixes related to the new dark/light icon theme switching. Make the icons more consistent even when using the system theme. Use calibre specific file type icons when using the non native file dialogs. Allow creating dark/light override icons manually in the configuration folder.
fr: Diverses corrections de bogues liées à la commutation du nouveau thème d'icône sombre/clair. Rendre les icônes plus cohérentes même en utilisant le thème système. Utilisation d'icônes de type de fichier spécifiques à calibre lors de l'utilisation des boîtes de dialogue de fichiers non natives. Possibilité de créer manuellement des icônes sombres et claires dans le dossier de configuration.
pt_br: Várias correções de bugs relacionados com o novo sistema de troca de temas escuro/claro. Torna os icons mais consistentes, mesmo ao usar o tema do sistema. Usa ícones específicos do calibre para tipos de arquivos ao usar o diálogo de arquivos não nativo. Permitir a criação de ícones de substituição escuro/claro manualmente na pasta de configuração.

source: Disable the color theme setting when using system style
fr: Désactiver le réglage du thème de couleur lors de l'utilisation du style système
pt_br: Desabilita a configuração do tema de cores ao usar o estilo do sistema

source: When using a fixed color palette and the system colors are of different type enforce the color palette
fr: Lorsque vous utilisez une palette de couleurs fixe et que les couleurs du système sont de type différent, appliquez la palette de couleurs
pt_br: Ao usar a paleta de cores fixas e as cores do sistema forem de tipo diferente, força o uso da paleta de cores

source: Ignore Qt generated application palette changes when using a fixed palette
fr: Ignorer les changements de palette des applications générées par Qt lors de l'utilisation d'une palette fixe
pt_br: Ignora alterações da paleta do aplicativo geradas pelo Qt ao usar uma paleta fixa

source: In the icon theme chooser dialog show light and dark themes only in the light and dark tabs
fr: Dans la boîte de dialogue du sélecteur de thèmes d'icônes, les thèmes clairs et foncés ne sont affichés que dans les onglets clairs et foncés
pt_br: No diálogo de seleção de temas de ícones, mostra apenas temas claros ou escuros nas respectivas abas claro e escuro

source: Welcome wizard: Fix device names not being translated correctly leading to the same name being repeated for some devices
fr: Assistant de bienvenue : Correction des noms de périphériques qui ne sont pas traduits correctement, ce qui entraîne la répétition du même nom pour certains périphériques
pt_br: Assistente de boas-vindas: Corrige o nome de dispositivos não sendo traduzidos corretamente, levando ao mesmo nome sendo repetido para alguns dispositivos

source: Read aloud: Fix spurious error message on Linux about voices not being installed
fr: Lire à haute voix : Correction d'un faux message d'erreur sous Linux indiquant que les voix ne sont pas installées
pt_br: Ler em voz alta: Corrige mensagem de erro espúria no Linux sobre vozes não instaladas

source: Linux binaries: Bundle brotli and graphite2 as well as Qt links against them
fr: Binaires Linux : Regroupement de brotli et graphite2 ainsi que des liens Qt contre eux
pt_br: Binários do Linux: Incorpora brotli e graphite2 bem como os links do Qt para eles

source: FTS dialog: When keyboard navigation changes the current item ensure it stays visible
fr: Boite de dialogue de la RTI : Lorsque la navigation au clavier modifie l'élément courant, celui-ci reste visible
pt_br: Diálogo Pesquisar no texto completo: Quando a navegação por teclado alterar o item atual, certifique-se de que ele permaneça visível

source: Binary builds: Fix Qt TLS backends not included
fr: Compilations binaires : Correction des backends TLS de Qt non inclus
pt_br: Compilação de binários: Corrige os backends TLS do Qt não sendo incluídos

source: Fix Qt WebEngine creating cache folders outside of the calibre cache directory
fr: Correction de Qt WebEngine créant des dossiers de cache en dehors du répertoire de cache de calibre
pt_br: Corrige o Qt WebEngine criando pastas de cache fora do diretórios de cache do calibre

source: Version 6.2.1 fixes a regression in 6.2.0 that caused the Read button in the Content server to only work for PDF books
fr: La version 6.2.1 corrige une régression de la version 6.2.0 qui faisait que le bouton Lire du serveur de contenu ne fonctionnait que pour les livres PDF
pt_br: A versão 6.2.1 corrige uma regressão na versão 6.2.0 que fazia com que o botão Ler no Servidor de conteúdo apenas funcionasse para livros em PDF

source: 16 Jul, 2022
fr: 16 juillet 2022
pt_br: 16 de Julho de 2022

source: Full text search: Add a button to re-index a book, useful if the book's contents have been changed outside calibre
fr: Recherche en texte intégral : Ajout d'un bouton pour réindexer un livre, utile si le contenu du livre a été modifié en dehors de calibre.
pt_br: Pesquisa no texto completo: Adiciona um botão para reindexar um livro, útil se o conteúdo do livro foi modificado fora do calibre

source: Search queries now support quoting using "docstrings" for easier escaping
fr: Les requêtes de recherche prennent désormais en charge de la mise sous guillemets à l'aide de "docstrings" pour faciliter l'échappement
pt_br: As pesquisas agora suportam citações usando "docstrings" para facilitar o escape

source: Linux installer: Check for libEGL as the QtGui module in Qt 6 links against it and many Linux servers don't have it installed
fr: Installateur Linux : Vérifier la présence de libEGL car le module QtGui de Qt 6 est lié à cette dernière et de nombreux serveurs Linux ne l'ont pas installé.
pt_br: Instalador Linux: Verifica a existência da libEGL, uma vez que o módulo QtGui no Qt 6 é vinculado a ele e muitos servidores Linux não têm ele instalado

source: macOS: Blacklist older versions of the DeDRM plugin as they caused crashes and failures to add books.
fr: macOS : Liste noire des anciennes versions du plugin DeDRM car elles provoquaient des plantages et des échecs d'ajout de livres.
pt_br: macOS: Coloca na lista negra versões antigas do plugin DeDRM, uma vez que elas causam travamentos e falhas ao adicionar livros.

source: Fix a regression in 6.0 that caused crashes in the Manage authors dialog
fr: Correction d'une régression dans 6.0 qui provoquait des plantages dans la boîte de dialogue Gérer les auteurs
pt_br: Corrige uma regressão na versão 6.0 que causava travamentos no diálogo Gerenciar autores

source: Fix a regression in 6.0 that broke touch screen interaction
fr: Correction d'une régression dans la version 6.0 qui interrompait l'interaction avec l'écran tactile
pt_br: Corrige uma regressão na versão 6.0 que danificou as interações de toque na tela

source: Fix a regression in 6.0 that caused a few checkboxes to stop working
fr: Correction d'une régression dans la version 6.0 qui entraînait l'arrêt du fonctionnement de quelques cases à cocher
pt_br: Corrige uma regressão na versão 6.0 que fazia com que algumas caixas de seleção parassem de funcionar

source: Linux: Fix a regression in 6.0 that broke handling of mouse clicks on some Wayland systems with a touchpad
fr: Linux : Correction d'une régression dans la version 6.0 qui empêchait la gestion des clics de souris sur certains systèmes Wayland dotés d'un pavé tactile
pt_br: Linux: Corrige uma regressão na versão 6.0 que danificou o manuseio de cliques do mouse em alguns sistemas Wayland com um touchpad

source: ToC Editor: Fix a regression in 6.0 that broke styling/images in the preview panel
fr: Éditeur de la TdC : Correction d'une régression dans la version 6.0 qui entraînait une rupture du style des images dans le panneau de prévisualisation
pt_br: Editor de Índice: Corrige uma regressão na versão 6.0 que danificou estilos/imagens no painel de pré-visualização

source: Windows: Fix window titlebars not dark in dark mode
fr: Windows : Correction des barres de titre des fenêtres qui ne sont pas foncées en mode nuit
pt_br: Windows: Corrige a barra de títulos de janelas não aparecendo escuras no modo escuro

source: Full text search: Show a warning when indexing/searching a library on an FAT drive
fr: Recherche en texte intégral : Affichage d'un avertissement lors de l'indexation/recherche d'une bibliothèque sur un lecteur FAT
pt_br: Pesquisa no texto completo: Mostra um alerta ao indexar/pesquisar uma biblioteca em disco FAT

source: News download: Do not add aborted/failed article titles to the comments metadata
fr: Téléchargement d'actualités : Ne pas ajouter les titres des articles avortés/échoués aux métadonnées des commentaires
pt_br: Download de Notícias: Não adicionar o título de artigos que abortaram/falharam aos metadados de comentários

source: Full text search: Fix books edited with the Edit book tool not being automatically re-indexed
fr: Recherche en texte intégral : Correction des livres édités avec l'outil d'édition de livres qui ne sont pas automatiquement réindexés
pt_br: Pesquisa no texto completo: Corrige livros editados com a ferramenta Editar livro não sendo automaticamente reindexados

source: HTML Input: Fix handling of deeply nested files on Windows
fr: Format HTML en entrée : Correction de la gestion des fichiers profondément imbriqués sous Windows
pt_br: Entrada HTML: Corrige o manuseio de arquivos profundamente aninhados no Windows
