Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Allow assigning a keyboard shortcut in Preferences-&gt;Shortcuts to open the data folder of a book
fr: Permettre d'assigner un raccourci clavier dans les Préférences-&gt;Raccourcis pour ouvrir le dossier de données d'un livre
pt_br: Permite designar um atalho de teclado em Preferências-&gt;Atalhos para abrir a pasta de arquivos extras do livro

source: Various improvements to syntax highlighting for the Markdown long text editor
fr: Diverses améliorations de la coloration syntaxique pour l'éditeur de texte long Markdown
pt_br: Várias melhorias no realce de sintaxe para o editor de texto longo Markdown

source: Fix a regression in 6.16 that broke restoring of the database
fr: Solutionner une régression de la version 6.16 qui a cassé la restauration de la base de données
pt_br: Corrige uma regressão na versão 6.16 que danificou a restauração da base de dados

source: Tag browser: Fix using F2 to edit items not allowing completion
fr: Explorateur d'étiquettes : Correction de l'utilisation de F2 pour éditer des éléments ne permettant pas l'auto-complétions
pt_br: Navegador de etiquetas: Corrige o uso de F2 para editar itens não permitindo autocompletar

source: Book details: Fix formatting of text when copying all book details in narrow mode
fr: Détails du livre : Correction du formatage du texte lors de la copie de tous les détails d'un livre en mode étroit
pt_br: Detalhes do livro: Corrige formatação do texto ao copiar todos os detalhes do livro no modo estreito

source: Book details: Fix copy all not respecting line breaks in fields
fr: Détails du livre : Correction du non-respect des sauts de ligne dans les champs
pt_br: Detalhes do livro: Corrige a opção de copiar tudo não respeitando as quebras de linha nos campos

source: Fix a regression in previous release that broke scrolling when using the scroll_per_row tweak
fr: Correction d'une régression dans la version précédente qui cassait le défilement lors de l'utilisation de l'ajustement scroll_per_row
pt_br: Corrige uma regressão na versão anterior que danificou a rolagem ao usar o ajuste scroll_per_row

source: Fix a regression in the previous release that broke the category manager dialog in some situations
fr: Correction d'une régression dans la version précédente qui cassait le dialogue du gestionnaire de catégories dans certaines situations
pt_br: Corrige uma regressão na versão anterior que danificou o diálogo Gerenciar categorias em algumas situações

source: 6.18.1 fixes a regression that broke setting metadata and generating PDF files in the macOS and Linux binary builds
fr: 6.18.1 corrige une régression qui empêchait la définition des métadonnées et la génération de fichiers PDF dans les versions binaires de macOS et Linux
pt_br: 6.18.1 corrige uma regressão que danificou a definição de metadados e geração de arquivos PDF nas versões para macOS e Linux

source: 26 Apr, 2023
fr: 26 avril 2023
pt_br: 26 de Abril de 2023

source: Font subsetting: Add support for WOFF format fonts and CID keyed fonts. Also further reduce file sizes when subsetting
fr: Sous-ensemble de polices : Ajout de la prise en charge des polices au format WOFF et des polices à clé CID. Réduction supplémentaire de la taille des fichiers lors du sous-ensemble
pt_br: Subconjunto de fontes: adiciona suporte para fontes de formato WOFF e fontes com chave CID. Além disso, reduz ainda mais o tamanho dos arquivos de subconjuntos

source: Book details: Show a link to open the data files folder when data files are present
fr: Détails du livre : Afficher un lien pour ouvrir le dossier des fichiers de données lorsque des fichiers de données sont présents
pt_br: Detalhes do livro: Mostra um link para abrir a pasta dos arquivos extras quando estes estão presentes

source: Template language: Add various functions to query the extra files associated with a book
fr: Langage de modèle : Ajout de diverses fonctions pour interroger les fichiers supplémentaires associés à un livre
pt_br: Linguagem de modelo: Adiciona várias funções para consultar os arquivos extras associados com um livro

source: Edit book: Compress images: Support compression of images in the WEBP format as well
fr: Éditer le livre : Compression d'images : Prise en charge de la compression d'images au format WEBP également
pt_br: Editar livro: Compressão de imagens: Suporta compressão de imagens no formato WEBP também

source: Comments editor: Add buttons to create links to data files and also to folders easily when inserting a link
fr: Éditeur de commentaires : Ajout de boutons permettant de créer facilement des liens vers des fichiers de données et des dossiers lors de l'insertion d'un lien.
pt_br: Editor de comentários: Adiciona botões para criar facilmente links para arquivos extras e também para pastas ao inserir um link

source: Allow displaying the id, formats and path builtin columns via Preferences-&gt;Add your own columns
fr: Permettre l'affichage des colonnes intégrées id, formats et chemin via les Préférences-&gt;Ajouter vos propres colonnes
pt_br: Permite exibir as colunas padrão de id, formatos e caminho via Preferências-&gt;Adicionar suas próprias colunas

source: Trash bin: Add a button to clear the bin
fr: Corbeille : Ajouter un bouton pour vider la corbeille
pt_br: Lixeira: Adiciona um botão para limpar a lixeira

source: Metadata editor: Use a dedicated editor with preview for custom columns that store Markdown formatted text
fr: Éditeur de métadonnées : Utilisez un éditeur dédié avec prévisualisation pour les colonnes personnalisées qui stockent du texte au format Markdown
pt_br: Editor de metadados: Usa um editor dedicado com pré-visualização para colunas personalizadas que armazenam texto formatado em Markdown

source: Fix a regression in the previous release that could result in empty author folders remaining in the library when the author of a book is changed
fr: Correction d'une régression dans la version précédente qui pouvait entraîner le maintien de dossiers d'auteur vides dans la bibliothèque lorsque l'auteur d'un livre était modifié
pt_br: Corrige uma regressão na versão anterior que poderia resultar em pastas de autores vazias sobrando na biblioteca quando o author de um livro fosse alterado

source: Fix the data files associated with a book not being handled when using the Merge books and Copy to library functions
fr: Correction des fichiers de données associés à un livre qui ne sont pas traités lors de l'utilisation des fonctions "Fusionner les livres" et "Copier dans la bibliothèque"
pt_br: Corrige os arquivos extras associados com um livro não sendo manipulados ao usar as funções de Mesclar livros e Copiar para biblioteca

source: Fix a regression in the previous release that broke some operations in the Manage tags/authors/etc. dialogs
fr: Correction d'une régression dans la version précédente qui interrompait certaines opérations dans les boîtes de dialogue Gérer les tags/auteurs/etc.
pt_br: Corrige uma regressão na versão anterior que danificou algumas operações nos diálogos Gerenciar etiquetas/autores/etc

source: Ensure metadata.opf is always written when deleting book even if it is not sequenced for backup
fr: S'assurer que le fichier metadata.opf est toujours écrit lors de la suppression d'un livre, même s'il n'est pas séquencé pour la sauvegarde
pt_br: Certifica-se de que o arquivo metadata.opf seja sempre gravado ao apagar um livro, mesmo que não esteja na sequência para backup

source: 20 Apr, 2023
fr: 22 avril 2023
pt_br: 20 de Abril de 2023

source: Allow storing extra data files with a book
fr: Permettre le stockage de fichiers de données supplémentaires avec un livre
pt_br: Permite armazenar arquivos extras com o livro

source: Right click the Add books button to add arbitrary files as "data files" to a book record. These are managed by calibre along with the book files, but cannot be used for conversion/viewing. Select a book and press the "O" key to view the data files in your file explorer.
fr: Cliquez avec le bouton droit de la souris sur le bouton Ajouter des livres pour ajouter des fichiers arbitraires en tant que "fichiers de données" à un enregistrement de livre. Ces fichiers sont gérés par Calibre en même temps que les fichiers du livre, mais ne peuvent pas être utilisés pour la conversion/l'affichage. Sélectionnez un livre et appuyez sur la touche "O" pour visualiser les fichiers de données dans votre explorateur de fichiers.
pt_br: Clique com o botão direito no botão Adicionar livros para adicionar arquivos arbitrários como "arquivos extras" ao registros do livro. Estes são gerenciados pelo calibre juntamente com os arquivos dos livros, mas não podem ser usados para conversão/visualização. Selecione um livro e pressione a tecla "O" para visualizar os arquivos extras no seu explorador de arquivos.

source: Allow undoing the deletion of books from the calibre library
fr: Permettre d'annuler la suppression de livres de la bibliothèque calibre
pt_br: Permite desfazer a eliminação de livros da biblioteca do calibre

source: Now deleted books are stored in a calibre "Trash bin" from which they can be restored with a single click. To view the trash bin, right click the "Remove books" button.
fr: Les livres supprimés sont désormais stockés dans la "corbeille" de calibre, à partir de laquelle ils peuvent être restaurés d'un simple clic. Pour afficher la corbeille, cliquez avec le bouton droit de la souris sur le bouton "Supprimer des livres".
pt_br: Agora livros apagados são armazenados em uma "Lixeira" do calibre, de onde podem ser restaurados com um único clique. Para ver a lixeira, clique com o botão direito no botão "Remover livros".

source: Kobo driver: Add support for the new Kobo Elipsa 2E
fr: Pilote Kobo : Prise en charge du nouveau Kobo Elipsa 2E
pt_br: Driver do Kobo: Adiciona suporte para o novo Kobo Elipsa 2E

source: Book details: if an item has an associated link then offer that link in the item's context menu
fr: Détails du livre : si un élément a un lien associé, ce lien est proposé dans le menu contextuel de l'élément
pt_br: Detalhes do livro: se um item tem um link associado, então oferece este link no menu de contexto do item

source: Content server viewer: Fix end of chapter content being occasionally skipped when scrolling by screen full with multiple pages
fr: Visionneuse du serveur de contenu : Correction du saut occasionnel du contenu de fin de chapitre lors du défilement d'un plein écran de plusieurs pages
pt_br: Visualizador do Servidor de conteúdo: Corrige o final do capítulo sendo ocasionalmente pulado ao rolar por tela cheia com múltiplas páginas

source: E-book viewer: Fix a regression that caused notes from a different highlights to be shown in some situations
fr: Visionneuse de livres numériques : Correction d'une régression qui entraînait l'affichage de notes provenant d'une mise en évidence différente dans certaines situations
pt_br: Visualizador de e-books: Corrige uma regressão que fazia com que notas de outro destaque fossem mostradas em algumas situações

source: E-book viewer: Show an error if the user tries to search for only punctuation or spaces in the search modes that ignore these
fr: Visionneuse de livres numériques : Afficher une erreur si l'utilisateur tente de rechercher uniquement la ponctuation ou les espaces dans les modes de recherche qui les ignorent
pt_br: Visualizador de e-books: Exibe um erro caso o usuário tente buscar apenas pontuações ou espaços nos modos de pesquisa que ignoram estes

source: Fix custom columns not showing in Book details links from other libraries
fr: Correction des colonnes personnalisées qui ne s'affichent pas dans les liens de détails de livres provenant d'autres bibliothèques
pt_br: Corrige colunas personalizadas que não são exibidas nos links de Detalhes do livro de outras bibliotecas

source: 07 Apr, 2023
fr: 07 avril 2023
pt_br: 07 de Abril de 2023

source: Allow adding external links to tags, series, publishers, etcetera in addition to authors
fr: Permettre l'ajout de liens externes à des tags, des séries, des éditeurs, etc. en plus des auteurs
pt_br: Permite adicionar links externos para etiquetas, séries, editoras, etc em adição aos autores

source: The links show up as click-able icons in the book details panel. They can be set by right clicking the author/tag/etc. in the Tag browser and choosing "Manage"
fr: Les liens apparaissent sous forme d'icônes cliquables dans le panneau des détails du livre. Ils peuvent être définis en cliquant avec le bouton droit de la souris sur l'auteur/l'étiquette/etc. dans le Navigateur d'étiquettes et en choisissant "Gérer"
pt_br: Os links aparecem como ícones clicáveis no painel de detalhes do livro. Eles podem ser definidos clicando com o botão direito em autor/etiqueta/etc no Navegador de etiquetas e escolhendo "Gerenciar"

source: calibre:// URL scheme: Add support for a new type of URL that pops up the metadata of the specified book in a new window
fr: calibre:// Schéma d'URL : Ajout de la prise en charge d'un nouveau type d'URL qui affiche les métadonnées du livre spécifié dans une nouvelle fenêtre
pt_br: Esquema de URLs calibre://: Adiciona suporte para um novo tipo de URL que exibe os metadados de um livro específico em uma nova janela

source: Works even with books not in the current library. See <a href="%(h0)s">%(h0)s</a> for details
fr: Fonctionne même avec des livres qui ne font pas partie de la bibliothèque actuelle. Voir <a href="%(h0)s">%(h0)s</a> pour plus de détails
pt_br: Funciona até mesmo com livros que não estejam na biblioteca atual. Veja <a href="%(h0)s">%(h0)s</a> para detalhes

source: EPUB Output: Do not shrink images to fit the screen size by default, as modern readers do this themselves well enough. Can be controlled via an option in the EPUB Output section of the conversion dialog
fr: Sortie EPUB : Les images ne sont pas réduites par défaut pour s'adapter à la taille de l'écran, car les lecteurs modernes le font eux-mêmes suffisamment bien. Cette option peut être contrôlée dans la section Sortie EPUB de la boîte de dialogue de conversion
pt_br: Saída EPUB: Não diminuir imagens para se enquadrar no tamanho da tela por padrão, uma vez que leitores modernos fazem isso por si mesmos de maneira boa o suficiente. Pode ser controlado via opção na seção de Saída EPUB do diálogo de conversão

source: Edit metadata dialog: Add buttons to pop up the category editing windows easily
fr: Dialogue Editer les métadonnées : Ajout de boutons pour faire apparaître facilement les fenêtres d'édition des catégories
pt_br: Diálogo de edição de metadados: Adiciona botões para abrir a janela de edição de categorias facilmente

source: Metadata download: Allow specifying rules to transform publisher names in addition to author and tag names
fr: Téléchargement de métadonnées : Permet de spécifier des règles pour transformer les noms d'éditeurs en plus des noms d'auteurs et de tags
pt_br: Download de metadados: Permite especificar regras para transformar o nome de editoras, além de autores e etiquetas

source: Edit metadata dialog: Use both a colored border and an icon to indicate errors in line edits
fr: Boîte de dialogue Editer les métadonnées : Utilisation d'une bordure colorée et d'une icône pour indiquer les erreurs dans les modifications de lignes
pt_br: Diálogo de edição de metadados: Usa tanto uma borda colorida quanto um ícone para indicar erros nas edições

source: A new tweak in Preferences-&gt;Tweaks to control what program is run when clicking on URLs in calibre
fr: Un nouveau réglage dans les Préférences-&gt;Ajustements pour contrôler quel programme est exécuté lorsque l'on clique sur des URL dans calibre
pt_br: Um novo ajuste em Preferências-&gt;Ajustes para controlar que programa é executado ao clicar em URLs no calibre

source: E-book viewer: Fix a regression that caused incorrect highlight collision detection in some books
fr: Visionneuse de livres numériques : Correction d'une régression qui entraînait une détection incorrecte des collisions des mises en évidences dans certains livres
pt_br: Visualizador de e-books: Corrige uma regressão que fez com que a detecção de sobreposição de destaques fosse incorreta em alguns livros

source: E-book viewer: Fix images embedded inside SVG tags not available for viewing in a pop-up
fr: Visionneuse de livres numériques : Correction des images intégrées dans des balises SVG qui ne sont pas disponibles dans une fenêtre contextuelle
pt_br: Visualizador de e-books: Corrige imagens incorporadas dentro de tags SVG não disponíveis para visualização na janela pop-up

source: DOCX Input: Do not ignore images that are present as fallbacks for a word drawing object
fr: Entrée DOCX : Ne pas ignorer les images qui sont présentes en tant qu'objets de remplacement pour un objet de dessin de mots
pt_br: Entrada DOCX: Não ignora images que estão presentes como substitutos para um objeto de desenho do Word

source: Comic Input: When converting grayscaled PNG images to PNG ensure output images are stored as indexed PNG
fr: Format bande dessinée : Lors de la conversion d'images PNG à échelle de gris en PNG, les images de sortie sont stockées sous forme de PNG indexé
pt_br: Entrada HQ: Ao converter imagens PNG em escala de cinza para PNG, certificar-se de que as imagens de saída são armazenadas como PNG indexado

source: Fix active tab not easy to distinguish in dark mode
fr: Correction de l'onglet actif qui n'est pas facile à distinguer en mode sombre
pt_br: Corrige a aba ativa difícil de distinguir no modo escuro

source: Content server: Fix re-opening book from home page after making progress not opening to correct last read position when a user is logged in
fr: Serveur de contenu : Correction de la réouverture d'un livre à partir de la page d'accueil après avoir progressé et qui ne s'ouvre pas à la position correcte de la dernière lecture lorsque l'utilisateur est connecté
pt_br: Servidor de conteúdo: Corrige a reabertura de livros a partir da página inicial, após fazer algum progresso, não abrindo na última posição lida corretamente, quando um usuário está conectado

source: Comments editor: When copying to clipboard, copy clean HTML rather than the junk Qt produces
fr: Éditeur de commentaires : Lors de la copie dans le presse-papiers, copier du HTML propre plutôt que les saletés produites par Qt
pt_br: Editor de comentários: Ao copiar para a área de transferência, copia HTML limpo em vez do lixo que o Qt produz

source: Version 6.15.1 fixes an issue with the new URL scheme popping up incorrect book details windows
fr: La version 6.15.1 corrige un problème avec le nouveau schéma d'URL qui fait apparaître des fenêtres de détails de livres incorrectes
pt_br: A versão 6.15.1 corrige um erro com o novo esquema de URL abrindo detalhes de livros incorretos no Windows

source: 16 Mar, 2023
fr: 16 mars 2023
pt_br: 16 de março de 2023

source: Edit metadata: When setting a cover from comic files allow choosing which page to use as the cover
fr: Editer les métadonnées : Lors de la création d'une couverture à partir de fichiers de bandes dessinées, il est possible de choisir la page à utiliser comme couverture
pt_br: Editar metadados: Ao definir uma capa para arquivos HQ, permite escolher qual página usar como capa

source: Allow display of columns built from other columns as comments in Book details
fr: Permettre l'affichage de colonnes construites à partir d'autres colonnes sous forme de commentaires dans les détails du livre
pt_br: Permite a exibição de colunas construída a partir de outras colunas como comentários nos Detalhes do livro

source: Comments editor: Add a shortcut for "Paste and match style" (Ctrl+Shift+V)
fr: Éditeur de commentaires : Ajout d'un raccourci pour « Coller et faire correspondre le style » (Ctrl+Shift+V)

source: macOS: ToC Editor: Fix mouse becoming unusable when trying to create a new entry
fr: macOS : Éditeur TdC : Correction de la souris devenant inutilisable lors de la création d'une nouvelle entrée
pt_br: macOS: Editor de Índice: Corrige o mouse não funcionando ao tentar criar uma nova entrada

source: When computing title sorts strip leading and trailing quotes, not just leading quotes
fr: Lors du calcul du tri des titres, les guillemets de tête et de queue sont supprimés, et pas seulement les guillemets de tête
pt_br: Ao computar o ordenamento de títulos, remove aspas de abertura e fechamento, não apenas as de abertura

source: Content server viewer: Fix searching only showing results from the current chapter onwards
fr: Visionneuse du serveur de contenu : Correction de la recherche n'affichant les résultats qu'à partir du chapitre en cours
pt_br: Visualizador do Servidor de conteúdo: Corrige a busca mostrando apenas resultados do capítulo atual em diante

source: Check book: Fix some incorrect line numbers reported in a few CSS error messages
fr: Vérifier le livre : Correction de certains numéros de ligne incorrects signalés dans quelques messages d'erreur CSS
pt_br: Verificar livro: Corrige alguns números de linhas incorretos reportadas em algumas mensagens de erro no CSS

source: Fix regression in 6.14.0 that caused some generated resources to be excluded from the calibre source bundle
fr: Correction d'une régression dans la version 6.14.0 qui provoquait l'exclusion de certaines ressources générées du bundle source de calibre
pt_br: Corrige uma regressão na versão 6.14.0 que fez com que alguns recursos gerados fossem excluídos do pacote fonte do calibre

source: Fix regression in 6.14.0 that broke using paths with single quotes in them for the calibre library
fr: Correction d'une régression dans la version 6.14.0 qui empêchait l'utilisation de chemins avec des guillemets simples dans la bibliothèque calibre
pt_br: Corrige uma regressão na versão 6.14.0 que danificou o uso de caminhos com aspas simples para a biblioteca do calibre

source: Fix ToC Editor on macOS in 6.14.0 not working inside the Edit book tool only
fr: Correction de l'éditeur TdC sur macOS dans la version 6.14.0 qui ne fonctionne pas uniquement dans l'outil Éditer le livre
pt_br: Corrige o Editor de Índice no macOS na versão 6.14.0 não funcionando dentro da ferramenta Editar livro

source: 17 Feb, 2023
fr: 17 février 2023
pt_br: 17 de fevereiro de 2023

source: Content server: E-book viewer: Long tapping on an image now causes it to be displayed in an internal popup rather than a new window as some browsers block the creation of new windows
fr: Serveur de contenu : Visionneuse de livres numériques : L'appui long sur une image provoque désormais son affichage dans une fenêtre contextuelle interne plutôt que dans une nouvelle fenêtre, car certains navigateurs bloquent la création de nouvelles fenêtres
pt_br: Servidor de conteúdo: Visualizador de e-books: Um toque longo em uma minha imagem agora faz com que ela seja exibida em um pop-up interno, em vez de uma nova janela, uma vez que alguns navegadores bloqueiam a criação de novas janelas

source: E-book viewer: Fix some adjacent highlights with nothing in between them not being displayed.
fr: Visionneuse de livres numériques : Correction de certaines mises en évidences adjacentes sans rien entre elles qui ne s'affichaient pas
pt_br: Visualizador de e-books: Corrige alguns destaques adjacentes com nada entre eles não sendo exibidos

source: Content server: Workaround for Safari regression causing bookmarks to disappear on reload
fr: Serveur de contenu : Solution de contournement pour la régression de Safari entraînant la disparition des signets lors du rechargement
pt_br: Servidor de conteúdo: Solução alternativa para uma regressão do Safari fazendo com que marcadores desaparecessem ao recarregar
