Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: AZW3 Input: Fix rare AID based links not working.
fr: Format AZW3 en entrée : Correction des rares liens basés sur l'AID qui ne fonctionnent pas.
pt_br: Entrada AZW3: Corrige raros links baseados em AID não funcionando

source: E-book viewer: Fix clock in header/footer not using system time format
fr: Visionneuse de livres numériques : Correction de l'horloge dans l'en-tête/le pied de page n'utilisant pas le format de l'heure système
pt_br: Visualizador de e-books: Corrige relógio em cabeçalho/rodapé não utilizando o formato de horário do sistema

source: Windows: Fix Read aloud not working with books that have a single large internal text file, such as MOBI or DOCX books
fr: Windows : Correction de Lecture à voix haute ne fonctionnant pas avec les livres qui ont un seul gros fichier texte interne, comme les livres MOBI ou DOCX
pt_br: Windows: Corrige Leitura em voz alta não funcionando em livros que possuam um único grande arquivo interno de texto, como livros em MOBI ou DOCX

source: PDF Output: Fix a regression causing conversion to fail when typesetting Chinese text
fr: Format PDF en sortie : Correction d'une régression entraînant l'échec de la conversion lors de la composition du texte chinois
pt_br: Saída PDF: Corrige uma regressão causando falha na conversão ao compor texto em Chinês

source: Amazon metadata download: Fix no results being found when using the automatic or Google servers because of a change in the markup of the Google search results page.
fr: Téléchargement de métadonnées Amazon : Correction d'un problème d'absence de résultats lors de l'utilisation du serveur automatique ou Google en raison d'une modification du balisage de la page de résultats de recherche Google.
pt_br: Download de metadados da Amazon: Corrige nenhum resultado sendo encontrado ao usar o servidor como automático ou Google, por conta de uma alteração no código da página de resultados de pesquisa do Google.

source: Version 5.8.1 fixes a couple of regressions that broke the Save to disk function and changing Page layout settings in the viewer.
fr: La version 5.8.1 corrige quelques régressions qui empêchaient la fonction d'enregistrement sur disque et la modification des paramètres de mise en page dans la visionneuse.
pt_br: A versão 5.8.1 corrige algumas regressões que danificaram a função Salvar no disco e configuração do Layout de página no visualizador.

source: 12 Dec, 2020
fr: 12 décembre 2020
pt_br: 12 de Dezembro de 2020

source: E-book viewer: Add a "Read aloud" function that works via the operating system's Text-to-speech engine.
fr: Visionneuse de livres numériques : Ajout d'une fonction "Lire à voix haute" qui fonctionne via le moteur de synthèse vocale du système d'exploitation.
pt_br: Visualizador de e-books: Adiciona a função "Ler em voz alta", que funciona através do mecanismo de Texto-para-fala do sistema operacional.

source: Click the "Read aloud" button in the viewer controls to start reading the book text aloud from the current page.
fr: Cliquer sur le bouton "Lire à voix haute" dans les commandes de la visionneuse pour commencer à lire le texte du livre à voix haute à partir de la page en cours.
pt_br: Clique no botão "Ler em voz alta" nos controles do visualizador para iniciar a leitura do texto do livro a partir da página atual.

source: A new busy spinner for waiting animations
fr: Une nouvelle file d'attente pour les animations
pt_br: Uma nova animação de espera

source: Edit metadata: Add buttons to easily set yes/no fields also shortcut to clear the field.
fr: Modifier les métadonnées : Ajout de boutons pour définir facilement des champs oui/non, ainsi qu'un raccourci pour vider le champ.
pt_br: Editar metadados: Adiciona botões para definir facilmente campos sim/não, além de atalhos para limpar o campo.

source: PDF Output: Fix a regression in the previous release that broke text rendering for some fonts due to a bug in Qt WebEngine (full fix is in 5.7.2).
fr: Format PDF en sortie : Correction d'une régression dans la version précédente qui empêchait le rendu du texte pour certaines polices en raison d'un bogue dans Qt WebEngine (correction complète dans la version 5.7.21).
pt_br: Saída PDF: Corrige uma regressão na versão anterior que danificou a renderização de texto para algumas fontes devido a um bug no Qt WebEngine (correção completa na versão 5.7.2).

source: PDF Output: Fix conversion failing when adding header/footer and the input document defines margins/padding on the &lt;html&gt; tag.
fr: Format PDF en sortie : Correction d'un échec de conversion lors de l'ajout de l'en-tête/du pied de page et que le document d'entrée définit les marges/le calage sur la balise &lt;html&gt ;.
pt_br: Saída PDF: Corrige falha na conversão ao adicionar cabeçalho/rodapé e o documento de entrada define margens/preenchimento na tag &lt;html&gt;.

source: Windows: Fix the case of library names in copied calibre:// links sometimes incorrect.
fr: Windows : Correction de la casse parfois incorrecte des noms de bibliothèques dans les liens calibre:// copiés.
pt_br: Windows: Corrige maiúsculas/minúsculas em nomes de biblioteca copiados via links calibre:// de forma incorreta.

source: AZW3 Input: Fix a regression in calibre 5 that broke processing of files with inline flow replacements.
fr: Format AZW3 en entrée : Correction d'une régression dans calibre 5 qui interrompait le traitement des fichiers avec des remplacements de flux en ligne.
pt_br: Entrada AZW3: Corrige regressão no calibre 5 que danificou o processamento de arquivos com substituição de fluxo em linha.

source: Fix hiding and showing Book details panel changes its size by a pixel or two.
fr: Correction du masquage et de l'affichage des Détails du livre : le panneau changeait de taille d'un pixel ou deux.
pt_br: Corrige mostrar e ocultar painel de Detalhes do livro mudando seu tamanho em um pixel ou dois.

source: Get books: Fix amazon.fr not working because of website changes.
fr: Obtenir des livres : Correction du dysfonctionnement d'amazon.fr en raison de changements apportés au site web.
pt_br: Obter livros: Corrige amazon.fr não funcionando por conta de alterações no site.

source: Bulk metadata search/replace: Fix text transform function not being applied to the test result in character mode
fr: Recherche/remplacement de métadonnées par lots : Correction de la fonction de transformation du texte qui n'est pas appliquée au résultat du test en mode caractère
pt_br: Buscar/substituir metadados em massa: Corrige função de transformação de texto não sendo aplicada ao o resultado do teste no modo de correspondência de caractere.

source: Book list: Improve rendering of column headers when they don't fit, by eliding them instead of just cutting off rendering.
fr: Liste de livres : Amélioration du rendu des en-têtes de colonne lorsqu'ils ne s'adaptent pas, en les élisant au lieu de simplement couper le rendu.

source: Fix template function "first_non_empty" fails if no argument evaluates non-empty
fr: Correction de la fonction de modèle "first_non_empty" qui échoue si aucun argument n'évalue le non-empty
pt_br: Corrige função de modelo "first_non_empty" falhando se nenhum argumento avalia em não-vazio

source: Fix regression in 5.7.0 causing failure to start if one of the previously used libraries had a stored path ending in a slash.
fr: Correction d'une régression dans la version 5.7.0 entraînant un échec au démarrage si l'une des bibliothèques utilisées précédemment avait un chemin d'accès stocké se terminant par une barre oblique.
pt_br: Corrige regressão na versão 5.7.0 causando falha na inicialização se uma das bibliotecas utilizadas anteriormente possuíssem um caminho terminando em uma barra.

source: 27 Nov, 2020
fr: 27 novembre 2020
pt_br: 27 de Novembro de 2020

source: Edit book: Show a non-modal popup for a few seconds to allow undoing file delete operations
fr: Éditer le livre : Afficher un popup non modal pendant quelques secondes pour permettre d'annuler les opérations de suppression de fichiers
pt_br: Editar livro: Exibe um pequeno popup por alguns segundos que permite desfazer a remoção de arquivos

source: Device books view: Add an action to the context menu to easily jump to the matching book in the calibre library view
fr: Vue des livres du périphérique : Ajout d'une action au menu contextuel pour accéder facilement au livre correspondant dans la vue bibliothèque de calibre
pt_br: Visualização de livros no dispositivo: Adiciona uma ação ao menu de contexto para facilmente saltar para o livro correspondente na visualização da biblioteca do calibre

source: Add ability to undo Generate cover in the Edit metadata screen, by long clicking the Generate cover button
fr: Ajout de la possibilité d'annuler la génération de la couverture dans l'écran Modifier les métadonnées, en cliquant longuement sur le bouton Générer la couverture
pt_br: Adiciona a possibilidade de desfazer Gerar capa na tela Editar metadados, ao clicar com o botão direito no botão Gerar capa

source: Edit book: Allow adding tags to the list of tags for the insert tag button
fr: Éditer le livre : Permettre d'ajouter des balises à la liste des balises pour le bouton d'insertion
pt_br: Editar livro: Permite adicionar tags à lista de tags ao botão Inserir tag

source: calibredb add: New option --automerge to automatically merge duplicates
fr: calibredb ajouter : Nouvelle option --automerge pour fusionner automatiquement les doublons
pt_br: calibredb add: Nova opção --automerge para mesclar itens duplicados automaticamente

source: Add an edit notes action to the context menu in the viewer highlights panel
fr: Ajout d'une action d'édition de notes au menu contextuel dans le panneau des mises en évidence de la visionneuse
pt_br: Adiciona uma ação para editar notas ao menu de contexto no painel de destaques do visualizador

source: Content server viewer: Allow viewing images in a new window by right clicking them, matches the calibre builtin viewer behavior
fr: Visionneuse du serveur de contenu : Permettre de visualiser les images dans une nouvelle fenêtre en cliquant avec le bouton droit de la souris, correspond au comportement de la visionneuse intégrée à calibre
pt_br: Visualizador do Servidor de conteúdo: Permite ver imagens em uma nova janela ao clicar nelas com o botão direito, correspondendo ao comportamento do visualizador do calibre

source: Book details window: Allow opening the edit metadata window using either the keyboard shortcut or the context menu
fr: Fenêtre de détails du livre : Permettre d'ouvrir la fenêtre de modification des métadonnées en utilisant soit le raccourci clavier, soit le menu contextuel
pt_br: Janela de detalhes do livro: Permite abrir a janela de edição de metadados usando tanto o atalho de teclado ou menu de contexto

source: Allow copying the current search as a calibre:// URL by right clicking the search box
fr: Permettre de copier la recherche actuelle en tant qu'URL calibre:// en cliquant avec le bouton droit de la souris sur la case de recherche
pt_br: Permite copiar a busca atual como um URL calibre:// clicando com o botão direito na caixa de pesquisa

source: Book details panel: Add entries to copy calibre:// links for the current book to the context menu
fr: Panneau de détails du livre : Ajout d'entrées pour copier les liens calibre:// du livre en cours dans le menu contextuel
pt_br: Painel de detalhes do livro: Adiciona entradas para copiar links calibre:// para o livro atual no menu de contexto

source: Edit book: Upgrade book: Ask whether to keep the NCX based Table of Contents
fr: Éditer le livre : Mise à jour du livre : Demander s'il faut conserver la Table des Matières basée sur NCX
pt_br: Editar livro: Upgrade do livro: Pergunta se o Índice NCX deve ser mantido

source: Windows: Fix calibre portable launcher not working correctly from root folder in calibre 5.5
fr: Windows : Correction du lanceur portable de calibre 5.5 qui ne fonctionne pas correctement à partir du dossier racine
pt_br: Windows: Corrige o lançador do calibre portátil não funcionando corretamente a partir da pasta raiz no calibre 5.5

source: macOS: Fix rendering of space after punctuation incorrect in Big Sur
fr: macOS : Correction du rendu de l'espace après une ponctuation dans Big Sur
pt_br: macOS: Corrige renderização de espaço após pontuação incorreta no Big Sur

source: DOCX Input: When converting images placed using the obsolete VML markup default them to being inline rather than block images
fr: Format DOCX en entrée : Lors de la conversion d'images placées à l'aide du balisage obsolète VML, les images sont par défaut en ligne plutôt qu'en bloc
pt_br: Entrada DOCX: Ao converter imagens posicionadas usando a marcação obsoleta VML, define como padrão imagens em linha, em vez de imagens em bloco

source: Metadata edit dialog: Fix keyboard shortcuts for bold/italic/underline not working when more than one comments editor widget is present on a single tab
fr: Boite de dialogue d'édition des métadonnées : Correction des raccourcis clavier pour les caractères gras/italiques/soulignés ne fonctionnant pas lorsque plusieurs widgets d'édition de commentaires sont présents sur un même onglet
pt_br: Diálogo Editar metadados: Corrige atalhos de teclado para negrito/itálico/sublinhado não funcionando quando mais de um editor de comentários está presente em uma única aba

source: When using calibre://show-book URLs and the book is not found, clear any Virtual library or search restriction and then show the book
fr: Lorsque de l'utilisation des URL calibre://show-book et que le livre n'est pas trouvé, effacez toute restriction de recherche ou de bibliothèque virtuelle, puis affichez le livre
pt_br: Ao usar URLs calibre://show-book e o livro não for encontrado, limpa a Biblioteca virtual ou restrição de busca e exibe o livro

source: macOS: Fix calibre:// URLs not working from other documents
fr: macOS : Correction des URL calibre:// ne fonctionnant pas à partir d'autres documents
pt_br: macOS: Corrige URLs calibre:// não funcionando a partir de outros documentos

source: Fix calibre:// URL search action not changing library if needed
fr: Correction de l'action de recherche d'URL calibre:// qui ne change pas de bibliothèque si nécessaire
pt_br: Corrige ação de busca com URL calibre:// não mudando a biblioteca, se necessário

source: annotation_count() template function displaying value for deleted annotations
fr: annotation_count() fonction modèle affichant la valeur des annotations supprimées
pt_br: Função de modelo annotation_count() exibindo valores para anotações apagadas

source: Edit book: Fix syntax highlighting not recognizing ends-with selector
fr: Éditer le livre : Correction du surlignage syntaxique ne reconnaissant pas les ruptures - avec sélecteur
pt_br: Editar livro: Corrige destaque de sintaxe não reconhecendo o seletor ends-with

source: 13 Nov, 2020
fr: 13 novembre 2020
pt_br: 13 de Novembro de 2020

source: Support the calibre:// URL scheme
fr: Prise en charge du système d'URL calibre://
pt_br: Suporte ao esquema de URL calibre://

source: Clicking on calibre:// URLs can be used to have calibre perform various actions. For details, see: <a href="%(h0)s">%(h0)s</a>
fr: En cliquant sur les URL calibre://, on peut faire exécuter diverses actions par calibre. Pour plus de détails, voir : <a href="%(h0)s">%(h0)s</a>
pt_br: Clicar em URLs calibre://pode ser usado para que o calibre realize várias ações. Para detalhes, veja: <a href="%(h0)s">%(h0)s</a>

source: Viewer: Show calibre:// URL for current book in the Goto-&gt;Location panel
fr: Visionneuse : Affichage de l'URL calibre:// pour le livre en cours dans le panneau Aller à-&gt;Emplacement
pt_br: Visualizador: Exibir URL calibre:// para o livro atual no painel Ir Para-&gt;Local

source: Edit book: Add an action to the right click menu for tabs to close tabs to the right of the current tab.
fr: Éditer le livre : Ajout d'une action dans le menu du clic droit pour les onglets afin de fermer les onglets à droite de l'onglet en cours.
pt_br: Editar livro: Adiciona uma ação para fechar abas à direita da atual ao clicar com o botão direito nas abas

source: Add ability to copy tag, publisher and author in Book details panel by right-clicking
fr: Ajout de la possibilité de copier l'étiquette, l'éditeur et l'auteur dans le panneau Détails du livre en cliquant avec le bouton droit de la souris
pt_br: Adiciona a capacidade de copiar etiquetas, editora e autor no painel de detalhes do livro, usando o clique com o botão direito

source: Annotations browser: Add a context menu for common actions.
fr: Navigateur d'annotations : Ajout d'un menu contextuel pour les actions communes.
pt_br: Navegador de anotações: Adiciona um menu de contexto para ações comuns.

source: Annotations browser: Show a dot for highlights with notes.
fr: Navigateur d'annotations :Afficher un point pour les mises en évidence avec notes.
pt_br: Navegador de anotações: Exibe um ponto nos destaques com notas.

source: Edit book: Saved searches panel: Allow copying the current saved search to the regular search panel by clicking the Export button.
fr: Éditer le livre : Panneau de recherches sauvegardées : Permettre de copier la recherche sauvegardée actuelle dans le panneau de recherche ordinaire en cliquant sur le bouton Exporter.
pt_br: Editar livro: Painel de buscas salvas: Permite copiar a busca salva atual para o painel de busca regular clicando no botão Exportar.

source: Windows: Fix command line arguments not working for the portable.exe launchers
fr: Windows : Correction des arguments de la ligne de commande ne fonctionnant pas pour les lanceurs de portable.exe
pt_br: Windows: Corrige argumentos de linha de comando não funcionando para os lançadores do portable.exe

source: Viewer: back and forward buttons on the mouse now trigger the back and forward actions
fr: Visionneuse : les boutons "Précédent" et "Suivant" de la souris déclenchent maintenant les actions "Précédent" et "Suivant
pt_br: Visualizador: botões de avançar e retroceder do mouse agora disparam as respectivas ações

source: Option to mark all books with annotations/bookmarks
fr: Option pour marquer tous les livres avec des annotations/signets
pt_br: Opção para marcar todos os livros com anotações/marcadores

source: Various minor improvements to how keyboard focus is handled in the Tag browser
fr: Diverses améliorations mineures de la gestion de la mise au point du clavier dans l'Explorateur d'étiquettes
pt_br: Várias pequenas melhorias em como o foco do mouse é processado no Navegador de etiquetas

source: Edit book: Fix regression in calibre 5 that caused an error when managing user dictionaries.
fr: Éditer le livre : Correction d'une régression de calibre 5 qui provoquait une erreur lors de la gestion des dictionnaires utilisateurs.
pt_br: Editar livro: Corrige regressão no calibre 5 que causava um erro ao gerenciar dicionários do usuário.

source: Viewer: Fix previous/next buttons iterating over removed bookmarks
fr: Visionneuse : Correction des boutons précédents/suivants qui se répètent sur les signets supprimés
pt_br: Visualizador: Corrige botões anterior/próximo passando por marcadores removidos

source: Welcome wizard: Fix changing the language causing a empty folder to be created.
fr: Assistant de bienvenue : Correction du changement de langue entraînant la création d'un dossier vide.
pt_br: Assistente de boas-vindas: Corrige mudança do idioma fazendo com que uma pasta vazia fosse criada.

source: Viewer: Fix regression causing custom shortcuts with Shift key pressed not working
fr: Visionneuse : Correction d'une régression entraînant le fait que des raccourcis personnalisés avec la touche Shift enfoncée ne fonctionnaient pas
pt_br: Visualizador: Corrige regressão que fazia com que atalhos personalizados com a tecla Shift não funcionassem

source: Viewer: In dark mode when showing images with transparency in the popup use a light background color as most images are designed with a light background color in mind.
fr: Visionneuse : En mode nuit, lorsque vous affichez des images avec transparence dans la fenêtre contextuelle, utilisation d'une couleur de fond claire car la plupart des images sont conçues avec une couleur de fond claire à l'esprit.
pt_br: Visualizador: No modo escuro, ao mostrar imagens com transparência na janela popup, usa um fundo claro, uma vez que a maioria das imagens é desenhada tendo um fundo claro em mente.

source: Fix a regression in the previous release that broke conversion of DJVU files
fr: Correction d'une régression dans la version précédente qui empêchait la conversion des fichiers DJVU
pt_br: Corrige uma regressão na versão anterior que danificou a conversão de arquivos DJVU

source: Metadata edit: "Set to Undefined" button missing on integer columns.
fr: Modification des métadonnées : le bouton "Définir à Indéfini" est manquant sur les colonnes de nombres entiers.
pt_br: Editar metadados: Botão "Marcar como Indefinido" ausente em colunas de inteiros.

source: Entry remains underlined in Tag browser after clearing filter
fr: L'entrée reste soulignée dans le Navigateur d'étiquettes après avoir nettoyé le filtre

source: XML Catalogs: Fix languages field missing
fr: Catalogues XML : Correction du fait que le champ des langues manquait
pt_br: Catálogos XML: Corrige ausência do campo de idioma

source: Fix a regression that broke loading of third party plugins that are encoded in an encoding other than UTF-8
fr: Correction d'une régression qui empêchait le chargement de plugins tiers encodés dans un encodage autre que l'UTF-8
pt_br: Corrige uma regressão que danificou o carregamento de plugins de terceiro que usam outra codificação que não seja UTF-8

source: macOS: Fix viewer not responding to cmd+c to copy text by default
fr: macOS : Correction de la visionneuse ne répondant pas à cmd+c pour copier le texte par défaut
pt_br: macOS: Corrige o visualizador não respondendo a cmd+c para copiar o texto por padrão

source: Windows: Fix sending email on computers with non-ASCII computer names
fr: Windows : Correction de l'envoi de courrier électronique sur les ordinateurs dont le nom est en non-ASCII
pt_br: Windows: Corrige envio de e-mails em computadores com nomes com caracteres não ASCII

source: 30 Oct, 2020
fr: 30 octobre 2020
pt_br: 30 de Outubro de 2020

source: Windows: Allow adding of books to calibre from folders whose path length is larger than 260 characters
fr: Windows : Permettre d'ajouter des livres à calibre de dossiers dont la longueur du chemin d'accès est supérieure à 260 caractères
pt_br: Windows: Permite adicionar livros ao calibre a partir de pastas cujo comprimento do caminho é maior que 260 caracteres

source: Tag browser: Add an option in Preferences-&gt;Look &amp; feel-&gt;Tag browser to allow the tag browser to get keyboard focus
fr: Navigateur d'étiquettes : Ajout une option dans Preferences-&gt;Apparence &amp ; présentation-&gt;Navigateur d'étiquettes pour permettre à celui-ci d'obtenir le focus du clavier
pt_br: Navegador de etiquetas: Adiciona uma opção em Preferências-&gt;Aparência-&gt;Navegador de etiquetas para permitir que o Navegador de etiquetas tenha o foco do teclado

source: Tag browser: Allow editing the set of permissible values and colors for a custom column with fixed values, by right clicking on it.
fr: Navigateur d'étiquettes :Permettre de modifier l'ensemble des valeurs et des couleurs autorisées pour une colonne personnalisée avec des valeurs fixes, en cliquant dessus avec le bouton droit de la souris.
pt_br: Navegador de etiquetas: Permite editar o conjunto de valores permitidos e cores para uma coluna personalizada com valores fixos, clicando nela com o botão direito.
