Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: PDF input: Replace paragraph separator characters with spaces
fr: Format PDF en entrée : Remplacer les caractères de séparation des paragraphes par des espaces
pt_br: Entrada PDF: Substitui os caracteres separadores de parágrafo por espaços

source: 26 Feb, 2021
fr: 26 février 2021
pt_br: 26 de Fevereiro de 2021

source: E-book viewer: When searching start the search from the current position, jumping to the first match at or after the current page
fr: Visionneuse de livres numériques : Lorsque vous effectuez une recherche, lance la recherche à partir de la position actuelle, en sautant à la première correspondance à la page actuelle ou après celle-ci
pt_br: Visualizador de e-books: Ao pesquisar, inicia a busca a partir da posição atual, saltando para a primeira correspondência na página atual ou depois dela.

source: E-book viewer: Have the Table of Contents view automatically scroll to keep the chapter being read currently visible
fr: Visionneuse de livres numériques : Fait défiler automatiquement la Table des Matières pour que le chapitre en cours de lecture reste visible
pt_br: Visualizador de e-books: Faz com que a visualização do Índice automaticamente role para manter visível o capítulo em leitura

source: Various improvements to the calibre template language, see <a href="%(h0)s">%(h0)s</a>
fr: Diverses améliorations du langage de modèle de calibre, voir <a href="%(h0)s">%(h0)s</a>
pt_br: Várias melhorias na linguagem de modelo do calibre, veja <a href="%(h0)s">%(h0)s</a>

source: Edit book: File browser: Show total size of items in category when hovering over category with mouse
fr: Éditer le livre : Navigateur de fichiers : Afficher la taille totale des articles de la catégorie en passant la souris sur la catégorie
pt_br: Editar livro: Navegador de arquivos: Mostra o tamanho total dos itens em uma categoria ao passar o mouse sobre ela

source: Kobo driver: Add support for latest firmware and also an option to choose the color used for cover letterboxing
fr: Pilote Kobo : Ajout de la prise en charge des derniers microprogrammes et d'une option permettant de choisir la couleur utilisée pour la couverture boîte aux lettres
pt_br: Driver Kobo: Adiciona suporte ao último firmware e também uma opção para escolher a cor utilizada para fazer letterbox na capa

source: E-book viewer: Fix selection popup bar sometimes going off screen when dragging up to the top line of text
fr: Visionneuse de livres numériques : Correction de la barre de sélection qui s'affiche parfois hors de l'écran lorsqu'on la fait glisser jusqu'à la première ligne du texte
pt_br: Visualizador de e-books: Corrige a barra de seleção algumas vezes saindo da tela ao arrastar para a linha superior do texto

source: Get books: Update the Biblio and Chitanka stores for website changes
fr: Obtenir des livres : Mise à jour des boutiques Biblio et Chitanka en raison de modifications apportées au site web
pt_br: Obter livros: Atualiza as lojas Biblio e Chitanka por conta de alterações no sites

source: Edit book: Fix editing of JavaScript files not working
fr: Éditer le livre : Correction de l'édition des fichiers JavaScript ne fonctionnant pas
pt_br: Editar livro: Corrige edição de arquivos JavaScript não funcionando

source: 12 Feb, 2021
fr: 12 février 2021
pt_br: 12 de Fevereiro de 2021

source: Edit book: Add a tool to split the tag at the current cursor position, creating a new tag with the same style and class attributes. To add the tool go to the Toolbars section in the editor preferences
fr: Éditer le livre : Ajout d'un outil permettant de diviser la balise à la position actuelle du curseur, créant ainsi une nouvelle balise avec les mêmes attributs de style et de classe. Pour ajouter l'outil, aller à la section Barres d'outils dans les préférences de l'éditeur
pt_br: Editar livro: Adiciona uma ferramenta para dividir a tag na posição atual do cursor, criando uma nova tag com os mesmos atributos style e class. Para adicionar a ferramenta, vá para a seção de Barra de ferramentas nas preferências do editor

source: E-book viewer: Show the URL when hovering over external links
fr: Visionneuse de livres numériques : Afficher l'URL lors du survol de liens externes
pt_br: Visualizador de e-books: Mostra a URL ao passar o mouse sobre links externos

source: E-book viewer: Redesign the reference mode to also work on touch screens without a mouse. Now in reference mode paragraph numbers are displayed for all paragraphs
fr: Visionneuse de livres numériques : Redéfinition du mode de référence pour qu'il fonctionne également sur les écrans tactiles sans souris. Maintenant en mode référence, les numéros de paragraphes sont affichés pour tous les paragraphes
pt_br: Visualizador de e-books: Redesenhado o modo de referência para também funcionar em telas sensíveis ao toque, sem um mouse. Agora no modo de referência, os números dos parágrafos são exibidos para todos os parágrafos.

source: Edit book: Allow Ctrl-clicking on class names to jump to the first style rule that matches the tag and class
fr: Éditer le livre : Autoriser Ctrl-clic sur les noms de classe pour passer à la première règle de style qui correspond à la balise et à la classe
pt_br: Editar livro: Permite Ctrl+Clique nos nomes de classes para pular para a primeira regra de estilo que corresponde à tag e à classe

source: Content server: When browsing highlights for a book allow selecting multiple highlights to delete or export quickly
fr: Serveur de contenu : Lors de la recherche des mises en évidence d'un livre, permettre de sélectionner plusieurs mises en évidence pour les supprimer ou les exporter rapidement
pt_br: Servidor de conteúdo: Ao explorar os destaques de um livro, permite selecionar múltiplos destaques para apagar ou exportar rapidamente

source: Allow creating keyboard shortcuts to copy show and view URLs for selected books to clipboard
fr: Permettre de créer des raccourcis clavier pour copier dans le presse-papiers les URL des livres sélectionnés et les afficher
pt_br: Permite a criação de atalhos de teclado para copiar URLs calibre (mostrar e visualizar) dos livros selecionados para a área de transferência

source: calibredb: Add a timeout option to control the timeout when connecting to the calibre server
fr: calibredb : Ajout d'une option permettant de contrôler le délai d'attente lors de la connexion au serveur calibre
pt_br: calibredb: Adiciona uma opção de timeout para controlar o tempo de expiração ao se conectar com o servidor do calibre

source: Content server: Fix dragging selection handles not working in Safari
fr: Serveur de contenu : Correction du glissement des poignées de sélection ne fonctionnant pas dans Safari
pt_br: Servidor de conteúdo: Corrige alças de seleção não funcionando no Safari

source: E-book viewer: Fix links with a href of "#" not working
fr: Visionneuse de livres numériques : Correction des liens avec href dont le "#" ne fonctionne pas
pt_br: Visualizador de e-books: Corrige links com um href de "#" não funcionando

source: E-book viewer: Hide the controls when clicking the back or forward buttons
fr: Visionneuse de livres numériques : Cacher les contrôles en cliquant sur les boutons retour ou avancer
pt_br: Visualizador de e-books: Oculta os controles ao clicar os botões de voltar e avançar

source: E-book viewer: When jumping to a highlight using the highlights panel, the back button should return to position before jump
fr: Visionneuse de livres numériques : Lorsque vous passez à un élément mis en évidence à l'aide du panneau des mises sen évidence, le bouton Retour doit revenir à sa position d'origine
pt_br: Visualizador de e-books: Ao pular para um destaque utilizando o painel de destaques, o botão de voltar deve retornar para a posição anterior ao salto

source: E-book viewer: Fix incorrect tooltip when hovering over a section title in the search results list
fr: Visionneuse de livres numériques : Correction d'une info-bulle incorrecte lors du survol d'un titre de section dans la liste des résultats de recherche
pt_br: Visualizador de e-books: Corrige dica de tela incorreta ao passar o mouse sobre um título de seção na lista dos resultados de busca

source: HTMLZ Output: Fix a regression in calibre 5 that broke creating HTMLZ documents when using the option to place CSS inline
fr: Format HTMLZ en sortie : Correction d'une régression de calibre 5 qui empêchait la création de documents HTMLZ lors de l'utilisation de l'option de mise en ligne du CSS
pt_br: Saída HTMLZ: Corrige uma regressão no calibre 5 que danificou a criação de documentos HTMLZ ao usar a opção de colocar o CSS em linha

source: 22 Jan, 2021
fr: 22 janvier 2021
pt_br: 22 de Janeiro de 2021

source: Bulk metadata edit: Add a new control to compress the cover image files for all selected books
fr: Édition de métadonnées par lot : Ajout d'un nouveau contrôle pour compresser les fichiers d'images de couverture de tous les livres sélectionnés
pt_br: Editar metadados em lote: Adiciona um novo controle para comprimir os arquivos de imagem de capa para todos os livros selecionados

source: Add support for the CB7 comic file file format
fr: Ajout de la prise en charge du format de fichier bande dessinée CB7
pt_br: Adiciona suporte para o formato de arquivo CB7

source: E-book viewer: Allow adding a button to the selection bar that copies the currently selected text along with a calibre:// URL to show the text in the book
fr: Visionneuse de livres numériques : Permettre d'ajouter un bouton à la barre de sélection qui copie le texte actuellement sélectionné avec une URL calibre:// pour afficher le texte dans le livre
pt_br: Visualizador de e-books: Permite adicionar um botão à barra de seleção que copia o texto selecionado juntamente com o URL calibre:// para exibir o texto no livro

source: Conversion: Insert metadata: Allow showing identifiers such as ISBN in the jacket page template
fr: Conversion : Insérer des métadonnées : Autoriser l'affichage d'identifiants tels que l'ISBN dans le modèle de page de garde
pt_br: Conversão: Inserir metadados: Permite exibir identificadores como o ISBN no modelo de sobrecapa de metadados

source: Conversion: Insert metadata: Allow hiding entries in the jacket template when they are not present in the metadata
fr: Conversion : Insérer des métadonnées : Permettre de masquer les entrées dans le modèle de page de garde lorsqu'elles ne sont pas présentes dans les métadonnées
pt_br: Conversão: Inserir metadados: Permite ocultar entradas no modelo de sobrecapa quando elas não estão presentes nos metadados

source: calibre-server --manage-users: Add a scriptable interface: calibre-server --manage-users -- help
fr: calibre-server --manage-users: Ajout d'une interface scriptable : calibre-server --manage-users -- help
pt_br: calibre-server --manage-user: Adiciona uma interface para scripts: calibre-server --manage-users --help

source: E-book viewer: Add keyboard shortcuts to copy the current location to the clipboard
fr: Visionneuse de livres numériques : Ajout de raccourcis clavier pour copier l'emplacement actuel dans le presse-papiers
pt_br: Visualizador de e-books: Adiciona atalhos de teclado para copiar a localização atual para a área de transferência

source: E-book viewer: Highlight all currently visible Table of Contents entries, not just the first
fr: Visionneuse de livres numériques : Mettre en évidence toutes les entrées de la Table des Matières actuellement visibles, et pas seulement la première
pt_br: Visualizador de e-books: Destacar todas as entradas visíveis do Sumário, e não apenas a primeira

source: Add a new tweak under Preferences-&gt;Tweaks-&gt;Author sort name algorithm to optionally recognize common surname prefixes such as von, van, de, etc. when generating sort names.
fr: Ajoutez un nouveau réglage sous Préférences-&gt;Ajustements-&gt;Algorithme de tri des noms d'auteur pour reconnaître éventuellement les préfixes de noms de famille courants tels que von, van, de, etc. lors de la génération des noms de tri.
pt_br: Adiciona um novo ajuste em Preferências-&gt;Ajustes-&gt;Algoritmo de classificação por Autor, para opcionalmente reconhecer prefixos de sobrenomes comuns como von, van, de, etc. ao gerar a ordem dos nomes.

source: E-book viewer: Move read aloud pop-up bar to the bottom of the screen in flow mode
fr: Visionneuse de livres numériques : Déplacer la barre de lecture à haute voix vers le bas de l'écran en mode flux
pt_br: Visualizador de e-books: Move o barra de Leitura em Voz Alta para a parte inferior da tela no modo fluxo

source: E-book viewer: Fix scrolling with two fingers on touch pad on macOS not smooth
fr: Visionneuse de livres numériques : Correction du défilement avec deux doigts sur le pavé tactile de MacOS qui n'était pas fluide
pt_br: Visualizador de e-books: Corrige rolagem com dois dedos no touch pad no macOS não sendo suave

source: PDF Output: When converting fixed layout input documents fix anchors inserted for navigation sometimes being rendered as blue boxes
fr: Format PDF en sortie : Lors de la conversion de documents d'entrée à mise en page fixe, les ancres fixes insérées pour la navigation sont parfois rendues sous forme de boîtes bleues
pt_br: Saída PDF: Ao converter documentos de entrada com layout fixo, corrige âncoras inseridas para navegação às vezes sendo renderizadas como baixas azuis

source: Edit book: Remove unused CSS: Fix selectors that don't match from CSS rules containing multiple selectors not being removed
fr: Éditer le livre : Supprimer les CSS non utilisés : Correction des sélecteurs qui ne correspondent pas aux règles CSS contenant des sélecteurs multiples qui ne sont pas supprimés
pt_br: Editar livro: Remover regras CSS não usadas: Corrige seletores não usados não sendo removidos de regras CSS com múltiplos seletores

source: Bulk metadata download: Fix series number not being changes if the series is the same as the existing series
fr: Téléchargement de métadonnées en lot : Correction du numéro de la série qui ne changeait pas si la série est la même que la série existante
pt_br: Download de metadados em lote: Corrige número de série não sendo alterado se o nome da série não for alterado

source: E-book viewer: Fix a regression that caused non-HTML descriptions to not be displayed in the metadata page
fr: Visionneuse de livres numériques : Correction d'une régression qui empêchait l'affichage des descriptions non-HTML dans la page de métadonnées
pt_br: Visualizador de e-books: Corrige uma regressão que fazia com que descrições não-HTML não fossem exibidas na página de metadados

source: E-book viewer: Fix clock being displayed in 24 hr format on some systems even though system locale is set to use 12 hr format.
fr: Visionneuse de livres numériques : Correction de l'affichage de l'horloge au format 24 heures sur certains systèmes, même si la locale du système est réglée pour utiliser le format 12 heures.
pt_br: Visualizador de e-books: Corrige relógio sendo exibido no formato 24h em alguns sistemas, mesmo que a configuração do sistema esteja definida para usar o formato 12h.

source: Bulk metadata edit: Fix regression that inverted the meaning of the case sensitivity setting in the Search &amp; replace tab
fr: Modification des métadonnées par lot : Correction d'une régression qui inversait le sens du paramètre de sensibilité à la casse dans l'onglet Rechercher &amp; remplacer
pt_br: Editar metadados em lote: Corrige regressão que inverteu a correspondência de maíusculas/minúsculas na aba Buscar e substituir

source: calibredb list: Fix incorrect output when redirecting to file
fr: liste calibredb : Correction d'une sortie incorrecte lors de la redirection vers un fichier
pt_br: calibredb list: Corrige saída incorreta ao redirecionar para um arquivo

source: 5.10.1 fixes a regression in 5.10.0 that broke conversion when including metadata as a jacket page and using long text custom columns
fr: 5.10.1 corrige une régression dans la version 5.10.0 qui empêchait la conversion lors de l'inclusion de métadonnées dans une page de garde et de l'utilisation de colonnes personnalisées texte long
pt_br: 5.10.1 corrige uma regressão na versão 5.10.0 que danificou a conversão ao incluir metadados como uma sobrecapa, utilizando colunas personalizadas de texto longo

source: 08 Jan, 2021
fr: 08 janvier 2021
pt_br: 08 de Janeiro de 2021

source: Annotations: Allow exporting highlights and bookmarks in Markdown format, with a link to open the book at the highlight location
fr: Annotations : Permettre d'exporter les faits marquants et les signets au format Markdown, avec un lien pour ouvrir le livre à l'endroit où se trouve le fait marquant
pt_br: Anotações: Permite exportar destaques e marcadores no formato Markdown, com um link para o livro no local do destaque

source: Content server viewer: Allow exporting all highlights
fr: Visionneuse de serveur de contenu : Permettre d'exporter toutes les mises en évidence
pt_br: Visualizador do Servidor de conteúdo: Permite exportar todos os destaques

source: Icon rules editor: Add a button to open the icons folder
fr: Éditeur de règles d'icônes : Ajout d'un bouton pour ouvrir le dossier des icônes
pt_br: Editor de regras de ícone: Adiciona um botão para abrir a pasta de ícones

source: Quickview: Dropdown menu for all selectable columns
fr: Affichage rapide : Menu déroulant pour toutes les colonnes sélectionnables
pt_br: Visualização rápida: Menu suspenso para todas as colunas selecionáveis

source: Fix a regression that caused the Content server to crash if a client closed a connection during a file transfer on macOS and Linux.
fr: Correction d'une régression qui provoquait le plantage du serveur de contenu si un client fermait une connexion pendant un transfert de fichier sous macOS et Linux.
pt_br: Corrige uma regressão que fazia com que o Servidor de conteúdo travasse se o cliente encerrasse uma conexão durante uma transferência de arquivo no macOS e no Linux.

source: LRF Output: Fix conversion broken in calibre 5 when font size rescaling is active
fr: Format LRF en sortie : Correction de la conversion dans calibre 5 lorsque le redimensionnement de la taille des polices est actif
pt_br: Saída LRF: Corrige conversão danificada no calibre 5, quando o redimensionamento de fontes está ativo

source: E-book viewer: Cancel any speech in progress when hiding the selection popup bar after triggering the speak aloud action on it
fr: Visionneuse de livres numériques : Annuler tout discours en cours lorsque vous masquez la barre de sélection après avoir déclenché l'action de parler à voix haute sur celle-ci
pt_br: Visualizador de e-books: Cancela qualquer leitura em andamento ao esconder a barra de seleção após acionar a ação de leitura em voz alta

source: Color/icon rules editor: Fix duplicate rule button not working correctly
fr: Éditeur de règles de couleur/icônes : Correction du bouton de règle en double qui ne fonctionne pas correctement
pt_br: Editor de regras de cores/ícones: Corrige botão para duplicar regras não funcionando corretamente

source: Fix dropping files onto Book details causing an error if the confirmation dialog is disabled
fr: Correction du dépôt de fichiers sur les Détails du livre causant une erreur si le dialogue de confirmation est désactivé
pt_br: Corrige soltar arquivos nos Detalhes do livro causando um error se o diálogo de confirmação estiver desativado

source: 24 Dec, 2020
fr: 24 décembre 2020
pt_br: 24 de Dezembro de 2020

source: Happy holidays to all calibre users!
fr: Joyeuses fêtes à tous les utilisateurs de calibre !
pt_br: Boas Festas para todos os usuários do calibre!

source: E-book viewer: Add a mode to follow links with only the keyboard (triggered by Alt+F)
fr: Visionneuse de livres numériques : Ajout d'un mode pour suivre les liens avec le clavier uniquement (déclenché par Alt+F)
pt_br: Visualizador de e-books: Adiciona um modo para seguir links apenas com o teclado (ativado por Alt+F)

source: Edit book: A new option to show a configurable number lines above the current line when syncing the position of the preview panel to the current position in the code editor (under Preview settings in the Editor preferences).
fr: Éditer le livre : Une nouvelle option pour afficher un nombre configurable de lignes au-dessus de la ligne courante lors de la synchronisation de la position du panneau de prévisualisation avec la position courante dans l'éditeur de code (sous Paramètres de prévisualisation dans les préférences de l'éditeur).
pt_br: Editar livro: Uma nova opção para mostrar um número configurável de linhas acima da linha atual ao sincronizar a posição do painel de visualização com a posição do editor de código (em Ajustes da visualização, nas Opções do Editor).

source: Windows: Automatically resolve shortcuts (.lnk files) when adding books to calibre.
fr: Windows : Résolution automatique des raccourcis (fichiers .lnk) lors de l'ajout de livres au calibre.
pt_br: Windows: Resolve automaticamente atalhos (arquivos .lnk) ao adicionar livros ao calibre.

source: Content server viewer: Don't enter full screen mode automatically when reading on desktop like devices (this can be controlled via a setting in the viewer preferences under Page layout)
fr: Visionneuse du serveur de contenu : Ne pas passer automatiquement en mode plein écran lors de la lecture sur des appareils de bureau (ceci peut être contrôlé via un paramètre dans les préférences de la visionneuse sous Mise en page)
pt_br: Visualizador do Servidor de conteúdo: Não entra em modo de tela cheia automaticamente ao ler em dispositivos como computador (isso pode ser controlado via configuração nas preferências do visualizador, sob Layout da página).

source: E-book viewer tool bar: Add a select all action and a Read aloud action (can be added by right clicking the tool bar and configuring it)
fr: Barre d'outils de la Visionneuse de livres numériques : Ajout d'une action Sélectionner tout et d'une action Lire à haute voix (peut être ajoutée en cliquant avec le bouton droit de la souris sur la barre d'outils et en la configurant)
pt_br: Barra de ferramentas do Visualizador de e-books: Adiciona uma ação para selecionar tudo e uma ação para Leitura em voz alta (pode ser adicionado clicando com o botão direito na barra de ferramentas e configurando-a)

source: Template/formatter enhancements: Add a 'for' statement and add the ability for a developer to pass extra information to a template.
fr: Améliorations des modèles/formats : Ajout d'une déclaration 'for' et possibilité pour un développeur de transmettre des informations supplémentaires à un modèle.
pt_br: Melhorias de Modelo/fomatador: Adiciona uma expressão 'for' e adiciona a habilidade para um desenvolvedor passar informação extra para um modelo.

source: Rules editors for icon/coloring rules: Add a button to duplicate rules and to convert a rule to advanced template mode
fr: Editeurs de règles pour les règles d'icônes/coloris : Ajout d'un bouton pour dupliquer les règles et pour convertir une règle en mode modèle avancé
pt_br: Editores de regras para regras de ícones/colorização: Adiciona um botão para duplicar regras e converter uma regra para o modo de modelo avançado

source: Content server viewer: Fix regression in 5.0 that broke scrolling on iOS
fr: Visionneuse du serveur de contenu : Correction de la régression dans la version 5.0 qui ne permettait pas le défilement sur iOS
pt_br: Visualizador do Servidor de conteúdo: Corrige regressão no calibre 5.0 que danificou a rolagem no iOS

source: E-book viewer: Fix error when scrolling to some search results in flow mode
fr: Visionneuse de livres numériques : Correction d'une erreur lors du défilement de certains résultats de recherche en mode flux
pt_br: Visualizador de e-books: Corrige erro ao rolar para alguns resultados de pesquisa no modo fluxo
