Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Windows: Fix error on first run of calibre after install/upgrade
fr: Windows : Correction d'une erreur lors de la première exécution de calibre après l'installation/mise à jour
pt_br: Windows: Corrige erro na primeira execução do calibre após instalação/atualização

source: Viewer: Fix copy to clipboard button in toolbar not working
fr: Visionneuse : Correction du bouton "Copier dans le presse-papiers" de la barre d'outils qui ne fonctionnait pas
pt_br: Visualizador: Corrige botão de copiar para a área de transferência na barra de ferramentas não funcionando

source: Viewer: Fix copy to clipboard not copying text as HTML to clipboard in addition to plain text
fr: Visionneuse : Correction de la copie dans le presse-papiers ne copiant pas le texte en HTML dans le presse-papiers en plus du texte en clair
pt_br: Visualizador: Corrige copiar para área de transferência não copiando texto como HTML, além do texto puro

source: macOS: Fix some drop down menus such as in the ToC editor and cover generation in the Edit metadata dialog not working
fr: macOS : Correction de certains menus déroulants tels que dans l'éditeur de TdM et génération de couverture dans la boîte de dialogue Editer les métadonnées qui ne fonctionnaient pas
pt_br: macOS: Corrige alguns menus suspensos não funcionando, como no Editor de índice e geração de capas no diálogo Editar metadados

source: 25 Sep, 2020
fr: 25 septembre 2020
pt_br: 25 de Setembro de 2020

source: For details on the major changes in calibre between 4.0 and 5.0, see <a href="%(h0)s">%(h0)s</a>
fr: Pour des détails sur les changements majeurs dans calibre entre la version 4.0 et la version 5.0 voir <a href="%(h0)s">%(h0)s</a>
pt_br: Para detalhes sobre as principais mudanças no calibre entre as versões 4.0 e 5.0, veja <a href="%(h0)s">%(h0)s</a>

source: E-book viewer: Add support for highlighting
fr: Visionneuse de livre numérique : Ajout de la prise en charge de la mise en évidence
pt_br: Visualizador de e-books: Adiciona suporte para destaques

source: E-book viewer: Add support for right-to-left and vertical text
fr: Visionneuse de livres électroniques : Ajout de la prise en charge des textes de droite à gauche et des textes verticaux
pt_br: Visualizador de e-books: Adiciona suporte para texto vertical e na direção direita-para-esquerda.

source: Switch calibre to Python 3. This means that some no longer maintained third party plugins will not work. See <a href="%(h0)s">%(h0)s</a>
fr: Passage de calibre à Python 3. Cela signifie que certains plugins tiers qui ne sont plus maintenus ne fonctionneront pas. Voir <a href="%(h0)s">%(h0)s</a>
pt_br: Migração do calibre para Python 3. Isto significa que alguns plugins de terceiros sem manutenção não irão funcionar. Veja <a href="%(h0)s">%(h0)s</a>

source: Dark mode support for the Content server and E-book viewer user interfaces
fr: Prise en charge du mode nuit pour les interfaces utilisateur du serveur de contenu et de la visionneuse de livres électroniques
pt_br: Suporte ao modo escuro para as interfaces do Servidor de conteúdo e Visualizador de e-books

source: Content server's in-browser viewer now supports bookmarking. Bookmarks and highlights are auto-synced across devices.
fr: La visionneuse du serveur de contenu dans le navigateur prend désormais en charge l'ajout de signets. Les signets et les mises en évidence sont synchronisés automatiquement entre les appareils.
pt_br: O visualizador do browser no Servidor de Conteúdo agora suporta marcadores. Marcadores e destaques são sincronizados automaticamente entre dispositivos.

source: Regular expression engine used for searching the book list and reading metadata from filenames has been made more powerful.
fr: Le moteur d'expressions régulières utilisé pour la recherche dans la liste des livres et la lecture des métadonnées des noms de fichiers a été rendu plus puissant.
pt_br: O mecanismo de Expressão Regular, usado para busca na lista de livros e leitura de metadados a partir do nome de arquivos, tornou-se mais potente.

source: Version 5.0.1 fixes a bug in 5.0.0 that broke connecting to devices on macOS
fr: La version 5.0.1 corrige un bogue de la version 5.0.0 qui empêchait la connexion aux appareils sous MacOS
pt_br: Versão 5.0.1 corrige um erro na versão 5.0.0 que danificou a conexão de dispositivos no macOS

source: 21 Aug, 2020
fr: 21 août 2020
pt_br: 21 de Agosto de 2020

source: Kobo driver: Add support for new firmware. Also add recognition of 'Kobo Plus' subscription books
fr: Pilote Kobo : Ajout de la prise en charge du nouveau firmware. Ajout de la reconnaissance des abonnements à "Kobo Plus".
pt_br: Driver Kobo: Adiciona suporte para o novo firmware. Também adiciona reconhecimento de livros provenientes de inscrição no 'Kobo Plus'.

source: Edit book: Allow customizing the base background/foreground and link colors for the preview window.
fr: Éditer le livre : Permet de personnaliser l'arrière-plan/le premier plan de base et les couleurs des liens pour la fenêtre de prévisualisation.
pt_br: Editar livro: Permite a customização das cores de primeiro plano e de fundo, além de links, para a janela de pré-visualização.

source: Quickview panel: Add actions to the context menu to search for book in library, open in E-book viewer, etc.
fr: Panneau Affichage rapide : Ajout d'actions au menu contextuel pour rechercher un livre dans la bibliothèque, l'ouvrir dans la visionneuse de livre numérique, etc.
pt_br: Painel de Visualização rápida: Adiciona ações ao menu de contexto para buscar livros na biblioteca, abrir no visualizador de e-books, etc.

source: Allow forcing calibre to remember the column width for the On device column by right clicking the header of the column
fr: Permettre de forcer calibre à se souvenir de la largeur de la colonne "On device" en faisant un clic droit sur l'en-tête de la colonne
pt_br: Permite forçar o calibre a se lembrar da largura da coluna 'No dispositivo', clicando com o botão direito no cabeçalho da coluna

source: Template language: Add functions to perform math operations to convert fractional numbers to integers
fr: Langue du modèle : Ajout de fonctions pour effectuer des opérations mathématiques afin de convertir des nombres fractionnaires en nombres entiers
pt_br: Linguagem de Modelos: Adiciona funções para realizar operações matemáticas para converter números fracionários em inteiros

source: Content server: Fix Esc key not working in several views.
fr: Serveur de contenu : Correction du fait que la touche Esc ne fonctionnait pas dans plusieurs vues.
pt_br: Servidor de conteúdo: Corrige a tecla Esc não funcionando em várias ocasiões.

source: Fix unable to delete default value for custom columns of boolean type, once set
fr: Correction de l'impossibilité de supprimer la valeur par défaut pour les colonnes personnalisées de type booléen, une fois définies
pt_br: Corrige erro que não permitia deletar valores padrões para colunas personalizadas do tipo booleanas, uma vez que fossem definidos

source: EPUB Output: When splitting don't consider files with only a single character empty
fr: Format EPUB en sortie : Lors du fractionnement, ne pas considérer les fichiers ne comportant qu'un seul caractère comme vides
pt_br: Saída EPUB: Ao dividir, não considerar como vazios arquivos com um único caractere

source: Comments editor: Fix syntax coloring for HTML view in dark mode
fr: Éditeur de commentaires : Correction de la coloration syntaxique pour la vue HTML en mode nuit
pt_br: Editor de comentários: Corrige sintaxe de coloração para a visualização HTML no modo escuro

source: Book list: When a series column is not wide enough, elide text in the middle so that the series number is visible
fr: Liste de livres : Lorsque la colonne d'une série n'est pas assez large, élider le texte au milieu pour que le numéro de la série soit visible
pt_br: Lista de livros: Quando uma coluna de série não é larga o bastante, encurta o texto no meio, de tal forma que o número de série permaneça visível

source: Comments editor: Add a shortcut for "Paste and match style" (Ctrl+Shift+v)
pt_br: Editor de comentários: Adiciona um atalho para "Colar e combinar estilo" (Ctrl+Shift+v)

source: Google search engine: Fix for different URL encoding used by Google servers in Portugal
pt_br: Mecanismo de busca do Google: Correção para diferentes codificações de URL utilizados pelos servidores do Google em português
