Repository: Xjocinx/calibre-translations
Catalog: changelog/*.po
Languages: fr, pt_br

source: Edit metadata dialog: Make most custom metadata controls use only a single line.
fr: Boîte de dialogue d'édition des métadonnées : La plupart des contrôles de métadonnées personnalisés n'utilisent qu'une seule ligne.
pt_br: Diálogo de edição de metadados: Faz com que a maioria dos controles de metadados personalizados usem uma única linha.

source: Elide the names of custom columns that are longer than a fixed width, instead of using multiple lines. Configurable via Preferences-&gt;Tweaks-&gt;Edit metadata custom column label length
fr: Élision des noms des colonnes personnalisées qui sont plus longues qu'une largeur fixe, au lieu d'utiliser plusieurs lignes. Configurable via Préférences-&gt;Ajustements-&gt;Modifier les métadonnées longueur du libellé de la colonne personnalisée
pt_br: Oculta o nome de colunas personalizadas que são maiores que uma certa largura fixa, em vez de usar múltiplas linhas. Configurável via Preferências-&gt;Ajustes-&gt;Editar comprimento do rótulo de colunas personalizadas

source: Edit book: Remove unused CSS: Add an option to merge CSS rules that have identical properties
fr: Éditer le livre : Supprimer les CSS non utilisés : Ajout d'une option pour fusionner les règles CSS qui ont des propriétés identiques
pt_br: Editar livro: Remover regras CSS não utilizadas: Adiciona uma opção para mesclar regras CSS que tenham propriedades identênticas

source: Book details window: Double clicking on the cover now shows it in the default system image viewer.
fr: Fenêtre de détails du livre : Un double clic sur la couverture l'affiche maintenant dans la visionneuse d'images par défaut du système .
pt_br: Janela de Detalhes do livro: Clique duplo na capa agora exibe-a no visualizador de imagens padrão do sistema.

source: News download: Allow passing username/password in feed URLs.
fr: Téléchargement des actualités : Autoriser le passage du nom d'utilisateur/mot de passe dans les URL des flux.
pt_br: Download de notícias: Permite passar usuário/senha nos URLs de feeds.

source: Open with: Allow renaming Open with applications.
fr: Ouvrir avec : Permettre de renommer les applications Ouvrir avec.
pt_br: Abrir com: Permite renomear programas.

source: Viewer: Fix jumping to search result not always working in flow mode.
fr: Visionneuse : Correction du saut au résultat de recherche ne fonctionnant pas toujours en mode flux.
pt_br: Visualizador: Corrige salto para resultado de pesquisa nem sempre funcionando no modo de fluxo.

source: Get Books: Update Google and Gutenberg plugins for website changes
fr: Obtenir des livres : Mise à jour des plugins Google et Gutenberg pour les changements de sites web
pt_br: Obter livros: Atualiza os plugins do Google e Gutenberg, por conta de mudanças nos sites

source: Viewer: Fix keyboard shortcuts using Ctrl+Alt+letter key not working on Windows.
fr: Visionneuse : Correction des raccourcis clavier en utilisant les touches Ctrl+Alt+lettre qui ne fonctionnaient pas sous Windows.
pt_br: Visualizador: Corrige atalhos de teclado usando Ctrl+Alt+letra não funcionando no Windows.

source: Viewer: Fix keyboard shortcuts to shrink/grow selection not working.
fr: Visionneuse : Correction des raccourcis clavier pour réduire/augmenter la sélection qui ne fonctionnait pas.
pt_br: Visualizador: Corrige atalhos de teclado para diminuir/aumentar seleção não funcionando.

source: Viewer: Fix keyboard shortcut to toggle highlights panel not working when the highlights panel is itself focused.
fr: Visionneuse :Correction du raccourci clavier permettant de basculer le panneau des surbrillances ne fonctionnant pas lorsque le panneau des surbrillances est lui-même sélectionné.
pt_br: Visualizador: Corrige atalho de teclado para ativar painel de destaques não funcionando quando o painel de destaques está em foco.

source: Viewer: handle editing of missing highlights more gracefully
fr: Visionneuse : gérer plus gracieusement l'édition des mises en évidence manquantes
pt_br: Visualizador: lida com edição de destaques ausentes de forma mais amistosa

source: Drivers: Fix regression in calibre 5 that broke connecting to SONY devices
fr: Pilotes : Correction de la régression de calibre 5 qui empêchait la connexion aux appareils SONY
pt_br: Drivers: Corrige uma regressão no calibre 5 que danificou a conexão de dispositivos SONY

source: Open with: On Linux when reading names from .desktop files, use the first matching language
fr: Ouvrir avec : Sous Linux, lorsque vous lisez les noms des fichiers .desktop, utilisez la première langue correspondante
pt_br: Abrir com: No Linux, ao ler nomes de arquivos .desktop, usa a primeira linguagem correspondente encontrada

source: Conversion: Fix a regression in calibre 5 that broke conversion of some malformed CSS stylesheets.
fr: Conversion : Correction d'une régression dans calibre 5 qui a interrompu la conversion de certaines feuilles de style CSS mal formées.
pt_br: Conversão: Corrige uma regressão no calibre 5 que danificou a conversão de alguns tipos de folhas de estilo CSS malformadas.

source: Conversion: Fix a regression in calibre 5 that broke processing of some PDB files with images.
fr: Conversion : Correction d'une régression dans calibre 5 qui empêchait le traitement de certains fichiers PDB contenant des images.
pt_br: Conversão: Corrige uma regressão no calibre 5 que danificou o processamento de alguns arquivos PDB com imagens.

source: Conversion: Fix regression in calibre 5 in the handling of @import() rules in stylesheets that import from folders above themselves.
fr: Conversion : Correction d'une régression dans calibre 5 dans le traitement des règles @import() dans les feuilles de style qui importent à partir de dossiers situés au-dessus d'eux.
pt_br: Conversão: Corrige uma regressão no calibre 5 ao lidar com regras @import() em folhas de estilo que importam de pastas acima delas mesmas.

source: Content server: Fix various controls on the book details page not working when viewing a random book.
fr: Serveur de contenu : Correction de divers contrôles sur la page de détails du livre ne fonctionnant pas lors de la consultation d'un livre aléatoire.
pt_br: Servidor de conteúdo: Corrige vários controles na página de detalhes do livro não funcionando quando visualizando um livro aleatório.

source: Tag browser: Fix a crash when renaming a saved search to a value that already exists.
fr: Navigateur d'étiquettes : Correction d'un plantage lors du renommage d'une recherche sauvegardée à une valeur qui existe déjà.
pt_br: Navegador de etiquetas: Corrige uma falha ao renomear uma busca salva para um valor que já existe.

source: Tag browser: Fix renaming of custom column with fixed set of values not working.
fr: Navigateur d'étiquettes : Correction du renommage de la colonne personnalisée avec un ensemble fixe de valeurs ne fonctionnant pas.
pt_br: Navegador de etiquetas: Corrige renomeação de colunas personalizadas com um conjunto de valores fixos não funcionando.

source: Fix a regression in calibre 5 that broke auto-sync of generated catalogs to devices.
fr: Correction d'une régression dans calibre 5 qui empêchait l'auto-synchronisation des catalogues générés avec les périphériques.
pt_br: Corrige uma regressão no calibre 5 que danificou a auto-sincronização de catálogos com dispositivos.

source: Fix setting rating via ebook-meta command line tool broken in calibre 5.
fr: Correction du réglage de la note via l'outil de ligne de commande ebook-meta endommagé dans calibre 5.
pt_br: Corrige definição de avaliação via ferramenta de linha de comando ebook-meta danificada no calibre 5.

source: When boolean columns are set to bistate, checking "show checkmarks" results in all non-boolean values being shown as false
fr: Lorsque les colonnes booléennes sont réglées sur bistate, la coche "show checkmarks" fait apparaître toutes les valeurs non booléennes comme fausses
pt_br: Quando colunas booleanas são definidas como tendo dois estados, marcar "mostrar marcas de verificação" resulta em todos o valores não booleanos sendo mostrados como falso.

source: Spell check: Fix using non UTF-8 dictionaries broken in calibre 5
fr: Contrôle d'orthographe : Correction de l'utilisation de dictionnaires non UTF-8 endommagée dans calibre 5
pt_br: Verificar ortografia: Corrige uso de dicionários não UTF-8 danificados no calibre 5

source: Fix a rare issue where restarting calibre from within the program would fail.
fr: correction d'un problème rare où le redémarrage de calibre à l'intérieur du programme échouerait.
pt_br: Corrige raro problema que fazia com que o reinício do programa pela GUI pudesse falhar.

source: Version 5.4.2 fixes bugs in 5.4.0 that prevented calibre from starting on macOS and from choosing save file names on Windows.
fr: La version 5.4.2 corrige des bogues de la version 5.4.0 qui empêchaient calibre de démarrer sur macOS et de choisir les noms de fichiers à enregistrer sur Windows.
pt_br: Versão 5.4.2 corrige erros na versão 5.4.0 que não deixava o calibre ser iniciado no macOS, bem como a escolha do nome de arquivos salvos no Windows.

source: 16 Oct, 2020
fr: 16 octobre 2020
pt_br: 16 de Outubro de 2020

source: Tag browser: When grouping items by first letter if adjacent letters have few entries combine them into a single group.
fr: Navigateur d'étiquettes : Lors du regroupement d'articles par la première lettre, si les lettres adjacentes ont peu d'entrées, les combiner en un seul groupe.
pt_br: Navegador de etiquetas: Ao agrupar itens pela primeira letra, caso as letras adjacentes tenham poucas entradas, elas serão combinadas em um único grupo.

source: Can be controlled via an option in Preferences-&gt;Look &amp; feel-&gt;Tag browser to combine 'first letters' together if there are a small number of items under adjacent letters
fr: Peut être contrôlé via une option dans Préférences-&gt;Apparence &amp;Présentation-&gt;Navigateur d'étiquettes pour combiner les "premières lettres" ensemble s'il y a un petit nombre d'éléments sous les lettres adjacentes
pt_br: Pode ser controlado via uma opção em Preferências-&gt;Aparência-&gt;Navegador de Etiquetas para juntar 'primeiras letras' caso haja um pequeno número de itens nas letras adjacentes

source: Viewer: Allow displaying the current page / total pages in the header/footer. Useful in paged mode to see exactly how many pages are left.
fr: Visionneuse : Permettre d'afficher la page en cours / le total des pages dans l'en-tête/le pied de page. Utile en mode pagination pour voir exactement combien de pages il reste.
pt_br: Visualizador: Permite mostrar a página atual / total de páginas no cabeçalho / rodapé. Útil em modo paginado para ver exatamente quantas páginas faltam.

source: Viewer search panel: Show more result context in a tooltip when hovering over a search result.
fr: Panneau de recherche de la visionneuse : Afficher plus de contexte de résultat dans une info-bulle lors du survol d'un résultat de recherche.
pt_br: Painel de busca do Visualizador: Mostra mais contexto do resultado em uma dica de tela ao passar o mouse sobre um resultado de busca.

source: DOCX Input: Add support for Word controls used to rotate or flip images
fr: Format DOCX en entrée : Ajout de la prise en charge des contrôles Word utilisés pour faire pivoter ou retourner les images
pt_br: Entrada DOCX: Adiciona suporte para aos controles do Word usados para rotacionar ou inverter imagens

source: Only works with output formats such as EPUB that support CSS transforms
fr: Ne fonctionne qu'avec des formats de sortie tels que EPUB qui prennent en charge les transformations CSS
pt_br: Somente funciona com formatos como EPUB, que suportam transformações CSS

source: Viewer image pop-up: Allow maximizing/minimizing the window.
fr: Fenêtre contextuelle de l'image de la visionneuse : Permet de maximiser/minimiser la fenêtre.
pt_br: Pop-up de imagem do Visualizador: Permite maximizar/minimizar a janela.

source: Edit metadata dialog: Use only a single line for custom column date fields
fr: Dialogue d'édition des métadonnées : Utiliser une seule ligne pour les champs de date des colonnes personnalisées
pt_br: Diálogo Editar metadados: Usa somente uma linha para colunas personalizadas de datas

source: Add an item to search for categories to the Category editor context menu.
fr: Ajout d'un élément de recherche de catégories au menu contextuel de l'éditeur de Catégories.

source: Category editor: Add a right click menu to change case of the selected entries.
fr: Éditeur de catégorie : Ajout d'un menu clic droit pour changer la casse des entrées sélectionnées.
pt_br: Editor de categorias: Adiciona um menu de contexto para alterar maiúsculas/minúsculas das entradas selecionadas.

source: Fix a regression in 5.0 that caused performance of dialogs that contain title/series/tags edit fields to be very poor with large libraries.
fr: Correction d'une régression dans la version 5.0 qui faisait que les performances des boites de dialogue qui contiennent des champs d'édition de titres/séries/balises étaient très mauvaises avec les grandes bibliothèques.
pt_br: Corrige uma regressão na versão 5.0 que fazia com que a performance de diálogos contendo campos de edição de título/séries/etiquetas fosse muito ruim em grandes bibliotecas.

source: Fix a regression in 5.0 that caused some pop-up menus to appear on the wrong monitor in multi-monitor setups
fr: Correction d'une régression dans la version 5.0 qui entraînait l'apparition de certains menus contextuels sur le mauvais moniteur dans les configurations multi-moniteurs
pt_br: Corrige uma regressão na versão 5.0 que fazia alguns menus pop-up aparecerem no monitor errado, em configurações de múltiplos monitores.

source: macOS: Fix a long standing bug that prevented drag and drop of multiple items
fr: macOS : Correction d'un bogue de longue date qui empêchait le glisser-déposer de plusieurs éléments
pt_br: macOS: Corrige um bug antigo que não permitia arrastar e soltar múltiplos itens

source: Windows: Fix a regression that broke scanning for default programs for the Open with action
fr: Windows : Correction d'une régression qui empêchait l'analyse des programmes par défaut pour l'action Ouvrir avec
pt_br: Windows: Corrige uma regressão que danificou a verificação de programas padrão para a ação de 'Abrir com'

source: Windows: Fix a regression in 5.0 causing some MOBI files with non-BMP characters not being processed correctly.
fr: Windows : Correction d'une régression dans la version 5.0 qui faisait que certains fichiers MOBI avec des caractères non-BMP ne sont pas traités correctement.
pt_br: Windows: Corrige uma regressão na versão 5.0 que fazia com que alguns arquivos MOBI com caracteres não-BMP não fossem processados corretamente.

source: E-book viewer: Fix scrolling past the end of chapter boundaries not working in books that have negative margins
fr: Visionneuse de livre numérique: Correction du défilement au-delà des limites de fin de chapitre qui ne fonctionne pas dans les livres dont les marges sont négatives
pt_br: Visualizador de e-books: Corrige rolagem após o final do capítulo não funcionando em livros que possuem margens negativas

source: Edit metadata dialog: fix incorrect rendering of custom column names that start with emoji.
fr: Dialogue d'édition des métadonnées : correction du rendu incorrect des noms de colonnes personnalisés qui commencent par un émoji.
pt_br: Diálogo Editar metadados: corrige renderização incorreta do nome de colunas personalizadas que se iniciam com um emoji.

source: Quickview: Fix nothing shown after clearing the search.
fr: Aperçu rapide : Corrige le fait que rien ne s'affiche après avoir effacé la recherche.
pt_br: Visualização rápida: Corrige nada aparecendo após limpar uma busca.

source: Dark mode: Fix radio buttons having no outline.
fr: Mode nuit : Correction des boutons radio qui n'ont pas de contour.
pt_br: Modo escuro: Corrige botões de rádio sem contorno.

source: Annotations browser: When showing a book in the calibre library that is not currently visible, display an error.
fr: Navigateur d'annotations : Lorsque vous affichez un livre dans la bibliothèque de calibre qui n'est pas visible actuellement, affiche une erreur.
pt_br: Navegador de anotações: Ao mostrar um livro na biblioteca do calibre que não está atualmente visível, exibe um erro.

source: 07 Oct, 2020
fr: 07 octobre 2020
pt_br: 07 de Outubro de 2020

source: Browse annotations: Add a check box to restrict the displayed annotations to only the books currently selected in the calibre library.
fr: Parcourir les annotations : Ajout d'une case à cocher pour limiter les annotations affichées aux seuls livres actuellement sélectionnés dans la bibliothèque de calibre.
pt_br: Explorar anotações: Adiciona uma caixa de seleção para restringir a exibição das anotações somente aos livros selecionados na biblioteca do calibre.

source: Allow storing and calling functions in the calibre template language (Preferences-&gt;Template functions)
fr: Permettre de stocker et d'appeler des fonctions dans la langue du modèle de calibre (Préférences-&gt;Fonctions du modèle)
pt_br: Permite armazenar e chamar funções na linguagem de modelos do calibre (Preferências-&gt;Funções de modelo)

source: Add a shortcut (Shift+V) to open the last read book.
fr: Ajout d'un raccourci (Shift+V) pour ouvrir le dernier livre lu.
pt_br: Adiciona um atalho (Shift+V) para abrir o último livro lido.

source: Fix import errors with some third party plugin on Windows
fr: Correction d'erreurs d'importation avec certains plugins tiers sous Windows
pt_br: Corrige erros de importação com alguns plugins de terceiros no Windows

source: Viewer: Fix toolbar show controls button not working when no book is open.
fr: Visionneuse : Correction de la barre d'outils montrant que le bouton de contrôle ne fonctionne pas lorsqu'aucun livre n'est ouvert.
pt_br: Visualizador: Corrige botão de mostrar controles não funcionando quando nenhum livro está aberto

source: Viewer: Fix incorrect positioning of context menu for viewer toolbar.
fr: Visionneuse : Correction du positionnement incorrect du menu contextuel de la barre d'outils de la visionneuse.
pt_br: Visualizador: Corrige posicionamento incorreto do menu de contexto para a barra de ferramentas

source: MOBI Input: Fix regression that broke reading of some documents
fr: Format MOBI en entrée : Correction de la régression qui a interrompu la lecture de certains documents
pt_br: Entrada MOBI: Corrige regressão que danificou a leitura de alguns documentos

source: Bulk metadata search and replace: Fix some regular expression causing errors with the new regex engine
fr: Recherche et remplacement de métadonnées par lot : Correction de certaines expressions régulières causant des erreurs avec le nouveau moteur de regex
pt_br: Buscar e substituir metadados em lote: Corrige algumas expressões regulares causando erros com o novo mecanisco regex

source: Fix a regression that broke application of plugboards when sending by e-mail
fr: Correction d'une régression qui interrompait l'application des plug-ins lors de l'envoi par e-mail
pt_br: Corrige uma regressão que danificou a aplicação de quadros de conexão de metadados ao enviar via e-mail

source: ODT Input: Fix a regression that broke conversion of ODT files with footnotes.
fr: Format ODT en entrée : Correction d'une régression qui empêchait la conversion des fichiers ODT avec des notes de bas de page.
pt_br: Entrada ODT: Corrige uma regressão que danificou a conversão de arquivos ODT com notas de rodapé.

source: Viewer: Fix mouse wheel not working while selection bar is visible
fr: Visionneuse : Correction du fait que la molette de la souris ne fonctionnait pas lorsque la barre de sélection est visible
pt_br: Visualizador: Corrige roda do mouse não funcionando enquanto a barra de seleção está visível

source: Viewer: Fix selection popup bar not always close to mouse when ending select-to-drag
fr: Visionneuse : Correction de la barre de sélection qui n'est pas toujours proche de la souris lorsque l'on termine la sélection par glisser-déposer
pt_br: Visualizador: Corrige barra de seleção flutuante nem sempre próxima do mouse ao finalizar a seleção

source: Fix calibre-server not exiting on Ctrl+C on Windows
fr: Correction de calibre-server ne quittant pas sur Ctrl+C sous Windows
pt_br: Corrige calibre-server não finalizando com Ctrl+C no Windows

source: Content server OPDS feeds: Fix error if the metadata for a book contains particular Unicode characters.
fr: Flux OPDS du serveur de contenu : Correction d'une erreur si les métadonnées d'un livre contiennent des caractères Unicode particuliers.
pt_br: Feed OPDS do Servidor de Conteúdo: Corrige erro quando os metadados de um livro contém caracteres particulares Unicode.

source: Edit book: Reports tool: Fix a regression that broke sorting.
fr: Éditer le livre : Outil d'édition de rapports : Corriger une régression qui empêchait le tri.
pt_br: Editar livro: Relatórios: Corrige regressão que danificou a classificação.

source: HTMLZ Output: Fix an error when converting a document that has SVG images
fr: Format HTMLZ en sortie : Correction d'une erreur lors de la conversion d'un document comportant des images SVG
pt_br: Saída HTMLZ: Corrige erro ao converter um documento que contenha imagens SVG

source: 02 Oct, 2020
fr: 02 octobre 2020
pt_br: 02 de Outubro de 2020

source: Enhancement: allow using templates in search expressions
fr: Amélioration : permettre l'utilisation de modèles dans les expressions de recherche
pt_br: Melhoria: permite usar modelos em expressões de busca

source: Viewer lookup panel: Add a checkbox to disable automatic update of lookup when the selected text changes.
fr: Panneau de visualisation : Ajout d'une case à cocher pour désactiver la mise à jour automatique de la recherche lorsque le texte sélectionné change.
pt_br: Painel de definições de palavras do Visualizador: Adiciona uma caixa de seleção para desabilitar atualizações automáticas da definição quando o texto selecionado se altera.

source: Viewer: Allow skipping the confirmation when using the remove highlight button in the popup bar.
fr: Visionneuse : Permettre d'ignorer la confirmation en utilisant le bouton de suppression de la mise en évidence dans la barre contextuelle.
pt_br: Visualizador: Permite pular confirmação ao usar o botão de remover destaques na barra flutuante.

source: ToC Editor: Fix bulk rename of entries not working
fr: Éditeur de la TdM : Correction du renommage en masse des entrées qui ne fonctionnait pas
pt_br: Editor de Índice: Corrige renomeação em massa não funcionando

source: Linux: Fix right clicking on system tray icon not working
fr: Linux : Correction du fait qu'un clic droit sur l'icône de la barre d'état système ne fonctionne pas
pt_br: Linux: Corrige clique com o botão direito no ícone da bandeja não funcionando

source: Fix User category based searches unreliable dues to caching issues
fr: Correction des recherches basées sur les catégories d'utilisateurs en raison de problèmes de mise en cache
pt_br: Corrige busca baseada em Categoria do usuário não sendo confiável devido a problemas de cache

source: PDF Output: Don't fail if the input document has an html file identified as the cover
fr: Format PDF en sortie : N'échoue pas si le document d'entrée comporte un fichier html identifié comme la couverture
pt_br: Saída PDF: Não falha se o documento de entrada tem um arquivo html identificado como capa

source: Catalog generation: Fix a regression that broke generating catalogs if books with no comments are present.
fr: Génération du catalogue : Correction d'une régression qui empêchait la génération de catalogues si des livres sans commentaires sont présents.
pt_br: Geração de catálogo: Corrige uma regressão que danificou a geração de catálogos se livros sem comentários estiverem presentes.
